[
  {
    "year": "2023",
    "title": "Integrating The Impact and World University Rankings for Global Excellence, Internationalization, and Reputation",
    "image": "../images/sdg17p1.png",
    "layout": "right-img",
    "content": [
      "The ASEAN University Network (AUN) Secretariat recently held a well-attended online webinar titled \"Integrating THE Impact and World University Rankings for Global Excellence, Internationalisation, and Reputation.\" This informative session, held on October 17, 2024, provided valuable insights for participants interested in improving their university's standing in global rankings.",
      "The External Affairs and Linkages Office under Urdaneta City University joined the said event to gain valuable insights into enhancing the university's global standing. By participating in this event, the office aimed to explore strategies for improving the university's performance in global rankings, identify opportunities for international collaborations, and ultimately strengthen the institution's global reputation."
    ],
    "documentUrl": "../pdf/world-university-ranking.pdf"
  },
  {
    "year": "2023",
    "title": "Barangayanihan Year End: Pasinaya kay Lolo at Lola",
    "image": "../images/sdg17p2.png",
    "layout": "left-img",
    "content": [
      "For the past two years, it has been a convenance of the Urdaneta City University the Barangayanihan Gift Giving for needy senior citizens. Through generosity and unity among personnel, we have been successfully giving joy to our elderlies from our adopted barangays (Oltama, Sta Lucia, and Oltama).",
      "The Center for Community Development and Extension Services, UCU Alumni Inc., and UCU Personnel Association have worked on to continue the said activity of giving joy to our elderlies for this year with the title \"Barangayanihàn Year End: Pasinaya kay Lolo at Lola\". It will not only be a gift-giving project but will also be giving entertainment by showcasing the talents of UCU students."
    ],
    "documentUrl": "../pdf/pasinaya-2022.pdf"
  },
  {
    "year": "2023",
    "title": "Sustainable Development Goals (SDG) Action Plan for Urdaneta City University",
    "image": "../images/sdg17p3.png",
    "layout": "right-img",
    "content": [
      "This action plan outlines how Urdaneta City University align its academic, research, operational, and community engagement activities with the United Nations Sustainable Development Goals (SDGs). The university aims to promote sustainability, equity, and global citizenship, encouraging all members of the university community to contribute to achieving a more sustainable future by 2030.",
      "This SDG Action Plan outlines a comprehensive and holistic strategy for [University Name] to contribute actively to the global SDG agenda. By integrating sustainability into our academic programs, research initiatives, campus operations, and community outreach, the university aims to lead by example in fostering a more sustainable, equitable, and just society. This plan ensures that the university community is not only aware of the SDGs but is also equipped and empowered to make a meaningful impact locally and globally."
    ],
    "documentUrl": "../pdf/ucu-sdg-action-plan.pdf"
  },
  {
    "year": "2023",
    "title": "UCU Extension Office Receives Seedling Donation for Environmental Initiative",
    "image": "../images/sdg17p4.png",
    "layout": "left-img",
    "content": [
      "On May 12, 2022, the Office of the Provincial Agriculturist, through coordination by the Center for Community Development and Extension Services (CCDES) of Urdaneta City University (UCU), granted a donation of various seedlings to support the university’s environmental activities in its adopted barangays.",
      "This collaboration between UCU and local agricultural authorities demonstrates the university’s proactive role in community service and environmental conservation, aligning with broader goals of sustainable development and climate action. The planting activities are scheduled to take place during the upcoming clean-up drives, with the hope that these efforts will foster a greener, more resilient community in Sison and surrounding areas."
    ],
    "documentUrl": "../pdf/ucu-extension-office-activities.pdf"
  },
  {
    "year": "2023",
    "title": " UCU-NSTP conducts emergency preparedness training for students",
    "image": "../images/sdg17p5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University, through the initiative of National Service Training Program (NSTP), and in partnership with RESCUE 177 Corps of Instructors Mobile Team, conducted a two-day training entitled, “Seminar-Workshop on Gender-Sensitive Risk Reduction Emergency Management” for NSTP students enrolled this academic year, as part of their present curriculum, on June 7-8, 2023 at the University Gymnasium.",
      "With the aim to equip the student-trainees of practical management skills against disasters and emergencies through actual demonstrations onsite, four batches of participants were catered; each batch underwent three phases of training: Phase 1 was a lecture presentation on basic concept of disaster and principles of DRRM; Phase 2 was hands-on demonstration on first aid, emergency rescue methods on a surface area, and basic life support in the new normal; and Phase 3 was a simultaneous simulation and application of all learned skills by the student-trainees."
    ],
    "documentUrl": "../pdf/ucu-nstp-conducts-emergency-preparedness.pdf"
  }
]
