[
  {
    "title": "UCU Strengthens Global Commitment to Peace and Sustainability Through Partnership with Global Peace Foundation",
    "image": "../images/sdg17_i17.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to advance its mission of fostering education that promotes peace, sustainability, and global citizenship through international collaboration. In a milestone initiative, the University formalized a strategic partnership with the Global Peace Foundation (GPF) on November 17, 2023, marking its active engagement in global and regional networks that support the United Nations Sustainable Development Goals (SDGs)—particularly SDG 4 (Quality Education) and SDG 16 (Peace, Justice, and Strong Institutions).",
      "The Memorandum of Understanding (MOU) was signed in a ceremony graced by key representatives, including Mr. Ingil Rai, GPF ASEAN Representative, members of the GPF Board of Directors, Dr. Christine Nabor-Ferrer, Regional Director of the Commission on Higher Education (CHED) Region I, and Dr. Sonny Soriano, UCU’s Director for External Affairs and Linkages. The event symbolized a shared vision between academia, government, and civil society in cultivating education as a tool for sustainable peace and development."
    ],
    "documentUrl": "../pdf/sdg17_p2-4.pdf"
  },
  {
    "title": "Urdaneta City University Fosters Cross-Cultural Dialogue on the SDGs Through Collaboration with Government and NGOs",
    "image": "../images/sdg17_i17.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to uphold its dedication to the United Nations Sustainable Development Goals (SDGs) through initiatives that promote cross-cultural dialogue, collaboration, and collective action. In alignment with SDG 17: Partnerships for the Goals, UCU has consistently taken steps to bridge sectors—bringing together representatives from government agencies, non-governmental organizations (NGOs), and academic institutions to exchange insights, share best practices, and align efforts toward sustainable development.",
      "Recognizing that the SDGs require inclusive and collaborative approaches, UCU actively facilitates platforms where diverse voices and perspectives can converge. One significant initiative is the university’s partnership with the Philippine National Volunteer Service Coordinating Agency (PNVSCA) for the Benchmarking Activity on Mainstreaming Volunteerism, a project designed to explore how volunteerism can be integrated into institutional frameworks and community engagement strategies."
    ],
    "documentUrl": "../pdf/sdg17_p5-6.pdf"
  },
  {
    "title": "Urdaneta City University Renews Partnership with 2nd Provincial Mobile Force Company to Strengthen Community and Student Engagement Programs",
    "image": "../images/sdg17_i17.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Philippines — The Urdaneta City University (UCU) renewed its Memorandum of Agreement (MOA) with the 2nd Provincial Mobile Force Company (2nd PMFC), reaffirming the university’s strong commitment to collaborative community service, peacebuilding, and student development. This partnership underscores UCU’s dedication to supporting the United Nations Sustainable Development Goals (UN SDGs) through inclusive outreach and training programs.",
      "The renewal ceremony was graced by Dr. Josephine S. Lambinicio, Vice President for Academic Affairs; Dr. Jerry C. Dichoso, Director of the Center for Community Development and Extension Services (CCDES); Dean Johanns Rabago of the College of Information Technology Education (CITE); along with CCDES staff and CITE faculty. Representing the 2nd PMFC were PLTC. Randy R. Arellano and PCapt. Liandro Velasquez, joined by Mr. Zosimo D. Salazar and Mr. Adonis Bringas from the Office of the Presidential Adviser on Peace, Reconciliation, and Unity."
    ],
    "documentUrl": "../pdf/sdg17_p7.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens SDG Commitment through Coordination with DepEd on After-Care Management Training for Adopted Schools",
    "image": "../images/sdg17_i17.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — April 20, 2024 — Reinforcing its dedication to inclusive education and community partnership, Urdaneta City University (UCU) coordinated with the Schools Division Office (SDO) of Urdaneta City regarding the approved proposal for the conduct of the training titled “After-Care Management of Children with Cognitive and Defined Behavior.” The initiative forms part of UCU’s continuing support to its 13 adopted schools, aiming to equip educators and stakeholders with strategies for managing and supporting children with special learning and behavioral needs.",
      "Representing the university, UCU officials met with Assistant Schools Division Superintendent Mdm. Criselda Ocang to discuss the project on behalf of the Schools Division Superintendent, Dr. Aguedo Fernandez. The proposed training was highly appreciated, and UCU received assurance that the program would gain official approval before implementation."
    ],
    "documentUrl": "../pdf/sdg17_p8.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Partnership with Vicente Taaca Memorial Elementary School in Preparation for After-Care Management Training",
    "image": "../images/sdg17_i17.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Philippines — April 4, 2024 — As part of its continuing commitment to inclusive education and sustainable community engagement, Urdaneta City University (UCU) held a coordination meeting with Mdm. Nilda Ramos, School Principal of Vicente Taaca Memorial Elementary School, and PTA President Mdm. Jocelyn Soller, in preparation for the “Training on After-Care Management of Children with Cognitive and Defined Behavior” scheduled on April 12, 2024.",
      "The meeting focused on finalizing the logistics, program structure, and participant engagement for the upcoming training, ensuring that all necessary preparations were aligned with the goals of promoting understanding and support for children with cognitive and behavioral challenges. The collaboration reflects UCU’s proactive approach to fostering educational partnerships that benefit not only teachers and parents but also the wider learning community."
    ],
    "documentUrl": "../pdf/sdg17_p9.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens SDG Commitment through Coordination with DepEd for BADANG Brigada Eskwela Project",
    "image": "../images/sdg17_i17.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — June 11, 2024 — Reaffirming its strong commitment to community partnership and sustainable education, Urdaneta City University (UCU), through its Extension Office, coordinated with Dr. Aguedo Fernandez, City Schools Division Superintendent, regarding the implementation of this year’s BADANG Brigada Eskwela Project. The initiative forms part of UCU’s long-standing outreach program, “Gamit Eskwela para sa Bata at Brigada Eskwela,” which aims to support public schools in their preparation for the new academic year.",
      "For 2024, UCU has identified 15 schools as beneficiaries of the BADANG Project, continuing its mission to assist schools in creating clean, safe, and learning-conducive environments for students. The program also promotes volunteerism and collaboration among faculty members, students, and local stakeholders—strengthening the spirit of bayanihan within the education sector."
    ],
    "documentUrl": "../pdf/sdg17_p10.pdf"
  },
  {
    "title": "UCU Strengthens Cross-Sectoral Dialogue on Innovation and Sustainability in Higher Education",
    "image": "../images/sdg17_i17.7.png",
    "layout": "right-img",
    "content": [
      "In its steadfast commitment to advancing cross-sectoral dialogue in support of the United Nations Sustainable Development Goals (SDGs), Urdaneta City University (UCU) organized a seminar titled “Innovative Practices in Higher Education to Promote Gender Equality and the Sustainable Development Goals” on October 11, 2024, at the University Cafeteria.",
      "The activity brought together College Deans, Program Heads, and Research Coordinators, fostering collaboration and shared learning among academic leaders to enhance the university’s sustainability and inclusivity initiatives."
    ],
    "documentUrl": "../pdf/sdg17_p11-12.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens International Collaboration in Gathering and Measuring Data for the SDGs",
    "image": "../images/sdg17_i17.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reaffirms its commitment to global sustainability through its active participation in international collaborations aimed at gathering, analyzing, and measuring data related to the United Nations Sustainable Development Goals (SDGs). This initiative underscores the university’s dedication to aligning its academic, research, and community engagement efforts with global standards of social responsibility and sustainable progress.",
      "As part of its continuing pursuit of excellence, UCU has been strengthening its internal data collection systems and documentation processes to ensure accuracy and transparency in reporting institutional performance. This effort directly supports the Times Higher Education (THE) Impact Rankings, which assess universities’ contributions to the SDGs through teaching, research, stewardship, and community outreach."
    ],
    "documentUrl": "../pdf/sdg17_p13.pdf"
  },
  {
    "title": "Urdaneta City University (UCU) Strengthens Data-Driven Impact through Collaboration with Institut Teknologi Sepuluh Nopember (ITS)",
    "image": "../images/sdg17_i17.9.png",
    "layout": "right-img",
    "content": [
      "In its continuing drive to align with the United Nations Sustainable Development Goals (SDGs) and global higher-education benchmarks, UCU has embarked on a partnership with ITS in Surabaya, Indonesia. This collaboration is purpose-built around adopting standardized indicators and evidence-based measurement approaches to gauge the institution’s impact across teaching, research, community service and sustainability initiatives.",
      "UCU’s commitment to SDG 5 (Gender Equality), SDG 4 (Quality Education) and SDG 17 (Partnerships for the Goals) is strengthened when measurement is transparent, rigorous and aligned internationally."
    ],
    "documentUrl": "../pdf/sdg17_p14-17.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Global Collaboration in Support of SDG 17",
    "image": "../images/sdg17_i17.10.png",
    "layout": "left-img",
    "content": [
      "In its continuous effort to advance international partnerships and strengthen its commitment to the United Nations Sustainable Development Goal (SDG) 17: Partnerships for the Goals, Urdaneta City University (UCU), through its Office of External Affairs and Linkages, actively participated in the ASEAN University Network (AUN) Secretariat’s online webinar titled “Integrating THE Impact and World University Rankings for Global Excellence, Internationalisation, and Reputation” held on October 17, 2024.",
      "The informative session brought together universities across the ASEAN region to share best practices in aligning institutional strategies with global ranking systems such as the Times Higher Education (THE) Impact Rankings and the World University Rankings. These frameworks highlight how higher education institutions contribute to the SDGs through teaching, research, outreach, and stewardship."
    ],
    "documentUrl": "../pdf/sdg17_p18-19.pdf"
  },
  {
    "title": "Urdaneta City University Advances Sustainable Development Through International Collaboration and Research",
    "image": "../images/sdg17_i17.11.png",
    "layout": "right-img",
    "content": [
      "UCU strengthens global partnerships to promote international best practices in achieving the UN Sustainable Development Goals.",
      "In pursuit of its vision to become a globally recognized institution for academic excellence and social impact, Urdaneta City University (UCU) continues to champion international collaboration and research initiatives that align with the United Nations Sustainable Development Goals (SDGs). Guided by its commitment to inclusive and sustainable education, UCU actively engages in partnerships that promote shared learning, data-driven research, and evidence-based policymaking.",
      "Through the leadership of the Office of External Affairs and Linkages, UCU has strengthened its participation in international platforms, such as the ASEAN University Network (AUN) and collaborative programs with regional universities, including Institut Teknologi Sepuluh Nopember (ITS) in Indonesia."
    ],
    "documentUrl": "../pdf/sdg17_p20-21.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to SDG 17 Through Collaboration with NGOs",
    "image": "../images/sdg17_i17.12.png",
    "layout": "left-img",
    "content": [
      "Demonstrating its unwavering dedication to the United Nations Sustainable Development Goal (SDG) 17: Partnerships for the Goals, Urdaneta City University (UCU) continues to expand its international and local collaborations—most notably through partnerships with non-governmental organizations (NGOs) that share its vision of inclusive, sustainable, and equitable development.",
      "Recognizing that the SDGs can only be achieved through strong partnerships built on shared values and mutual accountability, UCU has taken proactive steps to work closely with NGOs in implementing programs that address key areas such as quality education (SDG 4), gender equality (SDG 5), good health and well-being (SDG 3), and climate action (SDG 13)."
    ],
    "documentUrl": "../pdf/sdg17_p22-24.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Commitment to SDG 17 Through Collaboration with the Philippine National Volunteer Service Coordinating Agency and NGOs",
    "image": "../images/sdg17_i17.13.png",
    "layout": "right-img",
    "content": [
      "In line with its continuing dedication to the United Nations Sustainable Development Goal (SDG) 17: Partnerships for the Goals, Urdaneta City University (UCU) has reaffirmed its commitment to promoting collaboration and volunteerism as key strategies for achieving sustainable development. Demonstrating this commitment, UCU partnered with the Philippine National Volunteer Service Coordinating Agency (PNVSCA) and various non-governmental organizations (NGOs) in a benchmarking activity titled “Mainstreaming Volunteerism”, a project designed to explore how volunteerism can be effectively integrated into institutional strategies to advance the Sustainable Development Goals (SDGs).",
      "The initiative emphasized that volunteerism plays a critical role in addressing pressing social, environmental, and economic challenges. The benchmarking activity created a platform for government agencies, NGOs, academic institutions, and volunteer groups to share experiences, identify best practices, and develop action plans for mainstreaming volunteerism across various sectors."
    ],
    "documentUrl": "../pdf/sdg17_p25.pdf"
  },
  {
    "title": "Urdaneta City University Fosters Cross-Cultural Dialogue on the SDGs Through Collaboration with Government and NGOs",
    "image": "../images/sdg17_i17.14.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to uphold its dedication to the United Nations Sustainable Development Goals (SDGs) through initiatives that promote cross-cultural dialogue, collaboration, and collective action. In alignment with SDG 17: Partnerships for the Goals, UCU has consistently taken steps to bridge sectors—bringing together representatives from government agencies, non-governmental organizations (NGOs), and academic institutions to exchange insights, share best practices, and align efforts toward sustainable development.",
      "Recognizing that the SDGs require inclusive and collaborative approaches, UCU actively facilitates platforms where diverse voices and perspectives can converge. One significant initiative is the university’s partnership with the Philippine National Volunteer Service Coordinating Agency (PNVSCA) for the Benchmarking Activity on Mainstreaming Volunteerism, a project designed to explore how volunteerism can be integrated into institutional frameworks and community engagement strategies."
    ],
    "documentUrl": "../pdf/sdg17_p26.pdf"
  }
]
