[
  {
    "year": "2024",
    "title": "Urdaneta City University Chosen as Beneficiary of DSWD’s Kalahi-CIDSS Cash-for-Work Program",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "Urdaneta City University (UCU) has been selected as one of the beneficiaries of the Department of Social Welfare and Development’s (DSWD) Kalahi-CIDSS Cash-for-Work Program, a community-driven development initiative aimed at reducing poverty and promoting inclusive growth. The program provides short-term employment opportunities for individuals by engaging them in community development projects that improve public services and infrastructure.",
          "The selection of UCU aligns with the university’s mission of promoting social responsibility, civic engagement, and community development. By participating in this initiative, the university community contributes to meaningful and sustainable development while also supporting the socio-economic welfare of vulnerable individuals. The partnership demonstrates a shared commitment between the government and academic institutions to strengthen community resilience and provide livelihood support.",
          "This activity also reflects the core values of UCU in creating a responsive and engaged academic environment where education goes beyond the classroom and fosters a culture of compassion, volunteerism, and nation-building. Through the Cash-for-Work Program, students and community members alike will have the opportunity to take part in developmental tasks that benefit not only the university but the surrounding communities as well."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Provide eligible UCU students and alumni with temporary employment opportunities through the DSWD’s Kalahi-CIDSS Cash-for-Work initiative.",
          "Promote awareness and understanding of the Kalahi-CIDSS program, including its goals, implementation process, and community development focus.",
          "Encourage active participation of students and alumni in community-based development projects that contribute to local empowerment and poverty alleviation.",
          "Strengthen the partnership between UCU and DSWD in implementing social development programs within academic communities.",
          "Instill a sense of civic responsibility and social involvement among beneficiaries by allowing them to contribute meaningfully to nation-building efforts."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The Urdaneta City University’s (UCU) participation in the DSWD Kalahi-CIDSS Cash-for-Work Program significantly advanced multiple United Nations Sustainable Development Goals (SDGs), demonstrating the university’s dedication to social inclusion, community empowerment, and nation-building. The program notably aligned with SDG 1: No Poverty by providing temporary livelihood opportunities to qualified students and alumni, directly addressing financial vulnerability and supporting their basic needs. It also reinforced SDG 4: Quality Education by extending learning beyond the classroom and fostering values such as volunteerism, leadership, and civic engagement among graduates. Supporting SDG 8: Decent Work and Economic Growth, the initiative enhanced employability and work readiness by engaging youth and recent graduates in productive work, while SDG 10: Reduced Inequalities was addressed through equal access for all qualified participants regardless of socio-economic background. Furthermore, the program promoted SDG 11: Sustainable Cities and Communities by involving beneficiaries in community projects aimed at improving local infrastructure and services, thereby fostering resilience at the grassroots level. Lastly, the collaboration exemplified SDG 17: Partnerships for the Goals by showcasing effective cooperation between government agencies and higher education institutions to achieve sustainable and inclusive development. Through this engagement, UCU not only improved the livelihoods of its students and alumni but also contributed meaningfully to national and global development priorities."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The Cash-for-Work Orientation Programme was successfully implemented and well-received by participants, offering a clear and engaging learning experience through informative presentations, clarificatory sessions, and the distribution of orientation materials. Attendees actively listened, asked questions, and expressed appreciation for the opportunity to better understand the DSWD Kalahi-CIDSS Cash-for-Work initiative. The sessions were relevant, timely, and aligned with the goals of promoting community participation and youth empowerment via temporary employment support. Participant feedback highlighted the orientation’s effectiveness in clarifying their roles, responsibilities, and benefits, while the presence of DSWD officials and project staff ensured accurate and confident delivery of information and prompt responses to concerns. The event was well-organized, marked by smooth facilitation, active collaboration between the university and agency, and strong logistical coordination, all contributing to its overall success."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To further enhance the impact of future orientation activities, it is recommended to extend the duration of the Q&A and clarification segments to allow for deeper understanding and more personalized support for participants. Incorporating follow-up activities such as online orientations, regular progress updates, or virtual check-ins can help sustain engagement and ensure continued clarity throughout the program’s implementation. It is also suggested to diversify the pool of speakers and facilitators to include voices from partner agencies, local government units, and former program beneficiaries, offering broader and more relatable perspectives. Lastly, gathering more structured feedback through post-orientation surveys and participant reflections will aid in refining the program’s delivery and aligning future sessions with the evolving needs and expectations of the beneficiaries."
            ]
          }
        ]
      }
    ]
  }
]
