[
  {
    "title": "Urdaneta City University: Promoting Water Conservation and Management through Research and Community Extension",
    "image": "../images/sdg14_i14.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) upholds its strong commitment to environmental sustainability by advancing education, research, and outreach programs that promote responsible water use and conservation. Guided by the United Nations Sustainable Development Goals (SDGs), particularly SDG 6: Clean Water and Sanitation and SDG 14: Life Below Water, the University integrates sustainability into both its academic and community initiatives.",
      "At the heart of these efforts is the Center for Community Development and Extension Services (CCDES), which leads training and advocacy programs focused on sustainable irrigation, watershed protection, and freshwater resource management. Partner communities benefit from practical learning sessions that teach water-saving techniques, efficient irrigation systems, and the importance of maintaining clean and healthy waterways. These programs not only enhance environmental awareness but also strengthen community capacity to manage local resources effectively."
    ],
    "documentUrl": "../pdf/sdg14_p2.pdf"
  },
  {
    "title": "Urdaneta City University: Building Community Capacity in Sustainable Fisheries, Aquaculture, and Coastal Tourism",
    "image": "../images/sdg14_i14.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) strengthens community resilience and promotes sustainable livelihoods in Pangasinan through education and outreach programs focused on responsible fisheries, aquaculture, and coastal tourism.",
      "Through its Center for Community Development and Extension Services (CCDES) and Training Services Unit, UCU conducts capacity-building activities and demonstration projects that equip fishers, farmers, and local organizations with practical skills for sustainable production. These initiatives align with the University’s commitment to the Sustainable Development Goals (SDGs), particularly SDG 1 (No Poverty), SDG 2 (Zero Hunger), SDG 8 (Decent Work and Economic Growth), and SDG 14 (Life Below Water)."
    ],
    "documentUrl": "../pdf/sdg14_p3.pdf"
  },
  {
    "title": "Urdaneta City University: Advancing Freshwater and Marine Conservation through Education and Community Engagement",
    "image": "../images/sdg14_i14.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) upholds its strong commitment to the United Nations Sustainable Development Goal (SDG) 14: Life Below Water by promoting the conservation and sustainable use of aquatic resources through education, research, and community engagement. The University ensures that its initiatives and partnerships reflect policies supporting the sustainable harvesting and management of aquatic ecosystems.",
      "Through the Center for Community Development and Extension Services (CCDES) and Training Services Unit, UCU implements programs that build community awareness and technical capacity in responsible aquaculture, water resource management, and fisheries conservation. In partnership with Pangasinan State University–Binmaley Campus, the University conducts training on freshwater management, catfish (hito) culture, hydroponic systems, and water reuse. These initiatives equip farmers, fisherfolk, and local leaders with sustainable techniques that balance livelihood development with environmental protection."
    ],
    "documentUrl": "../pdf/sdg14_p4.pdf"
  },
  {
    "title": "Urdaneta City University: Promoting Sustainable Utilization of Marine and Freshwater Resources",
    "image": "../images/sdg14_i14.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to uphold its commitment to environmental stewardship and sustainable development through initiatives that support the conservation and sustainable utilization of oceans, seas, lakes, rivers, and marine resources. In alignment with the United Nations Sustainable Development Goal 14: Life Below Water, the university actively integrates environmental consciousness into education, research, and community engagement.",
      "Through its various colleges and organizations, UCU organizes seminars, lectures, and advocacy campaigns that raise awareness on the importance of protecting aquatic ecosystems. These programs address pressing issues such as plastic pollution, overfishing, and the degradation of marine and freshwater habitats. By engaging both students and faculty, the university fosters a culture of environmental responsibility within and beyond the campus."
    ],
    "documentUrl": "../pdf/sdg14_p5.pdf"
  },
  {
    "title": "Urdaneta City University: Upholding Sustainable Sourcing of Aquatic Food Resources",
    "image": "../images/sdg14_i14.5.png",
    "layout": "right-img",
    "content": [
      "In line with its dedication to environmental sustainability and responsible consumption, Urdaneta City University (UCU) has established a policy ensuring that all food products sourced from aquatic ecosystems and served within the campus are sustainably harvested. This initiative reflects the university’s firm commitment to the United Nations Sustainable Development Goal 14: Life Below Water, which promotes the conservation and sustainable use of oceans, seas, and marine resources.",
      "The university recognizes the vital role of aquatic resources in ensuring food security and ecological balance. Through this policy, UCU seeks to promote the responsible procurement of seafood and other aquatic-based food products, prioritizing suppliers and partners who adhere to sustainable fishing and aquaculture practices. This approach not only supports marine biodiversity but also discourages overfishing and the exploitation of endangered aquatic species."
    ],
    "documentUrl": "../pdf/sdg14_p6-8.pdf"
  },
  {
    "title": "Urdaneta City University’s Commitment to Protecting Ecosystems and Biodiversity",
    "image": "../images/sdg14_i14.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) actively contributes to maintaining and extending existing ecosystems and biodiversity through research, education, and industry collaboration. The university integrates environmental conservation into its academic and community initiatives, aligning with the United Nations Sustainable Development Goal 14.3.3.",
      "Through the Research and Development Office and the Center for Community Development and Extension Services (CCDES), UCU implements projects focused on the protection of both terrestrial and aquatic ecosystems. Faculty and student researchers conduct studies on sustainable agriculture, aquaculture, and environmental management that aim to reduce ecological threats and promote biodiversity."
    ],
    "documentUrl": "../pdf/sdg14_p9.pdf"
  },
  {
    "title": "Urdaneta City University Expands Its Role in Ecosystem and Biodiversity Conservation",
    "image": "../images/sdg14_i14.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) is expanding its efforts in ecosystem and biodiversity conservation through research, education, and community engagement underscoring its commitment to Sustainable Development Goal 14.3.3. The University leverages its expertise and facilities to support sustainable aquatic systems, habitats under threat, and local biodiversity while strengthening its partnerships with regional stakeholders.",
      "Through its Center for Research & Development and the Center for Community Development & Extension Services (CCDES), UCU carries out studies focused on water quality, habitat health, and sustainable aquaculture systems. One notable project monitored campus drinking water and highlighted UCU’s interest in ecological health and resource management. This operational research capability forms the foundation for broader ecosystem work."
    ],
    "documentUrl": "../pdf/sdg14_p10.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Campus Initiatives to Reduce Plastic Waste",
    "image": "../images/sdg14_i14.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to reinforce its commitment to environmental sustainability through programs and policies that aim to minimize plastic waste on campus. Anchored on its Sustainable Development Goals (SDG) Action Plan, the University promotes responsible consumption and waste management practices that contribute to cleaner surroundings and healthier ecosystems.",
      "Through the joint efforts of the Center for Community Development and Extension Services (CCDES), the Environmental Management Unit, and various student organizations, UCU implements initiatives such as waste segregation campaigns, recycling drives, and clean-up activities under the “Bayanihan sa Unibersidad para sa Malinis na Pasilidad” program. Now in its third year, this university-wide campaign encourages students, faculty, and staff to take an active role in maintaining cleanliness within the campus and reducing single-use plastic consumption."
    ],
    "documentUrl": "../pdf/sdg14_p11-14.pdf"
  },
  {
    "title": "URDANETA CITY UNIVERSITY: INITIATIVES TO PROTECT AQUATIC SYSTEMS IN PANGASINAN",
    "image": "../images/sdg14_i14.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU), in alliance with BFAR Region I and Pangasinan State University – Binmaley Campus, is piloting sustainable hito-culture and hydroponics systems aligned with aquatic ecosystem stewardship in Pangasinan. Through community-based research and extension, staff and students spearhead biodiversity-sensitive aquaculture, habitat-friendly wastewater solutions, and education for local partners.",
      "UCU’s Centre for Community Development & Extension Services (CCDES) and Center for Research & Development support outreach training on SDG-aligned water-resource management, enabling barangays and small-scale fishery enterprises to adopt best practices. Together they safeguard the shared aquatic systems while enabling resilient, livelihood-friendly development."
    ],
    "documentUrl": "../pdf/sdg14_p15.pdf"
  },
  {
    "title": "Urdaneta City University Monitoring Local Aquatic Systems",
    "image": "../images/sdg14_i14.10.png",
    "layout": "left-img",
    "content": [
      "UCU has incorporated water-resource management into its institutional research agenda, as reflected in its Research Manual which lists “water conservation and management; development of cost-effective technologies to prevent, control and monitor environmental concerns” among its priority themes. One concrete example is a documented site visit and collaboration on June 27 2023 between UCU’s Center for Community Development & Extension Services and Pangasinan State University – Binmaley Campus’s Aquaculture & Hito-culture project. During this activity, UCU faculty gathered knowledge on aquatic technologies, which will inform its upcoming monitoring and culture-systems work.",
      "In practice, UCU’s monitoring approach involves sampling for microbiological and physico-chemical indicators. For example, a separate water-quality test in Urdaneta City showed that samples from a school faucet passed the Philippine National Standards for Drinking Water in total coliform, thermotolerant coliform and heterotrophic plate count. Although this was not explicitly led by UCU, it demonstrates the kind of microbiological monitoring environment in the region."
    ],
    "documentUrl": "../pdf/sdg14_p16.pdf"
  },
  {
    "title": "UCU’s Programs and Incentives to Promote Aquatic Stewardship",
    "image": "../images/sdg14_i14.11.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has taken an active role in promoting sustainable water management and environmental responsibility across Pangasinan. The university’s ongoing programs blend research, community extension, and policy collaboration to encourage responsible use of aquatic resources. Through initiatives that connect local livelihoods with environmental protection, UCU is building a culture of aquatic stewardship that extends beyond campus and into partner communities.",
      "One concrete example is UCU’s collaboration with Pangasinan State University – Binmaley Campus on June 27 2023, where UCU’s Center for Research & Development, College of Engineering & Architecture, and the Center for Community Development & Extension Services (CCDES) joined a site visit on aquaculture and “hito” culture technologies. The insights gained were to be adapted into UCU’s own sustainable aquaculture and hydroponics programs, thereby linking aquatic stewardship with livelihood innovation."
    ],
    "documentUrl": "../pdf/sdg14_p17.pdf"
  },
  {
    "title": "UCU’s Collaboration with Local Communities to Sustain Shared Aquatic Ecosystems",
    "image": "../images/sdg14_i14.12.png",
    "layout": "left-img",
    "content": [
      "Through its Center for Community Development and Extension Services (CCDES), UCU has developed partnerships and joint-activities that bring research, education and community practice into alignment for shared ecosystem benefit.",
      "For example, on June 27 2023, UCU’s CCDES and its College of Engineering & Architecture joined a collaborative site visit with Pangasinan State University – Binmaley Campus (PSU-Binmaley) focused on aquaculture and hito (catfish)-culture technologies. PSU-Binmaley faculty shared their research and extension work in aquatic technologies, and UCU is now applying these insights into its own hydroponics and aquaculture pilot programs tied to local aquatic systems."
    ],
    "documentUrl": "../pdf/sdg14_p18.pdf"
  },
  {
    "title": "UCU Leads Biodiversity-Based Watershed Management in Pangasinan",
    "image": "../images/sdg14_i14.13.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) is developing a watershed-management strategy that accounts for the unique diversity of aquatic species across Pangasinan. Recognizing that rivers, tributaries, and aquaculture ponds each host different communities of fish, invertebrates, and plants, UCU aims to design management practices suited to the ecological conditions of each area.",
      "The initiative draws from regional biodiversity studies showing how species composition reflects ecosystem health. For example, a survey of the Chico-Agno River in Asingan recorded only four native fish species against eleven introduced ones—highlighting the need for location-specific management rather than broad, uniform interventions (thesis.dlsud.edu.ph). Using such findings as reference, UCU researchers are mapping local aquatic species, identifying native indicator organisms, and integrating biodiversity data into watershed planning and restoration projects."
    ],
    "documentUrl": "../pdf/sdg14_p19.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Policy and Action to Prevent Marine Pollution from Land-Based Activities",
    "image": "../images/sdg14_14.4.3.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reinforces its commitment to environmental protection by implementing policies and programs aimed at preventing marine pollution, particularly those stemming from land-based activities such as plastic waste generation, improper waste disposal, and wastewater discharges. Aligned with the University’s Sustainable Development Goals (SDG) Framework and Institutional Sustainability and Development Agenda, UCU integrates pollution prevention measures into its campus operations, research initiatives, and community engagement efforts.",
      "Through the Center for Community Development and Extension Services (CCDES) and the Environmental Management Unit, UCU leads educational campaigns and community clean-up activities that promote proper waste management and pollution control. Initiatives such as “Bayanihan sa Unibersidad” and the “War on Waste” program encourage responsible waste segregation and advocate for the reduction of single-use plastics—helping prevent land-based debris from entering waterways that ultimately lead to coastal and marine ecosystems."
    ],
    "documentUrl": "../pdf/sdg14_14.4.3.pdf"
  }
]
