[
  {
    "title": "Reducing Inequalities Through Fair Admissions: UCU Upholds SDG 10 in Higher Education",
    "image": "../images/sdg10_10.6.1.png",
    "layout": "right-img",
    "content": [
      "The pursuit of equality in education is a core element of the United Nations’ Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, which aims to advance social, economic, and political inclusion for all individuals—regardless of age, gender, disability, race, ethnicity, origin, or socio-economic background. Within this global framework, higher education institutions play a transformative role in promoting fairness, especially through non-discriminatory admissions policies that ensure equal access to educational opportunities.",
      "A fair and inclusive admissions policy ensures that entry into higher education is determined by merit, potential, and qualification rather than by personal or social circumstances. By upholding and publicly posting such policies, universities strengthen transparency, accountability, and their commitment to equality. This approach not only builds trust among students and stakeholders but also reinforces the principle that education is a fundamental right accessible to all, not a privilege limited to a select few."
    ],
    "documentUrl": "../pdf/sdg10_10.6.1.pdf"
  },
  {
    "title": "Measuring Inclusivity in Admissions: UCU Strengthens Its Commitment to SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.2.png",
    "layout": "right-img",
    "content": [
      "Aligned with the United Nations Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, higher education institutions carry the responsibility of ensuring equitable access to academic opportunities. Beyond adopting non-discriminatory admissions policies, universities must also evaluate and monitor the representation of underrepresented and potentially underrepresented groups to ensure that inclusivity is actively implemented and consistently upheld.",
      "At Urdaneta City University (UCU), the commitment to inclusivity goes far deeper than policy statements. The University recognizes that true equality requires ongoing assessment of who is being admitted and who may still be facing barriers. To uphold this principle, UCU systematically gathers and analyzes data on student applications and admissions, focusing on various underrepresented groups such as ethnic minorities, low-income students, women, non-traditional learners, persons with disabilities (PWDs), LGBT students, and indigenous or newly settled refugee students. This continuous monitoring allows UCU to identify gaps, strengthen interventions, and ensure that access to higher education remains fair, equitable, and inclusive for all."
    ],
    "documentUrl": "../pdf/sdg10_10.6.2.pdf"
  },
  {
    "title": "Promoting Inclusive Recruitment: UCU Strengthens Its Commitment to SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.3.png",
    "layout": "right-img",
    "content": [
      "One of the core principles of Sustainable Development Goal 10 (SDG 10): Reduced Inequalities is the active promotion of diversity within institutions. In the context of higher education, this responsibility encompasses both student admissions and the recruitment of faculty and staff. A truly inclusive university is defined not only by who is welcomed, but also by who is supported, empowered, and encouraged to thrive within the academic community.",
      "At Urdaneta City University (UCU), inclusivity is strategically embedded in recruitment, admissions, and human resource development systems. The University recognizes that groups such as ethnic minorities, persons with disabilities (PWDs), low-income individuals, indigenous peoples, women, LGBT persons, and other marginalized sectors have historically faced barriers in accessing education and employment. As part of its commitment to SDG 10, UCU implements targeted initiatives—including inclusive recruitment programs, scholarships, faculty development opportunities, and community outreach efforts—to address these disparities and foster equitable participation across its academic environment."
    ],
    "documentUrl": "../pdf/sdg10_10.6.3.pdf"
  },
  {
    "title": "Upholding Equality Through UCU’s Anti-Discrimination Policy in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.4.png",
    "layout": "right-img",
    "content": [
      "The pursuit of equality and fairness lies at the heart of Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, which calls for the elimination of discrimination and the promotion of inclusion across all sectors of society. In the realm of higher education, this mandate translates into the implementation of anti-discrimination policies that foster a safe, respectful, and equitable environment for all members of the academic community.",
      "At Urdaneta City University (UCU), this commitment is affirmed through its comprehensive Anti-Discrimination Policy, which safeguards students, faculty, and staff from unfair treatment based on race, ethnicity, gender, religion, disability, socio-economic background, sexual orientation, or any other characteristic unrelated to academic or professional merit. This policy reflects the University’s belief that diversity is a source of strength and that education must remain accessible, equitable, and inclusive for everyone."
    ],
    "documentUrl": "../pdf/sdg10_10.6.4.pdf"
  },
  {
    "title": "UCU Strengthens Commitment to Diversity, Equity, and Inclusion in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.5.png",
    "layout": "right-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goal 10: Reduced Inequalities, Urdaneta City University (UCU) continues to promote a campus environment grounded in fairness, inclusivity, and human dignity. The establishment of its Diversity, Equity, and Inclusion (DEI) Committee demonstrates the University’s dedication to ensuring that every member of its academic community—students, faculty, staff, and visitors—feels represented, respected, and empowered.",
      "The DEI Committee acts as the University’s primary advisory and action body for issues related to equality, diversity, and human rights. Operating under the guidance of university administration and in close coordination with key offices such as the Office of Student Affairs and Services (OSAS), the Guidance and Counseling Office, the Human Resource Management Office (HRMO), and the Gender and Development (GAD) Office, the committee helps develop inclusive programs and policies that reflect UCU’s enduring principle of education for all."
    ],
    "documentUrl": "../pdf/sdg10_10.6.5.pdf"
  },
  {
    "title": "Strengthening Inclusion Through Diversity and Equality Structures at UCU in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.6.png",
    "layout": "right-img",
    "content": [
      "In pursuit of the United Nations’ Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, higher education institutions are called not only to embrace inclusivity but also to institutionalize mechanisms that uphold it. This includes creating dedicated offices, committees, or officer positions tasked with promoting inclusion, human rights, and equitable opportunities across the academic community.",
      "At Urdaneta City University (UCU), the administration emphasizes the importance of embedding equality within the very structure of the institution. Through its designated offices and committees—such as the Gender and Development (GAD) Focal Point System, Human Resource Management Office (HRMO), and Office of Student Affairs (OSA)—UCU ensures that policies, programs, and training sessions related to diversity, equity, inclusion (DEI), and human rights are actively implemented, monitored, and continuously strengthened."
    ],
    "documentUrl": "../pdf/sdg10_10.6.6.pdf"
  },
  {
    "title": "Promoting Accessibility and Inclusion Through Disability-Friendly Facilities at UCU in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.7.png",
    "layout": "right-img",
    "content": [
      "In alignment with Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, Urdaneta City University (UCU) continues to advance its commitment to equitable access to education for all students. A key aspect of this effort is the development and maintenance of accessible facilities that address the needs of individuals with disabilities.",
      "Accessibility is a fundamental element of inclusion, ensuring that every member of the university community—regardless of physical ability—can fully engage in academic and social activities without barriers. UCU’s focus on disability-friendly infrastructure demonstrates the University’s belief that education is a right, not a privilege constrained by environmental or physical limitations."
    ],
    "documentUrl": "../pdf/sdg10_10.6.7.pdf"
  },
  {
    "title": "UCU’s Commitment to Accessibility and Inclusion: Supporting Persons with Disabilities in Line with SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.8.png",
    "layout": "right-img",
    "content": [
      "Aligned with Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, Urdaneta City University (UCU) continues to strengthen its support services for persons with disabilities (PWDs), recognizing that true equity in education requires more than open access—it requires active support systems that enable all students to thrive academically and socially.",
      "UCU provides a range of support services tailored to the needs of students with disabilities. These include personal assistants for students requiring mobility support and interpreters for students with hearing impairments to ensure effective communication during lectures and campus activities. Additionally, the University maintains PWD-friendly facilities, including ramps, elevators, and accessible restrooms, ensuring that academic buildings and classrooms meet accessibility standards and promote full participation in campus life."
    ],
    "documentUrl": "../pdf/sdg10_10.6.8.pdf"
  },
  {
    "title": "UCU’s Access Schemes for Persons with Disabilities: Upholding Equality in Education in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.9.png",
    "layout": "right-img",
    "content": [
      "In full support of the United Nations Sustainable Development Goal 10: Reduced Inequalities, Urdaneta City University (UCU) is committed to ensuring that all students, particularly those with disabilities, have equitable access to higher education. Through inclusive policies and accessibility programs, UCU upholds its mission of providing equal educational opportunities for every learner, regardless of physical, mental, or sensory challenges.",
      "To accomplish this, UCU implements targeted access schemes for students with disabilities. These include preferential admission and enrollment assistance, with priority lanes and dedicated support during registration to ensure a smooth and dignified process. Additionally, the University provides academic accommodations, such as extended time for examinations, accessible learning materials, and flexible classroom arrangements, tailored to meet individual student needs and promote full participation in academic life."
    ],
    "documentUrl": "../pdf/sdg10_10.6.9.pdf"
  },
  {
    "title": "UCU’s Reasonable Accommodation Policy for Persons with Disabilities: Empowering Through Equity in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.10.png",
    "layout": "right-img",
    "content": [
      "Aligned with Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, Urdaneta City University (UCU) emphasizes equity over mere equality by implementing a Reasonable Accommodation Policy to support persons with disabilities (PWDs) in fully participating in academic and campus life. Recognizing that inclusion requires customized support, the University has developed strategies to address the unique needs of students, faculty, and staff with disabilities.",
      "UCU’s accommodation strategy encompasses a wide range of provisions, including modified learning materials, accessible classrooms, and flexible academic arrangements for students with disabilities. Faculty members are encouraged to adapt teaching methods and assessments to meet individual needs without compromising academic standards. The policy also extends to administrative and extracurricular activities, ensuring that PWDs have equal opportunities to engage fully in all aspects of university life."
    ],
    "documentUrl": "../pdf/sdg10_10.6.10.pdf"
  },
  {
    "title": "UCU’s Reasonable Accommodation Policy for Persons with Disabilities: Empowering Through Equity in Support of SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_10.6.11.png",
    "layout": "right-img",
    "content": [
      "Aligned with Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, Urdaneta City University (UCU) emphasizes equity over mere equality by implementing a Reasonable Accommodation Policy to support persons with disabilities (PWDs) in fully participating in academic and campus life. Recognizing that inclusion requires customized support, the University has developed strategies to address the unique needs of students, faculty, and staff with disabilities.",
      "UCU’s accommodation strategy encompasses a wide range of provisions, including modified learning materials, accessible classrooms, and flexible academic arrangements for students with disabilities. Faculty members are encouraged to adapt teaching methods and assessments to meet individual needs without compromising academic standards. The policy also extends to administrative and extracurricular activities, ensuring that PWDs have equal opportunities to engage fully in all aspects of university life."
    ],
    "documentUrl": "../pdf/sdg10_10.6.11.pdf"
  }
]
