[
  {
    "title": "UCUian Grantees Receive TDP Financial Assistance: Empowering Students, Advancing SDG 1 – No Poverty",
    "image": "../images/sdg1_i1.1.png",
    "layout": "right-img",
    "content": [
      "In 2024, Urdaneta City University (UCU) reaffirmed its commitment to quality and inclusive education by facilitating the distribution of financial aid to 134 student grantees under the Tulong-Dunong Program (TDP) at the UCU Holding Area. The event was successfully organized by the Center for Student Leadership and Development (CSLD), reflecting the University’s continued efforts to support student welfare and equitable access to higher education.",
      "The Tulong-Dunong Program (TDP), a component of the Tertiary Education Subsidy (TES) under the Unified Student Financial Assistance System for Tertiary Education (UniFAST), provides direct financial assistance to deserving Filipino students enrolled in various higher education institutions. Through this initiative, grantees receive support to cover educational expenses such as tuition, learning materials, and other academic needs—allowing them to focus on their studies and achieve academic success without the burden of financial constraints."
    ],
    "documentUrl": "../pdf/sdg1_p2-3.pdf"
  },
  {
    "title": "Empowering Futures: 25 UCU Caregiving NC II Students Receive TESDA Scholarship Grants to Alleviate Poverty Through Skills and Education",
    "image": "../images/sdg1_i1.2.png",
    "layout": "left-img",
    "content": [
      "In 2024, Urdaneta City University (UCU) once again demonstrated its commitment to sustainable development and social empowerment by partnering with the Technical Education and Skills Development Authority (TESDA) – Region I to conduct the Training Induction Program for Caregiving NC II students under the Tulong Trabaho Scholarship Program. A total of 25 scholars from the university’s caregiving program were awarded scholarship grants designed to enhance their technical skills and improve their access to meaningful employment opportunities.",
      "This initiative reaffirms UCU’s unwavering dedication to advancing the United Nations Sustainable Development Goals (SDGs)—particularly SDG 1: No Poverty, which focuses on ending poverty in all its forms everywhere. Through this program, UCU continues to strengthen its mission of providing inclusive, equitable, and quality education that uplifts individuals, families, and communities."
    ],
    "documentUrl": "../pdf/sdg1_p4-7.pdf"
  },
  {
    "title": "Empowering Communities Through Culture and Livelihood: UCU Strengthens Ties with Japan in Promoting SDG 1 – No Poverty",
    "image": "../images/sdg1_i1.3.png",
    "layout": "right-img",
    "content": [
      "In 2024, Urdaneta City University (UCU) once again demonstrated its firm commitment to promoting the United Nations Sustainable Development Goals (SDGs)—particularly SDG 1: No Poverty—through a meaningful international collaboration that combines education, culture, and livelihood development.",
      "As part of its ongoing partnership with a Japanese organization, UCU launched a Community and Cultural Exchange Program that provided both educational support and livelihood training to parents and pupils from local communities. The initiative sought to empower families by addressing immediate needs while fostering long-term self-sufficiency through skill development and cultural understanding."
    ],
    "documentUrl": "../pdf/sdg1_p8-9.pdf"
  },
  {
    "title": "Urdaneta City University Policy on Participation and Program Implementation to End Poverty in All Its Dimensions",
    "image": "../images/sdg1_i1.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) recognizes education as a powerful tool for social transformation and poverty alleviation. In alignment with the United Nations Sustainable Development Goals (SDGs)—specifically SDG 1: No Poverty—UCU is committed to actively participating in and implementing programs, research, and policies that address poverty at the local, regional, national, and global levels.",
      "The University believes that eliminating poverty requires inclusive education, livelihood opportunities, and community empowerment. By fostering collaboration among academic units, local government agencies, private institutions, and international partners, UCU strengthens its role as an agent of change in ensuring that no individual or community is left behind."
    ],
    "documentUrl": "../pdf/sdg1_p10-14.pdf"
  }
]
