[
  {
    "title": "Urdaneta City University Champions SDG 15 in the Bonsai Exhibit: “Urdaneta City’s Green Thumbs Shine”",
    "image": "../images/sdg15_i15.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City—The beauty of nature and the artistry of human hands converged at SM City Urdaneta Central during the Bonsai Exhibit held on December 9, where bonsai enthusiasts gathered to showcase their creativity, patience, and love for nature. The event, aptly titled “Urdaneta City’s Green Thumbs Shine,” featured a stunning collection of miniature trees that reflected both cultural artistry and environmental stewardship.",
      "Organized by Apollo Ferrer, President of the Pangasinan Bonsai Society, the exhibit highlighted the intricate Japanese art of cultivating miniature trees—an age-old practice that fosters discipline, creativity, and a deeper appreciation for life on land. The event served as a vibrant meeting ground for bonsai hobbyists, learners, and nature advocates who shared techniques and stories behind their living sculptures."
    ],
    "documentUrl": "../pdf/sdg15_p2.pdf"
  },
  {
    "title": "Urdaneta City University Earns Global Recognition in the 2024 UI GreenMetric World University Rankings: A Testament to Its Commitment to Sustainability and SDG 15 – Life on Land",
    "image": "../images/sdg15_i15.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) proudly marks another milestone as it successfully secures impressive ranks in the 2024 UI GreenMetric World University Rankings, a prestigious global assessment of higher education institutions based on their commitment to environmental sustainability and green campus initiatives.",
      "The UI GreenMetric World University Rankings evaluates universities using 39 indicators across six key criteria: setting and infrastructure, energy and climate change, waste management, water management, transportation, and education and research. This ranking recognizes institutions that integrate environmental awareness, green innovation, and sustainability practices into their operations and academic culture."
    ],
    "documentUrl": "../pdf/sdg15_p3.pdf"
  },
  {
    "title": "Urdaneta City University Sustainable Food Sourcing and Farming Policy (UCU-SFFP No. 2025-01)",
    "image": "../images/sdg15_i15.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU), in alignment with its commitment to the United Nations Sustainable Development Goals (SDGs)—particularly SDG 15: Life on Land and SDG 2: Zero Hunger—upholds the principle of sustainability in all aspects of campus operations, including food sourcing and consumption. This policy ensures that all food served, sold, or distributed within the University premises is sustainably farmed, environmentally responsible, and supportive of local agricultural communities.",
      "The purpose of this policy is to promote sustainable agricultural practices that conserve biodiversity and protect natural resources, encourage ethical food sourcing from local farmers and suppliers who use environmentally sound methods, foster a healthy and eco-conscious campus community that values sustainability in everyday food choices, and strengthen UCU’s contribution to environmental protection and sustainable development through responsible consumption."
    ],
    "documentUrl": "../pdf/sdg15_p4.pdf"
  },
  {
    "title": "Urdaneta City University Bags 2nd Place in Best Scientific Poster at 2024 Luzon Regional Scientific Meeting",
    "image": "../images/sdg15_i15.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University once again demonstrated its excellence in research and innovation as the College of Information and Technology Education (CITE) proudly brought home the 2nd Place Award for Best Scientific Poster at the 2024 Luzon Regional Scientific Meeting, held on April 29–30, 2024, at NGN Gran Hotel, Tuguegarao City.",
      "With the theme “Beyond Farm Productivity: Transforming the Philippine Food System to Address Equity, Consumer Health, and Environmental Issues,” this year’s scientific meeting emphasized the importance of sustainable and inclusive innovations in agriculture and technology."
    ],
    "documentUrl": "../pdf/sdg15_p5.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to SDG 15 through Barangayanihan and Kapitbahayan Clean-Up Drive and Tree Planting",
    "image": "../images/sdg15_i15.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to stand at the forefront of environmental stewardship and community partnership as its faculty members and students actively participated in the Barangayanihan and Kapitbahayan Clean-Up Drive and Tree Planting held in Cabaruan, Urdaneta City, on April 12, 2024.",
      "This initiative forms part of the University’s unwavering dedication to the United Nations Sustainable Development Goals (SDGs) particularly SDG 15: Life on Land, which advocates for the protection, restoration, and sustainable use of terrestrial ecosystems. Through the collective efforts of the UCU community, the event successfully promoted a culture of environmental awareness, civic responsibility, and sustainable living."
    ],
    "documentUrl": "../pdf/sdg15_p6.pdf"
  },
  {
    "title": "URDANETA CITY UNIVERSITY POLICY ON CONSERVATION, RESTORATION, AND SUSTAINABLE USE OF TERRESTRIAL ECOSYSTEMS",
    "image": "../images/sdg15_i15.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) upholds its unwavering commitment to environmental stewardship and sustainability in alignment with the United Nations Sustainable Development Goals (SDGs)—particularly SDG 15: Life on Land. This policy seeks to ensure the conservation, restoration, and sustainable use of terrestrial ecosystems associated with the University, including forests, mountain areas, drylands, and other green spaces that contribute to biodiversity and ecological balance.",
      "As a learning institution, UCU recognizes the importance of integrating environmental protection into education, research, and community extension services. This policy strengthens UCU’s role in preserving natural resources, mitigating environmental degradation, and fostering a culture of ecological responsibility among its stakeholders."
    ],
    "documentUrl": "../pdf/sdg15_p7-8.pdf"
  },
  {
    "title": "Urdaneta City University Cultivates Sustainability through the 2024 Green Thumb Project: “Magtanim ng Gulay at Halaman Para May Buhay”",
    "image": "../images/sdg15_i15.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) once again reaffirmed its steadfast commitment to sustainability, community development, and environmental stewardship through the Green Thumb Project: “Magtanim ng Gulay at Halaman Para May Buhay”, launched in 2024 within the university premises.",
      "The initiative was spearheaded by the Office of the Vice President for Administrative Affairs, in partnership with the Center for Community Development and Extension Services (CCDES). This project was established as a proactive response to the rising prices and shortage of food commodities, both within the community and among university personnel. Through the creation of a sustainable garden, UCU aims to promote food security, self-sufficiency, and environmental awareness across the university community."
    ],
    "documentUrl": "../pdf/sdg15_p9-10.pdf"
  },
  {
    "title": "Urdaneta City University Policy on the Prevention and Management of Alien Species on Campus",
    "image": "../images/sdg15_i15.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU), in alignment with its commitment to the United Nations Sustainable Development Goals (SDGs)—especially SDG 15: Life on Land—is dedicated to the protection and preservation of biodiversity within and around its campus.",
      "This policy establishes guidelines to prevent, manage, and mitigate the ecological impact of alien or invasive species that may disrupt native ecosystems, threaten biodiversity, and alter the natural balance of the University’s environment.",
      "The purpose of this policy is to protect and conserve native flora and fauna within the University campus, prevent the introduction, spread, and establishment of alien or invasive species, establish management protocols to monitor and control invasive species when detected, and strengthen environmental awareness, research, and education related to biodiversity conservation and ecological balance."
    ],
    "documentUrl": "../pdf/sdg15_p11-12.pdf"
  },
  {
    "title": "Urdaneta City University and Barangay Oltama Join Forces for the 2024 Barangayanihan Clean-Up Drive: Strengthening Commitment to SDG 15 – Life on Land",
    "image": "../images/sdg15_i15.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its strong commitment to environmental stewardship and community engagement through its active participation in the Barangayanihan Clean-Up Drive held in Barangay Oltama, Urdaneta City, on November 19, 2024. This meaningful event was organized in partnership with the Oltama Barangay Council, uniting students, faculty, and local residents in a shared effort to create a cleaner and greener environment.",
      "The initiative aimed to promote environmental cleanliness, sustainability, and community cooperation, emphasizing the importance of shared responsibility in maintaining a healthy ecosystem. UCU students enthusiastically took part in cleaning public spaces, collecting waste, and revitalizing community areas—actions that not only beautified the surroundings but also helped raise awareness of proper waste management and sustainable living practices."
    ],
    "documentUrl": "../pdf/sdg15_p13-14.pdf"
  },
  {
    "title": "Urdaneta City University Champions Sustainability through Project WOW (War on Waste) 2024",
    "image": "../images/sdg15_i15.10.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) once again demonstrated its strong commitment to environmental sustainability and community engagement through the Project WOW (War on Waste), held on October 4, 2024. This initiative, organized by the Center for Community Development and Extension Services (CCDES) in partnership with the College of Criminal Justice Education (CCJE), exemplifies the university’s dedication to fostering environmental stewardship and collective responsibility among its students and faculty.",
      "Project WOW serves as a proactive campaign to promote waste reduction, cleanliness, and environmental consciousness within the university campus. Criminology students, together with volunteers from various colleges, actively participated in cleanup activities, waste segregation drives, and awareness campaigns that advocate for sustainable waste management practices."
    ],
    "documentUrl": "../pdf/sdg15_p15-16.pdf"
  },
  {
    "title": "URDANETA CITY UNIVERSITY POLICY ON PLASTIC WASTE REDUCTION",
    "image": "../images/sdg15_i15.11.png",
    "layout": "right-img",
    "content": [
      "In pursuit of Urdaneta City University’s commitment to sustainable development and environmental protection, this policy seeks to reduce plastic waste generation within the campus. In alignment with the United Nations Sustainable Development Goals (SDGs)—particularly SDG 15: Life on Land and SDG 12: Responsible Consumption and Production—UCU recognizes its responsibility to promote eco-friendly practices and minimize the ecological footprint of its operations.",
      "Plastic waste, especially single-use plastics, poses a serious threat to ecosystems, soil, and biodiversity. This policy reinforces UCU’s environmental stewardship and strengthens its ongoing initiatives for a cleaner and greener campus."
    ],
    "documentUrl": "../pdf/sdg15_p17-18.pdf"
  },
  {
    "title": "URDANETA CITY UNIVERSITY POLICY ON WASTE DISPOSAL AND HAZARDOUS MATERIALS MANAGEMENT",
    "image": "../images/sdg15_i15.12.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU), as a responsible academic institution, upholds its commitment to environmental protection, safety, and sustainability in alignment with the United Nations Sustainable Development Goals (SDGs)—particularly SDG 15: Life on Land and SDG 12: Responsible Consumption and Production.",
      "Recognizing the environmental and health hazards posed by improper waste disposal—especially hazardous waste from laboratories, maintenance units, and medical facilities—this policy ensures that all waste materials are handled, segregated, stored, and disposed of safely and responsibly. Through this policy, UCU aims to protect the health of its community, preserve the environment, and comply with national environmental regulations."
    ],
    "documentUrl": "../pdf/sdg15_p19-20.pdf"
  }
]
