[
  {
    "title": "Promoting Cultural Accessibility and Sustainable Heritage at the University",
    "image": "../images/sdg11_i11.1.png",
    "layout": "right-img",
    "content": [
      "The University upholds its commitment to Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities by ensuring that its buildings, monuments, and natural heritage landscapes of cultural significance remain accessible to the public. As an educational institution that values history, culture, and sustainability, the University believes that open access to these sites fosters a deeper appreciation of local identity and collective heritage.",
      "Through guided tours, public exhibitions, and cultural programs, the University invites students, researchers, and community members to explore and learn from its preserved landmarks and green spaces. These activities not only promote cultural awareness but also encourage environmental responsibility and civic participation."
    ],
    "documentUrl": "../pdf/sdg11_p2-3.pdf"
  },
  {
    "title": "Promoting Inclusive Learning Through Public Access to University Libraries",
    "image": "../images/sdg11_i11.2.png",
    "layout": "left-img",
    "content": [
      "The University demonstrates its dedication to Sustainable Development Goals (SDG 4: Quality Education) and SDG 11: Sustainable Cities and Communities by providing public access to its libraries, books, and academic publications. The institution recognizes that education is a shared responsibility and that access to knowledge should extend beyond the walls of the university.",
      "To support this vision, the University allows students, researchers, educators, and community members to visit its libraries and use available learning resources for research, study, and lifelong learning. These include printed books, journals, theses, digital archives, and other reference materials essential for academic and professional growth."
    ],
    "documentUrl": "../pdf/sdg11_p4.pdf"
  },
  {
    "title": "Public Access to University Museums, Exhibition Spaces, and Artworks Supporting SDG 11",
    "image": "../images/sdg11_i11.3.png",
    "layout": "right-img",
    "content": [
      "The university actively promotes cultural awareness and heritage preservation by providing public access to its museums, exhibition spaces, art galleries, and collections of artworks and artifacts. This initiative aligns with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, particularly in supporting target 11.4 — which emphasizes strengthening efforts to protect and safeguard the world’s cultural and natural heritage.",
      "By opening its cultural facilities to students, researchers, and the wider community, the university serves as a hub for creativity, learning, and appreciation of history and the arts. Exhibitions, art displays, and heritage showcases are regularly organized to encourage community engagement, inspire innovation, and promote understanding of cultural diversity."
    ],
    "documentUrl": "../pdf/sdg11_p5.pdf"
  },
  {
    "title": "Public Access to Open and Green Spaces Supporting SDG 11",
    "image": "../images/sdg11_i11.4.png",
    "layout": "left-img",
    "content": [
      "The university recognizes the vital role of green and open spaces in promoting sustainability, wellness, and community engagement. In line with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, the university provides free public access to its open and green spaces, such as gardens, courtyards, and recreational areas.",
      "These areas are designed to serve as safe and inclusive environments where students, faculty, and community members can gather, relax, and connect with nature. By maintaining accessible and well-managed green spaces, the university encourages outdoor learning, environmental awareness, and healthy lifestyles among the campus and local community."
    ],
    "documentUrl": "../pdf/sdg11_p6.pdf"
  },
  {
    "title": "University Contribution to Local Arts Supporting SDG 11",
    "image": "../images/sdg11_i11.5.png",
    "layout": "right-img",
    "content": [
      "The university actively supports and contributes to the enrichment of local arts and culture through its annual public performances by university choirs, theater groups, dance troupes, and music ensembles. These artistic activities embody the university’s commitment to fostering creativity, cultural appreciation, and community engagement, in alignment with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities.",
      "By organizing and participating in concerts, stage plays, cultural festivals, and exhibitions, the university serves as a platform for students and local artists to showcase their talents and express cultural identity. These performances are often open to the public, allowing community members to experience and appreciate the arts without barriers."
    ],
    "documentUrl": "../pdf/sdg11_p7.pdf"
  },
  {
    "title": "University Efforts to Preserve Intangible Cultural Heritage Supporting SDG 11",
    "image": "../images/sdg11_i11.6.png",
    "layout": "left-img",
    "content": [
      "The university demonstrates a strong commitment to cultural preservation and community development by implementing projects that record, document, and safeguard intangible cultural heritage, including local folklore, traditions, languages, and indigenous knowledge systems. This initiative supports Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, particularly target 11.4, which aims to strengthen efforts to protect and preserve the world’s cultural and natural heritage.",
      "Through research programs, community immersion activities, and cultural documentation projects, the university works closely with local communities, including displaced and marginalized groups, to collect and preserve oral histories, traditional practices, and regional dialects. These efforts ensure that valuable cultural expressions are recorded, studied, and passed on to future generations."
    ],
    "documentUrl": "../pdf/sdg11_p8.pdf"
  },
  {
    "title": "University Initiatives for Sustainable Commuting Supporting SDG 11",
    "image": "../images/sdg11_i11.7.png",
    "layout": "right-img",
    "content": [
      "The university is deeply committed to promoting environmentally responsible and inclusive mobility. In alignment with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, the university measures and sets targets for more sustainable commuting practices, encouraging the use of walking, cycling, carpooling, shuttle services, public transportation, and electric vehicles among students, faculty, and staff.",
      "To reduce the carbon footprint of daily travel, the university regularly monitors transportation patterns through surveys and mobility assessments. These data help in developing strategies and setting measurable goals to increase the proportion of commuters using sustainable transport modes each year."
    ],
    "documentUrl": "../pdf/sdg11_p9.pdf"
  },
  {
    "title": "University Actions Promoting Sustainable Commuting Supporting SDG 11",
    "image": "../images/sdg11_i11.8.png",
    "layout": "left-img",
    "content": [
      "In support of Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, the university actively undertakes actions to promote and increase the percentage of sustainable commuting among students, faculty, and staff. Recognizing the importance of reducing environmental impact and improving urban mobility, the university implements a range of initiatives that encourage the use of eco-friendly and shared transportation options.",
      "The university provides free or subsidized shuttle services to and from nearby public transport hubs, making travel more accessible and reducing dependence on private vehicles. To further promote active and sustainable mobility, the campus offers bicycle parking and storage facilities, designated cycling lanes, and a bicycle and pedestrian policy that ensures safety and convenience for non-motorized commuters."
    ],
    "documentUrl": "../pdf/sdg11_p10.pdf"
  },
  {
    "title": "University Promotion of Telecommuting and Flexible Work Arrangements Supporting SDG 11",
    "image": "../images/sdg11_i11.9.png",
    "layout": "right-img",
    "content": [
      "The university recognizes the importance of adopting sustainable and flexible work practices that contribute to environmental conservation and employee well-being. In alignment with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, the university promotes telecommuting or remote working as a matter of policy and offers flexible or condensed work schedules to help reduce employee commuting and energy consumption.",
      "Through official policies and administrative guidelines, employees are encouraged to work remotely when appropriate, particularly for tasks that can be efficiently accomplished using digital platforms. This practice not only minimizes daily travel and traffic congestion but also lowers carbon emissions and supports work-life balance."
    ],
    "documentUrl": "../pdf/sdg11_p11.pdf"
  },
  {
    "title": "University Provision of Affordable Housing for Employees Supporting SDG 11",
    "image": "../images/sdg11_i11.10.png",
    "layout": "left-img",
    "content": [
      "The university upholds its commitment to social responsibility and community sustainability by providing affordable housing options for its employees. This initiative directly supports Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities, particularly target 11.1, which emphasizes ensuring access for all to adequate, safe, and affordable housing.",
      "Through the development and maintenance of on-campus and nearby residential facilities, the university ensures that its faculty and staff have access to secure and reasonably priced accommodation. These housing programs are designed to ease financial burdens, promote work-life balance, and foster a sense of belonging within the university community."
    ],
    "documentUrl": "../pdf/sdg11_p12.pdf"
  },
  {
    "title": "Urdaneta City University’s Commitment to Affordable Student Housing: Supporting SDG 11",
    "image": "../images/sdg11_i11.11.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its dedication to building sustainable and inclusive communities by providing affordable housing options for students. This initiative directly supports the United Nations Sustainable Development Goal 11 (SDG 11): Sustainable Cities and Communities, which aims to make cities and human settlements inclusive, safe, resilient, and sustainable.",
      "The university recognizes that accessible and affordable housing plays a vital role in students’ overall well-being and academic success. By offering low-cost dormitory accommodations and collaborating with nearby residential facilities, UCU ensures that students—especially those coming from distant areas—can live in a safe and convenient environment conducive to learning."
    ],
    "documentUrl": "../pdf/sdg11_p13.pdff"
  },
  {
    "title": "Urdaneta City University Prioritizes Pedestrian Access for a Sustainable and Safe Campus",
    "image": "../images/sdg11_i11.12.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) remains committed to promoting sustainability and inclusivity by prioritizing pedestrian access within the campus, in alignment with Sustainable Development Goal (SDG) 11: Sustainable Cities and Communities. The University recognizes the importance of creating a safe, accessible, and environmentally friendly space for students, faculty, staff, and visitors.",
      "UCU continues to develop and maintain pedestrian-friendly pathways, shaded walkways, and designated crossing zones that encourage walking as the primary means of mobility on campus. This initiative not only helps reduce traffic congestion and carbon emissions but also contributes to the physical well-being and safety of the university community."
    ],
    "documentUrl": "../pdf/sdg11_p14.pdf"
  },
  {
    "title": "Urdaneta City University’s Collaboration with Local Authorities for Inclusive Urban Development",
    "image": "../images/sdg11_i11.13.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) actively collaborates with local government units (LGUs) and community planners to promote sustainable urban development and address local housing challenges. Through joint initiatives, consultations, and planning activities, the university contributes its expertise in research, education, and community engagement to help ensure that urban development projects are inclusive, resilient, and beneficial to all.",
      "One of the university’s key roles is providing academic and technical support to the city’s planning programs, particularly in areas related to urban planning, environmental management, and affordable housing development. By engaging with the City Planning and Development Office, UCU helps identify suitable areas for housing projects and supports data-based decision-making to ensure that new developments meet the needs of local residents, including low-income families and students."
    ],
    "documentUrl": "../pdf/sdg11_p15.pdf"
  },
  {
    "title": "Urdaneta City University’s Commitment to Sustainable Building Standards",
    "image": "../images/sdg11_i11.14.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) upholds its commitment to sustainability by ensuring that all newly constructed buildings on campus follow environmentally responsible and energy-efficient design principles. The university integrates sustainability into the planning, design, and construction of its infrastructure to minimize environmental impact and promote long-term operational efficiency.",
      "All new university facilities are designed and built in accordance with national sustainable construction standards guided by the Philippine Green Building Code, which was established by the Department of Public Works and Highways (DPWH). This code aligns with the goals of the World Green Building Council, promoting efficient use of resources, reduction of greenhouse gas emissions, and creation of healthy and comfortable learning environments."
    ],
    "documentUrl": "../pdf/sdg11_p16.pdf"
  },
  {
    "title": "Urdaneta City University’s Commitment to Sustainable Land Use through Brownfield Site Development",
    "image": "../images/sdg11_i11.15.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its strong commitment to sustainability by prioritizing the redevelopment and reuse of brownfield sites — areas that have been previously developed or built upon — for new construction and campus expansion. This approach promotes efficient land use, reduces environmental impact, and helps preserve natural and agricultural areas within Urdaneta City.",
      "In collaboration with the Urdaneta City Planning and Development Office, UCU identifies potential brownfield areas that can be repurposed for academic and community use. By transforming underutilized spaces into modern, functional facilities, the university supports urban renewal and contributes to a cleaner, more sustainable city environment."
    ],
    "documentUrl": "../pdf/sdg11_p17.pdf"
  }
]
