[
  {
    "title": "Urdaneta City University: Leading Local Education Campaigns on Climate Risks and Mitigation Awareness",
    "image": "../images/sdg13_13.3.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its commitment to climate action by spearheading educational initiatives that raise awareness on climate risks and mitigation strategies. Aligned with the United Nations Sustainable Development Goals (SDGs), particularly SDG 13: Climate Action, the University empowers students and community members with the knowledge and competencies needed to address the escalating impacts of climate change.",
      "UCU’s comprehensive efforts integrate disaster preparedness, risk communication, and sustainability-focused learning across academic programs and community outreach activities. Through strong collaborations with local government units and civic organizations, the University promotes climate resilience, equipping both youth and residents with the skills necessary for effective response, adaptation, and long-term environmental stewardship."
    ],
    "documentUrl": "../pdf/sdg13_13.3.1.pdf"
  },
  {
    "title": "Urdaneta City University: Leading Climate Action Through Community Partnerships",
    "image": "../images/sdg13_13.3.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) strengthens its commitment to Sustainable Development Goal 13: Climate Action by working closely with local government units and community organizations to advance climate education, awareness, and resilience-building initiatives. These collaborative efforts aim to equip individuals with the knowledge and skills needed to respond effectively to the growing impacts of climate change.",
      "By integrating climate education into academic programs and community outreach activities, UCU empowers students, educators, and residents to engage actively in climate solutions. Capacity-building workshops, seminars, and school-based programs focus on vital topics such as climate adaptation, sustainable energy practices, and disaster preparedness—fostering climate-smart and resilient communities across the region."
    ],
    "documentUrl": "../pdf/sdg13_13.3.2.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Cooperative Planning for Climate Change Disasters and Community Displacement Preparedness",
    "image": "../images/sdg13_13.3.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to advance its commitment to sustainability, disaster resilience, and inclusive community development by actively participating in cooperative planning efforts for climate change disaster preparedness. Through the Disaster Risk Reduction and Management (DRRM) Office, the University collaborates closely with local government units (LGUs), national agencies, and industry partners to promote a culture of readiness and enhance disaster resilience across Pangasinan and neighboring provinces.",
      "In response to the growing risks posed by climate-driven disasters and the potential displacement of communities both domestically and internationally, UCU integrates disaster preparedness and human-security awareness into its academic and outreach initiatives. These efforts align with Sustainable Development Goal 13 (Climate Action) and SDG 17 (Partnerships for the Goals), highlighting the importance of collective action among educational institutions, government stakeholders, and civil society in addressing the complex challenges brought by climate change."
    ],
    "documentUrl": "../pdf/sdg13_13.3.3.pdf"
  },
  {
    "title": "Urdaneta City University: Empowering LGUs in Climate Change Early Warning and Monitoring",
    "image": "../images/sdg13_13.3.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to advance its commitment to environmental resilience by supporting local and regional governments in strengthening climate change adaptation, disaster risk reduction, and early warning and monitoring systems. These initiatives reflect the University’s dedication to building safer and more informed communities that can respond effectively to climate-related threats.",
      "With the Philippines identified as one of the most vulnerable countries to climate-induced disasters, UCU works closely with Local Government Units (LGUs) to promote proactive, data-driven, and community-centered approaches to disaster preparedness. Through technical guidance, capacity-building efforts, and multi-sector collaboration, the University helps enhance local capabilities to protect lives, safeguard livelihoods, and foster long-term climate resilience."
    ],
    "documentUrl": "../pdf/sdg13_13.3.4.pdf"
  },
  {
    "title": "Urdaneta City University: Advancing Climate Adaptation Through NGO Collaboration",
    "image": "../images/sdg13_13.3.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to promote climate resilience by forging strong partnerships with non-governmental organizations (NGOs). These collaborations support the University’s commitment to Sustainable Development Goal 13: Climate Action, empowering communities to adopt sustainable practices and strengthen adaptive capacities amid the growing challenges of climate change.",
      "Through joint initiatives with NGOs, UCU conducts knowledge-sharing activities, capacity-building workshops, and community-based programs that address the impacts of climate change. These efforts equip students, faculty, and residents with essential skills to respond to environmental challenges, implement effective adaptation strategies, and support sustainable and climate-resilient livelihoods."
    ],
    "documentUrl": "../pdf/sdg13_13.3.5.pdf"
  },
  {
    "title": "Urdaneta City University: Committing to Carbon Neutrality by 2030 under GHG Protocol Standards",
    "image": "../images/sdg13_13.4.1.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reinforces its leadership in climate action by committing to achieve carbon neutrality by 2030, in alignment with the United Nations Sustainable Development Goal Target 13.4.1. This ambitious commitment is part of the University’s comprehensive sustainability framework, which integrates campus operations, research initiatives, and community extension programs under a unified climate responsibility agenda. By embedding sustainability into its institutional culture, UCU aims to reduce greenhouse gas (GHG) emissions, enhance energy efficiency, and cultivate climate consciousness among students, faculty, staff, and partner communities.",
      "Implementation of the carbon neutrality roadmap will be led by the Office of External Affairs & Linkages, the Disaster Risk Reduction and Management Office (DRRMO), and the General Services / Administrative Affairs Offices. A dedicated Carbon Neutrality Steering Committee will oversee policy formulation, data collection, and performance monitoring across operational, research, and extension units. Through annual audits and regular reporting, UCU ensures transparency, accountability, and alignment with global climate and sustainability standards."
    ],
    "documentUrl": "../pdf/sdg13_13.4.1.pdf"
  }
]
