[
  {
    "year": "2023",
    "title": "UCU CARE PROJECT",
    "image": "../images/sdg1p1.png",
    "layout": "right-img",
    "content": [
      "The Center for Student Leadership and Development-Character and Values Formation Unit at Urdaneta City University launched an inspiring initiative entitled “UCUIANS CARE PROJECT,” with the theme \"Caring Beyond Borders! Healthy Student, Healthy Mind.\" Aligned with the United Nations Sustainable Development Goal 1 –No Poverty, this project seeks to promote the values of empathy, generosity, and community-mindedness by encouraging students to practice the timeless principle that caring is sharing.",
      "The UCUIANS CARE PROJECT is designed to build awareness of the importance of sharing and compassion, fostering a campus environment where students are encouraged to think beyond themselves. Through this initiative, participants gain insight into the significance of generosity as a catalyst for personal and communal growth. Such acts of kindness help reinforce strong bonds within the university community, allowing individuals to relate to one another with understanding and respect."
    ],
    "documentUrl": "../pdf/no-poverty-1.3.3.pdf"
  },
  {
    "year": "2023",
    "title": "AFFORDABLE EDUCATION FOR THE BRIGHT FUTURE OF UCU STUDENTS",
    "image": "../images/sdg1p2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU), through its Center for Student Leadership and Development (CSLD), continues to demonstrate its dedication to fostering an inclusive and equitable learning environment by offering financial assistance through its Tuition Discount Program. This initiative, which aligns with the United Nations Sustainable Development Goal 1 – No Poverty, is designed to provide essential support to students from economically disadvantaged families, helping reduce the barriers to education and empowering them to achieve their academic goals.",
      "In its ongoing effort to break the cycle of poverty through education, UCU understands the significant impact that financial constraints can have on a student’s academic journey. The Tuition Discount Program seeks to alleviate this burden by offering qualifying students reduced tuition fees, allowing them to focus on their studies and personal development without the constant worry of financial hardship."
    ],
    "documentUrl": "../pdf/no-poverty-1.3.5.pdf"
  },
  {
    "year": "2023",
    "title": "EXTENSION ACTIVITY: CAS AGAPE",
    "image": "../images/sdg1p3.png",
    "layout": "right-img",
    "content": [
      "The College of Arts and Sciences, under the leadership of Dean Princess Quintana, organized the EXTENSION ACTIVITY: CAS AGAPE for the students of Tiposu Elementary School on December 15, 2023. This event, which aimed to provide both material and emotional support, was made possible through the collective efforts of the college's faculty and students, who came together to uplift and bring joy to the children in the community.",
      "In terms of objectives, the EXTENSION ACTIVITY: CAS AGAPE Program aimed to accomplish several key goals. Firstly, it focused on providing essential school supplies to underprivileged students, ensuring that they had the necessary tools for their education. This effort helped ease the financial burden on families who might otherwise struggle to afford these basic items. Secondly, the program sought to offer hope and encouragement to children from economically disadvantaged backgrounds, particularly during the holiday season."
    ],
    "documentUrl": "../pdf/extension-activity-cas-agape.pdf"
  },
  {
    "year": "2023",
    "title": "CAMPUS STUDENT ORGANIZATIONS’ TRADE FAIR",
    "image": "../images/sdg1p4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its commitment to supporting students and the local community in building financially and socially sustainable businesses through the Center for Student Leadership and Development (CSLD). One of the core mandates of the CSLD is to create economic and entrepreneurial programs designed to empower students with the practical knowledge and skills essential for navigating the world of business and trade.",
      "To fulfill this mandate, the CSLD has launched a pilot project for the Campus Student Organizations’ Trade Fair, an innovative approach aimed at encouraging campus-based entrepreneurial ventures. This fair provides accredited Campus Student Organizations (CSOs) with a platform to showcase their products and services, gaining hands-on experience in running a business."
    ],
    "documentUrl": "../pdf/no-poverty-1.4.1.pdf"
  },
  {
    "year": "2023",
    "title": "ORIENTATION FOR NEW STUDENTS",
    "image": "../images/sdg1p5.png",
    "layout": "right-img",
    "content": [
      "Orientation at Urdaneta City University (UCU) is a vital program for new students, helping them transition smoothly into university life. It provides an introduction to UCU's academic culture, campus resources, and student services, ensuring students are equipped with the knowledge and tools they need for success. The orientation also fosters a sense of belonging, encouraging students to connect with peers, faculty, and staff, and to embrace the opportunities and challenges of their educational journey. By attending, new students can navigate their first year with confidence and a clear understanding of UCU's values and expectations."
    ],
    "documentUrl": "../pdf/orientation-program-2023-2024.pdf"
  },
  {
    "year": "2023",
    "title": "Urdaneta City University Teams Up with Schools and Barangays to Fight Poverty Through Extension Program",
    "image": "../images/sdg1p6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) has officially launched a series of extension programs aimed at addressing poverty in the region. This new initiative, which focuses on empowering local communities through educational support, is a collaborative effort between UCU, local schools, and barangays (villages). The program is part of the university's commitment to supporting the local government’s ongoing efforts to eradicate poverty and contribute to the United Nations' Sustainable Development Goal of ending poverty in all its forms by 2030.",
      "The official launch of the program was marked by the signing of a Memorandum of Agreement led by UCU’s Extension Director, Jerry Dichoso, who played a pivotal role in forging partnerships between the university, local schools, and barangays. The event, held at the respective campuses of the partner schools and barangays, saw the signing of Memoranda of Agreement (MOAs) with several barangay councils and schools in the region, formalizing their commitment to work together in delivering the program’s objectives."
    ],
    "documentUrl": "../pdf/ucu-teams-with-schools-and-barangays-to-fight-poverty.pdf"
  },
  {
    "year": "2023",
    "title": "GROWING OPPORTUNITIES: UCU LAUNCHES LIVELIHOOD TRAINING ON MUSHROOM FARMING",
    "image": "../images/sdg1p7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) is taking significant steps to support sustainable business initiatives with the launch of a Livelihood Training Program on Mushroom Production, held on September 15, 2019. The program, organized by the Center for Community Development and Extension Services (CCDES) under the leadership of Dr. Mary Ruth Cinchez, aims to provide participants with the practical skills needed to start their own mushroom farming businesses while promoting sustainable agricultural practices.",
      "In partnership with the Provincial Agriculture Office, represented by Mdm. Concordia S. Lee, the training focused on both the technical aspects of mushroom production and the entrepreneurial strategies needed to establish a viable, long-term business. Mdm. Lee, who served as the lead trainer, guided the participants through key processes such as cultivation, harvesting, and the economic potential of mushroom farming as a sustainable business venture."
    ],
    "documentUrl": "../pdf/growing-opportunities.pdf"
  }
]
