[
  {
    "year": "2024",
    "title": "BENCHMARKING ACTIVITY with Mainstreaming Volunteerism",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "In recent years, volunteerism has gained growing recognition as a powerful driver of positive social change across government, private organizations, and civil society, with volunteers contributing valuable skills, passion, and resources to address social, environmental, and economic challenges. Despite its acknowledged benefits, volunteerism often remains fragmented and underutilized within larger institutional frameworks. To bridge this gap, the project “Benchmarking Activity with Mainstreaming Volunteerism” was proposed to explore ways of integrating volunteerism more effectively into mainstream organizational strategies and operations. The initiative aimed to identify best practices, share successful models, and develop a roadmap for organizations to embed volunteerism within their core functions. Designed as a collaborative platform, the activity brought together diverse stakeholders—including government agencies, non-profits, private companies, and volunteer groups—to exchange experiences and insights. By engaging thought leaders and practitioners, the seminar promoted a deeper understanding of how volunteerism can align with broader organizational goals such as community development, capacity building, and sustainable impact."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims:",
        "items": [
          "To identify and analyze successful models of volunteerism integration in mainstream programs.",
          "To enhance the understanding of how volunteerism can contribute to sustainable community development.",
          "To promote the benefits of mainstreaming volunteerism in organizational structures.",
          "To foster collaboration and knowledge sharing among participants from different sectors."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The “Benchmarking Activity with Mainstreaming Volunteerism” significantly contributed to advancing several United Nations Sustainable Development Goals (SDGs), showcasing volunteerism as a powerful catalyst for sustainable development. The seminar highlighted volunteerism’s multifaceted role in promoting inclusive growth, empowering communities, and addressing global challenges outlined in the SDGs. It underscored how volunteerism supports SDG 1: No Poverty by engaging volunteers in frontline poverty alleviation efforts, improving access to basic services, education, and healthcare, thus helping marginalized communities overcome economic barriers. Similarly, volunteerism plays a crucial role in SDG 3: Good Health and Well-Being through participation in public health initiatives such as vaccination drives, health education, mental health support, and emergency response, particularly in underserved areas. The activity also emphasized contributions to SDG 4: Quality Education, where volunteers bridge educational gaps by tutoring, mentoring, and leading programs in resource-limited communities, helping ensure equitable access to quality education. In advancing SDG 5: Gender Equality, volunteer-led initiatives address gender-based violence, advocate for women’s leadership, and support economic empowerment, challenging traditional norms and fostering equality. Volunteerism further promotes SDG 10: Reduced Inequality by empowering marginalized groups through community development and advocacy, supporting inclusive development models that prioritize equity. Lastly, the seminar reinforced SDG 17: Partnerships for the Goals by facilitating collaboration among government, non-profits, private sectors, and volunteer groups, enabling resource sharing, scaling of successful initiatives, and collective progress toward the SDGs. Through these efforts, the activity demonstrated the vital role of mainstreaming volunteerism in driving sustainable and inclusive development worldwide."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The “Benchmarking Activity with Mainstreaming Volunteerism” seminar was a highly successful and impactful event that achieved its goals of fostering dialogue, sharing best practices, and promoting the integration of volunteerism into organizational frameworks. It offered valuable insights into effectively mainstreaming volunteerism within institutions to support sustainable development and social responsibility. A key strength was its comprehensive approach, combining theoretical knowledge with practical examples presented by a diverse range of speakers—from UCU leadership to PNVSCA personnel—providing a well-rounded perspective on implementation and scaling across different organizational contexts. By showcasing successful case studies alongside challenges faced, the seminar equipped participants with a clear, actionable roadmap for incorporating volunteerism into their practices. The event also fostered an interactive and engaging atmosphere, enhanced by multimedia presentations and the participation of various stakeholders including academics, non-profits, and corporate representatives, which reinforced the collaborative nature of volunteerism as a collective force for good. A strong emphasis on the Sustainable Development Goals (SDGs) allowed attendees to connect volunteerism with broader social, economic, and environmental objectives, ensuring the seminar’s relevance to global development priorities. While overwhelmingly positive, feedback suggested that future seminars could benefit from more hands-on, interactive workshops for developing practical mainstreaming plans in smaller groups, as well as including additional case studies from diverse sectors like the private industry to broaden applicability. Logistically, the event was well-organized with a conducive venue, smooth program flow, and effective audiovisual support, making the overall experience informative and engaging for all participants."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To enhance future seminars on volunteerism, it's recommended to include more interactive workshops and diverse case studies to provide practical strategies and broader insights. A follow-up mechanism and recognition for participants would maintain momentum and encourage continued action. Additionally, exploring the role of technology in volunteerism and involving local community leaders and corporate partners could broaden perspectives and strengthen impact. These adjustments would ensure lasting success in mainstreaming volunteerism."
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Reducing Inequalities through Fair Admissions: Upholding SDG 10 in Higher Education",
    "image": "../images/sdg10_i10.1.png",
    "layout": "right-img",
    "content": [
      "The pursuit of equality in education is central to the United Nations’ Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, which seeks to promote social, economic, and political inclusion for all, regardless of age, gender, disability, race, ethnicity, origin, or socio-economic status. Within this framework, universities play a vital role as agents of change, particularly through the implementation of non-discriminatory admissions policies that ensure fairness and inclusivity in access to higher education.",
      "A fair and inclusive admissions policy guarantees that opportunities for education are based on merit, potential, and qualification rather than on personal or social circumstances. By maintaining and publicly posting such policies, universities demonstrate transparency, accountability, and a strong commitment to equality. This approach fosters trust among stakeholders and reinforces the idea that education is a right accessible to all, not a privilege reserved for a few."
    ],
    "documentUrl": "../pdf/sdg10_p2.pdf"
  },
  {
    "title": "Measuring Inclusivity in Admissions: Urdaneta City University’s Commitment to SDG 10 – Reduced Inequalities",
    "image": "../images/sdg10_i10.2.png",
    "layout": "left-img",
    "content": [
      "In line with the United Nations Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, higher education institutions hold a crucial responsibility to promote equitable access to learning opportunities. Beyond ensuring that admissions policies are non-discriminatory, universities must also measure and monitor the representation of underrepresented and potentially underrepresented groups to guarantee that inclusivity is not only stated but practiced.",
      "At Urdaneta City University (UCU), the commitment to inclusivity extends beyond the written policy. The university recognizes that genuine equality requires continuous evaluation of who gains access to education and who may still be left behind. To uphold this, UCU systematically gathers and analyzes data related to student applications and admissions, focusing on various underrepresented groups including ethnic minorities, low-income students, women, non-traditional learners, persons with disabilities (PWDs), LGBT students, and indigenous or newly settled refugee students."
    ],
    "documentUrl": "../pdf/sdg10_p3-4.pdf"
  },
  {
    "title": "Upholding Equality through Anti-Discrimination Policy in Urdaneta City University",
    "image": "../images/sdg10_i10.3.png",
    "layout": "right-img",
    "content": [
      "The pursuit of equality and fairness is at the core of Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, which emphasizes eliminating discrimination and promoting inclusivity in all sectors of society. In higher education, this principle translates into establishing an anti-discrimination policy that ensures a safe, respectful, and equitable environment for every member of the academic community.",
      "At Urdaneta City University (UCU), this commitment to equality is embodied in its Anti-Discrimination Policy, which protects all students, faculty, and staff from unfair treatment based on race, ethnicity, gender, religion, disability, socio-economic status, sexual orientation, or any other characteristic unrelated to academic or professional performance. The policy upholds the university’s belief that diversity is a strength and that education must be accessible and inclusive to everyone."
    ],
    "documentUrl": "../pdf/sdg10_p6.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to Diversity, Equity, and Inclusion",
    "image": "../images/sdg10_i10.4.png",
    "layout": "left-img",
    "content": [
      "In pursuit of the United Nations Sustainable Development Goal 10: Reduced Inequalities, Urdaneta City University (UCU) continues to champion a campus environment rooted in fairness, inclusivity, and human dignity. Through the establishment of its Diversity, Equity, and Inclusion (DEI) Committee, UCU solidifies its commitment to ensuring that every member of the academic community—students, faculty, staff, and visitors—feels represented, respected, and empowered.",
      "The DEI Committee serves as the university’s core advisory and action body dedicated to addressing issues related to equality, diversity, and human rights. It functions under the guidance of the university administration and in close coordination with key offices such as the Office of Student Affairs and Services (OSAS), the Guidance and Counseling Office, the Human Resource Management Office (HRMO), and the Gender and Development (GAD) Office. Together, these units work hand in hand to develop inclusive programs and policies that reflect UCU’s long-standing principle of education for all."
    ],
    "documentUrl": "../pdf/sdg10_p7.pdf"
  },
  {
    "title": "Strengthening Inclusion through Diversity and Equality Structures in Urdaneta City University",
    "image": "../images/sdg10_i10.5.png",
    "layout": "right-img",
    "content": [
      "In pursuit of the United Nations’ Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, higher education institutions are called upon not only to practice inclusivity but to institutionalize mechanisms that uphold it. This includes the establishment of dedicated diversity and equality offices, committees, or officers responsible for promoting inclusion, human rights, and equitable opportunities across the academic community.",
      "At Urdaneta City University (UCU), the administration recognizes the significance of embedding equality into the very framework of the institution. Through its designated offices and committees — such as the Gender and Development (GAD) Focal Point System, Human Resource Management Office (HRMO), and Office of Student Affairs (OSA) — UCU ensures that policies, programs, and training sessions related to diversity, equity, inclusion (DEI), and human rights are actively implemented and monitored."
    ],
    "documentUrl": "../pdf/sdg10_p8.pdf"
  },
  {
    "title": "Promoting Accessibility and Inclusion through Disability-Friendly Facilities in Urdaneta City University",
    "image": "../images/sdg10_i10.6.png",
    "layout": "left-img",
    "content": [
      "In alignment with the Sustainable Development Goal 10 (SDG 10): Reduced Inequalities, Urdaneta City University (UCU) continues to strengthen its commitment to providing equitable access to education for all. One of the most tangible ways the university fulfills this goal is through the development and maintenance of accessible facilities that cater to the needs of individuals with disabilities.",
      "Accessibility is a cornerstone of inclusion. It ensures that every member of the university community — regardless of physical ability — can fully participate in academic and social life without barriers. UCU’s dedication to this principle reflects the belief that education should be a right, not a privilege limited by environmental or physical constraints."
    ],
    "documentUrl": "../pdf/sdg10_p9.pdf"
  },
  {
    "title": "Urdaneta City University’s Commitment to Accessibility and Inclusion: Supporting Persons with Disabilities",
    "image": "../images/sdg10_i10.7.png",
    "layout": "right-img",
    "content": [
      "In alignment with Sustainable Development Goal 10 (Reduced Inequalities), particularly the commitment to empower and promote the social, economic, and political inclusion of all, Urdaneta City University (UCU) continuously strengthens its support services for persons with disabilities (PWDs). The university recognizes that equitable access to quality education requires more than just open doors—it demands active systems of support that ensure every student, regardless of physical or cognitive ability, can thrive in an inclusive academic environment.",
      "UCU provides several support services designed to assist students with disabilities in their daily learning experiences. These include the availability of personal assistants for students requiring physical mobility support, as well as interpreters for students with hearing impairments to facilitate communication during lectures and campus events. Furthermore, the university ensures that academic buildings, facilities, and classrooms are PWD-friendly, with ramps, elevators, and accessible restrooms that comply with accessibility standards."
    ],
    "documentUrl": "../pdf/sdg10_p10.pdf"
  },
  {
    "title": "Urdaneta City University’s Access Schemes for Persons with Disabilities: Upholding Equality in Education",
    "image": "../images/sdg10_i10.8.png",
    "layout": "left-img",
    "content": [
      "In full support of the United Nations Sustainable Development Goal 10: Reduced Inequalities, Urdaneta City University (UCU) is committed to ensuring that no student is left behind—especially those with disabilities who face unique challenges in accessing higher education. Through its inclusive policies and accessibility programs, UCU continuously upholds its mission of providing equal educational opportunities for all learners, regardless of physical, mental, or sensory limitations.",
      "To achieve this, UCU implements several access schemes designed specifically for students with disabilities. These schemes include preferential admission and enrollment assistance, where students with disabilities are given priority lanes and special assistance during registration to ensure a smooth and dignified process. The university also provides academic accommodations, such as extended time for examinations, accessible learning materials, and flexible classroom arrangements to meet individual needs."
    ],
    "documentUrl": "../pdf/sdg10_p11.pdf"
  }
]
