[
  {
    "title": "Urdaneta City University’s Policy on Ethical Sourcing of Food and Supplies in Support of SDG 12: Responsible Consumption and Production",
    "image": "../images/sdg12_i12.1.png",
    "layout": "right-img",
    "content": [
      "In support of the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), Urdaneta City University (UCU) upholds a strong commitment to sustainability, social responsibility, and ethical procurement through the implementation of its Policy on Ethical Sourcing of Food and Supplies.",
      "Created in 2023 and reviewed in 2024, this policy ensures that all food products, materials, and supplies procured by the university meet ethical, environmental, and social standards. UCU recognizes that ethical sourcing not only promotes responsible consumption but also supports fair trade, sustainable production, and community well-being."
    ],
    "documentUrl": "../pdf/sdg12_p2-6.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Policy on Waste Disposal and Hazardous Materials Management",
    "image": "../images/sdg12_i12.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reaffirms its dedication to environmental protection and sustainable operations through the Policy on Waste Disposal and Hazardous Materials Management, established in 2023 and reviewed in 2024. This policy is aligned with Sustainable Development Goal 12 (Responsible Consumption and Production), focusing on responsible waste management, pollution prevention, and safe handling of hazardous substances.",
      "The policy ensures that all university units follow proper waste segregation, treatment, and disposal procedures—especially for hazardous materials generated in laboratories, clinics, and maintenance areas. It mandates compliance with national and local environmental regulations and promotes practices that minimize waste production at the source."
    ],
    "documentUrl": "../pdf/sdg12_p7-11.pdf"
  },
  {
    "title": "Urdaneta City University’s Policy on Waste Disposal in Support of SDG 12: Responsible Consumption and Production",
    "image": "../images/sdg12_i12.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) recognizes the vital role that higher education institutions play in promoting environmental responsibility and sustainable waste management. In alignment with the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), the university has implemented a comprehensive Waste Disposal Policy, created in 2023 and reviewed in 2024, to effectively measure and manage the amount of waste generated, recycled, and sent to landfills across the campus.",
      "This policy serves as a framework for the university’s waste management initiatives, ensuring that all operations—from academic departments to administrative offices—adhere to sustainable waste disposal practices. The policy specifically mandates the quantitative measurement and monitoring of waste to evaluate progress toward reducing landfill contributions and increasing recycling rates."
    ],
    "documentUrl": "../pdf/sdg12_p12-17.pdf"
  },
  {
    "title": "Urdaneta City University’s Policy on Plastic Use Minimisation in Support of SDG 12: Responsible Consumption and Production",
    "image": "../images/sdg12_i12.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its strong commitment to environmental sustainability through the implementation of its Plastic Use Minimisation Policy, created in 2023 and reviewed in 2024. This policy aligns with the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), emphasizing the responsible use of materials and the reduction of plastic waste within the university community.",
      "The policy aims to minimise the generation and use of single-use plastics across all university operations, including cafeterias, offices, events, and student activities. UCU recognizes that reducing plastic consumption is essential to preventing environmental degradation, conserving resources, and fostering a culture of sustainability among students, faculty, and staff."
    ],
    "documentUrl": "../pdf/sdg12_p18-19.pdf"
  },
  {
    "title": "Urdaneta City University’s Policy on Use Minimisation of Disposable Items in Support of SDG 12: Responsible Consumption and Production",
    "image": "../images/sdg12_i12.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) reaffirms its commitment to sustainability and environmental responsibility through the implementation of its Policy on Use Minimisation of Disposable Items, created in 2023 and reviewed in 2024. This policy supports the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production) by promoting the efficient use of resources and the reduction of waste generated from disposable products.",
      "The policy establishes guidelines to reduce the use of single-use and disposable materials such as plastic utensils, paper cups, sachets, and packaging across all university departments, offices, cafeterias, and events. It aims to transition the university toward sustainable consumption patterns by encouraging the use of durable, reusable, and eco-friendly alternatives."
    ],
    "documentUrl": "../pdf/sdg12_p20-21.pdf"
  },
  {
    "title": "Urdaneta City University’s Sustainable Procurement and Supply Chain Practices in Support of SDG 12",
    "image": "../images/sdg12_i12.6.png",
    "layout": "left-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), Urdaneta City University (UCU) extends its sustainability policies beyond its internal operations to include outsourced supplies, services, and the supply chain. This initiative ensures that all suppliers, contractors, and partners uphold the university’s commitment to sustainability, ethical sourcing, and environmental responsibility.",
      "UCU’s Procurement and Supply Chain Policy, established in 2023 and reviewed in 2024, emphasizes the importance of minimizing environmental impact throughout the purchasing and contracting processes. The policy covers the acquisition of equipment, stationery, and building materials, as well as partnerships with service providers such as janitorial, catering, and construction firms."
    ],
    "documentUrl": "../pdf/sdg12_p22.pdf"
  },
  {
    "title": "Urdaneta City University’s Waste Measurement and Recycling Practices in Support of SDG 12",
    "image": "../images/sdg12_i12.7.png",
    "layout": "right-img",
    "content": [
      "In full support of the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), Urdaneta City University (UCU) actively measures, monitors, and manages the amount of waste generated and recycled across the entire institution. This university-wide effort demonstrates UCU’s strong commitment to sustainability, accountability, and environmental protection.",
      "Under the University Waste Management Policy (created in 2023 and reviewed in 2024), UCU ensures that all departments and facilities participate in the systematic measurement of total waste output and tracking of recyclable materials. Data is collected regularly through the Office of Environmental Management in coordination with custodial and maintenance units to evaluate the university’s waste reduction performance."
    ],
    "documentUrl": "../pdf/sdg12_p23.pdf"
  },
  {
    "title": "Urdaneta City University’s Annual Sustainability Report in Support of SDG 12: Responsible Consumption and Production",
    "image": "../images/sdg12_i12.8.png",
    "layout": "left-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goal 12 (Responsible Consumption and Production), Urdaneta City University (UCU) demonstrates transparency and accountability in its environmental and social initiatives through the annual publication of its Sustainability Report. This report serves as a comprehensive record of the university’s progress, programs, and commitments toward sustainable development.",
      "The UCU Sustainability Report, published every year, provides detailed information on the university’s performance in key areas such as waste management, energy efficiency, water conservation, responsible procurement, and environmental education. It highlights measurable outcomes, including the amount of waste generated and recycled, the reduction of plastic and disposable materials, and the implementation of green policies and programs across all departments."
    ],
    "documentUrl": "../pdf/sdg12_p24.pdf"
  }
]
