[
  {
    "year": "2024",
    "title": "UCU UI GreenMetric Entries",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The External Affairs and Linkages Office of Urdaneta City University (UCU) has played a pivotal role in leading the university’s successful participation in the prestigious UI GreenMetric World University Rankings. This global initiative assesses higher education institutions based on their commitment to sustainability, environmental stewardship, and green campus initiatives.",
          "In pursuit of this recognition, the External Affairs and Linkages Office spearheaded a coordinated and strategic effort involving collaboration with various university departments. This multi-sectoral approach ensured the comprehensive collection, accurate validation, and timely submission of essential data aligned with UI GreenMetric’s sustainability criteria, which include energy and climate change, waste management, water usage, transportation, education, and green infrastructure.",
          "Through its dedication and collaborative leadership, the office has not only contributed to elevating UCU’s global profile but has also reinforced the university’s commitment to environmental responsibility and sustainable development."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims:",
        "items": [
          "To examine the role of the External Affairs and Linkages Office in facilitating Urdaneta City University's participation in the UI GreenMetric World University Rankings.",
          "To assess the effectiveness of inter-departmental coordination and collaboration in the collection, validation, and submission of sustainability-related data.",
          "To identify the challenges and best practices encountered during the university’s preparation and participation in the ranking process."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The External Affairs and Linkages Office, has actively contributed to the United Nations Sustainable Development Goals (SDGs) by aligning its initiatives with the criteria of the UI GreenMetric World University Rankings. The university's efforts support SDG 4 (Quality Education) through sustainability-focused learning, SDG 6 (Clean Water and Sanitation) and SDG 7 (Affordable and Clean Energy) through resource conservation, and SDG 11 (Sustainable Cities and Communities) via green infrastructure. It also advances SDG 12 (Responsible Consumption and Production) and SDG 13 (Climate Action) by implementing waste reduction and environmental programs. Additionally, UCU fosters global and local partnerships in line with SDG 17 (Partnerships for the Goals), reinforcing its commitment to sustainable development and environmental responsibility."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The university’s participation in the UI GreenMetric World University Rankings, led by the External Affairs and Linkages Office, can be considered a significant milestone in advancing Urdaneta City University’s sustainability initiatives. The activity was marked by strong interdepartmental collaboration, effective coordination, and a shared commitment to environmental responsibility. Through the meticulous collection and validation of data, the university demonstrated its capacity to align institutional practices with international sustainability standards. Moreover, the process served as a valuable platform for raising awareness within the academic community about the importance of environmental stewardship and the United Nations Sustainable Development Goals (SDGs). While there were challenges in consolidating data from various units, these were effectively addressed through consistent communication and teamwork. Overall, the activity not only enhanced UCU’s global visibility but also fostered a culture of sustainability that can be built upon in future university programs and initiatives."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To further strengthen Urdaneta City University’s sustainability efforts and future participation in the UI GreenMetric World University Rankings, it is recommended that the university institutionalize a dedicated sustainability task force composed of representatives from key departments. This body should regularly monitor and document sustainability-related activities to ensure data readiness and improve performance across all criteria. Additionally, integrating sustainability education more deeply into the curriculum and promoting student-led green initiatives can enhance campus-wide engagement. Continued capacity-building programs, such as workshops and training on sustainable practices, are also encouraged to keep faculty and staff updated on global standards. Lastly, forging stronger partnerships with external organizations and local government units can expand the university’s sustainability impact and resource network."
            ]
          }
        ]
      }
    ]
  },
  {
    "year": "2024",
    "title": "UCU UI-GreenMetric Rankings",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The UI GreenMetric World University Rankings, established by Universitas Indonesia, evaluate higher-education institutions on their environmental policies and sustainable operations across six indicators: Setting & Infrastructure, Energy & Climate, Waste, Water, Transportation, and Education & Research. Participation signals a university’s willingness to benchmark its sustainability performance against global peers and publicly commit to continuous improvement.",
          "Urdaneta City University (UCU) has taken part in the ranking for several cycles, seeing it as both a diagnostic tool and a catalyst for campus-wide environmental programs. Over time, the university has embedded GreenMetric criteria into strategic planning, involving academic units, facilities offices, and student organizations in data collection and project implementation.",
          "In the 2024 edition, UCU’s efforts culminated in a series of standout results: 1st in Pangasinan Province, 3rd in Region 1, 8th nationwide, and 189th in Asia, with an overall position of 361st out of 1,477 universities worldwide. Particularly noteworthy is UCU’s top ranking among Philippine Higher Education Institutions in Water Management and its distinction as the leading Local University and College (LUC) in the country—achievements coordinated largely by the Office of External Affairs and Linkages."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Identify strengths and gaps across the six GreenMetric indicators to inform evidence-based campus policies.",
          "Showcase UCU’s best practices—especially in water conservation—to local, national, and international audiences.",
          "Foster a culture of environmental stewardship by engaging students, faculty, and staff in data gathering and project execution."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "UCU’s engagement with the UI GreenMetric Rankings advances multiple SDGs. By prioritizing SDG 6 (Clean Water and Sanitation) through exemplary water-management initiatives, and SDG 7 (Affordable and Clean Energy) via energy-efficient infrastructure, the university directly mitigates resource consumption and emissions. Efforts to improve waste segregation, green spaces, and sustainable transport align with SDG 11 (Sustainable Cities and Communities) and SDG 12 (Responsible Consumption and Production), while campus-wide climate-action campaigns support SDG 13 (Climate Action). Finally, the collaborative nature of data collection, involving academic units and external partners, embodies SDG 17 (Partnerships for the Goals) by demonstrating how collective action drives measurable sustainability outcomes."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The 2024 results confirm that UCU’s systematic approach to sustainability is producing tangible gains: higher scores in five of six indicators and notable ascents in regional and global rankings. Faculty and student involvement in evidence collection also strengthened campus-wide ownership of green initiatives.",
              "Externally, the rankings boosted UCU’s profile, attracting inquiries about its water-management model from neighboring universities and local government units. This visibility positions the institution as a knowledge hub for sustainable-campus practices in Northern Luzon and beyond.",
              "Challenges remain—chiefly the need for more granular energy-usage monitoring and enhanced waste-segregation compliance. Nonetheless, the ranking process itself has become a motivational tool, driving iterative improvements each year."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "Moving forward, UCU should institutionalize an annual sustainability data-cycle calendar, integrating GreenMetric evidence gathering with regular facilities audits to ease year-end reporting. Expanding sub-metering for buildings and deploying smart-waste bins will generate real-time datasets that sharpen future interventions, particularly in the Energy and Waste indicators.",
              "Parallel to technical upgrades, the university can deepen community engagement—introducing incentive programs for departments that meet reduction targets and establishing student “GreenMetric Ambassadors” who spearhead peer-education drives. By coupling infrastructure enhancements with behavior-change strategies, UCU will consolidate its leadership status and continue climbing the global sustainability rankings."
            ]
          }
        ]
      }
    ]
  }
]
