[
  {
    "year": "2024",
    "title": "3rd NPES (National Peace Education Summit)",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The Office of External Affairs and Linkages actively participated in the 3rd National Peace Education Summit, which was conducted virtually. This significant event served as a strategic platform for the university to connect with prominent stakeholders in the field of peace education, including educators, government agencies, civil society organizations, and peace advocates from across the country.",
          "The summit provided a comprehensive learning environment that highlighted best practices in peacebuilding, conflict resolution, and the promotion of a culture of peace. Through a series of presentations, workshops, and panel discussions, participants were able to deepen their understanding of critical themes such as conflict transformation, human rights, and sustainable development.",
          "By engaging in this national dialogue, the university reaffirmed its commitment to integrating peace education into its academic and outreach programs. The summit also opened avenues for future partnerships and collaborative initiatives that will strengthen the institution’s role in advancing peace and social justice at both local and national levels."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims:",
        "items": [
          "To engage with national stakeholders in peace education to foster partnerships and collaborative initiatives that promote a culture of peace.",
          "To gain insights into best practices in peacebuilding, conflict transformation, and conflict resolution through participation in presentations, workshops, and discussions.",
          "To enhance the university’s capacity to integrate peace education, human rights, and sustainable development principles into its academic and community engagement programs.",
          "To contribute to national dialogue on peace education by sharing institutional experiences and exploring innovative approaches to fostering peaceful and inclusive societies.",
          "To identify opportunities for future collaboration and linkages with academic institutions, civil society organizations, and government agencies involved in peace advocacy and education."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The participation of The Office of External Affairs and Linkages in the 3rd National Peace Education Summit significantly contributed to the advancement of the United Nations Sustainable Development Goals (SDGs), particularly SDG 4 (Quality Education), SDG 16 (Peace, Justice, and Strong Institutions), and SDG 17 (Partnerships for the Goals). By engaging in discussions and workshops focused on peace education, human rights, and conflict resolution, the university reinforced its commitment to providing inclusive and equitable quality education that promotes lifelong learning opportunities. The summit also emphasized the importance of building peaceful, just, and inclusive societies, aligning closely with efforts to reduce violence, promote the rule of law, and ensure access to justice for all. Furthermore, the event created opportunities for collaboration with various stakeholders, strengthening partnerships that are essential for achieving sustainable development. Through its active involvement, the university demonstrated its role as a proactive agent in fostering peace and sustainable progress both within and beyond the academic community."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The participation of The Office of External Affairs and Linkages in the 3rd National Peace Education Summit was a highly valuable experience that enriched the university’s understanding and engagement in peace education. The summit provided meaningful opportunities to learn about innovative peacebuilding practices and current trends in conflict resolution, which are essential for enhancing the university’s academic and community programs. Interaction with diverse stakeholders fostered new partnerships and collaborative possibilities, strengthening the university’s network within the peace education sector. Overall, the activity successfully aligned with the university’s goals to promote social justice, human rights, and sustainable development, and it laid a solid foundation for continued involvement in national peace initiatives. Moving forward, the insights gained from the summit are expected to inform the design of more impactful peace education activities and linkages."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "Based on the outcomes of the summit, it is recommended that the university strengthen the integration of peace education principles and best practices into its curriculum and community outreach programs to further promote a culture of peace. Active collaboration with other participating organizations, government agencies, and civil society groups should be pursued to develop joint peacebuilding initiatives and broaden the impact of these efforts. Additionally, the university should invest in regular capacity-building activities such as training and workshops for faculty, staff, and students to deepen their knowledge in conflict resolution, human rights, and sustainable development. Increasing awareness through campus-wide campaigns and events will also be vital in fostering a shared commitment to peace and social cohesion. Lastly, sustaining participation in future national and regional peace education summits is essential to keep abreast of emerging trends and to maintain the university’s active role in the broader peace education community."
            ]
          }
        ]
      }
    ]
  },
  {
    "year": "2024",
    "title": "BRILGE: Building Resources for Inclusive Legal Guidance and Empowerment",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "Recognizing the vital need for accessible legal support, Urdaneta City University (UCU) proudly introduces BRILGE: Building Resources for Inclusive Legal Guidance and Empowerment, a dedicated legal aid caravan providing essential legal services to the entire campus community. BRILGE empowers students, faculty, and staff by offering free legal consultations, workshops, and resources that simplify the legal system and foster understanding of individual rights. Held at the UCU Gymnasium, this initiative creates a welcoming space where participants can interact with legal professionals, ask questions, and gain the knowledge needed to make informed decisions. Through partnerships with local legal aid organizations, law students, and community advocates, BRILGE aims to eliminate barriers to legal access, emphasizing that everyone deserves the opportunity to understand their rights and receive guidance on issues ranging from academic integrity to housing and consumer rights."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Provide free legal consultations to students and staff on common legal issues such as tenancy rights, academic integrity, and consumer rights",
          "Raise awareness about legal rights and resources available to the campus community",
          "Facilitate workshops on legal literacy, focusing on practical skills like contract understanding and conflict resolution."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The BRILGE initiative makes a meaningful impact on several Sustainable Development Goals (SDGs), especially Goal 16: Peace, Justice, and Strong Institutions, by providing free legal consultations and promoting legal literacy to enhance access to justice and build accountable, inclusive community institutions. It empowers students, faculty, and staff to understand their rights, navigate legal challenges, and engage confidently in civil and institutional processes. Additionally, BRILGE supports Goal 4: Quality Education by integrating legal education through workshops and interactive discussions that develop practical life skills, critical thinking, civic engagement, and ethical decision-making—key elements of holistic education. The program also advances Goal 10: Reduced Inequalities by focusing on legal empowerment for underserved groups who often lack access to professional legal assistance, ensuring inclusivity in understanding and asserting legal rights. Ultimately, BRILGE cultivates a culture of empowerment, accountability, and legal awareness that promotes human rights and equitable development within the university and its broader community."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The BRILGE legal aid caravan was a highly impactful initiative that successfully addressed the need for accessible legal support within the Urdaneta City University community. The program created a safe, inclusive, and informative space where students, faculty, and staff could engage directly with legal professionals, seek guidance on various legal matters, and enhance their understanding of their rights. Participants responded positively to the opportunity to receive free legal consultations, particularly on practical concerns such as academic policies, tenancy issues, and consumer protection. The legal literacy workshops were especially effective in demystifying complex legal topics, equipping attendees with essential skills in contract comprehension, conflict resolution, and rights awareness. The collaboration between university stakeholders, law practitioners, and community partners strengthened the initiative’s credibility and reach. Overall, BRILGE successfully fostered a more informed, empowered campus population and demonstrated the university’s commitment to justice, equity, and service to its community."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To further enhance the effectiveness and sustainability of the BRILGE program, several recommendations are suggested. First, increasing the frequency of the legal aid caravan—such as hosting it quarterly or semi-annually—would allow for continuous support and follow-up on legal concerns. Expanding the scope of services to include more specialized areas, such as family law, labor rights, and cybercrime, could also meet a broader range of legal needs within the university community. It is also recommended to implement a confidential pre-registration system for consultations to manage time effectively and ensure privacy. Additionally, distributing printed or digital legal information materials (e.g., brochures or FAQs) during the event would reinforce learning beyond the sessions. Lastly, involving law students in organizing and assisting during the event could provide valuable experiential learning opportunities while helping scale the program’s reach. These improvements would help BRILGE make a deeper, long-term impact on legal empowerment across the university."
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Empowering Representation: Urdaneta City University’s Commitment to Inclusive and Transparent Leadership",
    "image": "../images/sdg16_i16.1.png",
    "layout": "right-img",
    "content": [
      "In pursuit of Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) continues to uphold democratic leadership and transparency in its governance system. The university ensures that every sector of its community has a voice in decision-making through elected representation on the institution’s highest governing body, the Board of Regents.",
      "The Board of Regents is composed of key officials and representatives from various sectors, including the faculty, non-teaching personnel, students, and alumni. Each representative is elected through transparent and participatory processes, embodying the university’s commitment to inclusivity, fairness, and accountability. This structure allows diverse perspectives to be heard and considered in shaping university policies and programs."
    ],
    "documentUrl": "../pdf/sdg16_p2.pdf"
  },
  {
    "title": "UCU Board of Regents Upholds Good Governance and Institutional Integrity",
    "image": "../images/sdg16_i16.2.png",
    "layout": "left-img",
    "content": [
      "The Urdaneta City University (UCU) Board of Regents, led by Hon. Julio F. Parayno III, City Mayor and Chair of the Board, stands as the university’s highest governing body committed to transparency, accountability, and inclusive leadership. Acting University President Dr. Amihan April C. Mella-Alcazar serves as Vice-Chair, working closely with representatives from the government, education, business, civic, alumni, and student sectors.",
      "Composed of diverse and accomplished members, the Board ensures that institutional decisions align with the university’s mission of excellence and good governance. Its composition includes Atty. Dar A. Diga (Chief Operating Officer), Engr. Randy F. Parayno (Business Sector Representative), Hon. Franklin V. Villanueva (Education Sector Representative), Engr. Arnold C. Santos (DOST Representative), Atty. Reynaldo G. Paris (Civic Sector Representative), Prof. Eleuterio S. Sison."
    ],
    "documentUrl": "../pdf/sdg16_p3.pdf"
  },
  {
    "title": "Julio “Rammy” Parayno III Wins Urdaneta City Mayoral Race, Commits to Transparent Governance",
    "image": "../images/sdg16_i16.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City — Julio F. “Rammy” Parayno III has been re-elected as Mayor of Urdaneta City following a decisive victory in the recent municipal elections. His win reaffirms the citizens’ trust in his leadership and continued vision of progress, transparency, and accountable governance.",
      "Parayno, who also serves as Chair of the Urdaneta City University Board of Regents, emphasized his commitment to strengthening institutional integrity and promoting participatory leadership. He vowed to sustain programs that prioritize public service efficiency, local development, and citizen empowerment."
    ],
    "documentUrl": "../pdf/sdg16_p4.pdf"
  },
  {
    "title": "UCU Personnel Association Upholds Fair and Transparent Elections",
    "image": "../images/sdg16_i16.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City — The Urdaneta City University Personnel Association (UCUPA) successfully concluded its 2022 elections, emphasizing fairness, transparency, and active participation among university personnel. The event, organized by the UCUPA Commission on Elections, ran smoothly from the filing of candidacies to the proclamation of winners on October 3, 2022, during the university’s flag-raising ceremony.",
      "All candidates were given equal opportunity to campaign and present their platforms, fostering a climate of respect and cooperation throughout the process. The newly elected officers, led by Prof. Eleuterio S. “Terry” Sison, were chosen through a democratic exercise that reflected the collective will and unity of the UCU workforce."
    ],
    "documentUrl": "../pdf/sdg16_p5.pdf"
  },
  {
    "title": "UCU Student Council Elections Highlight Democratic Participation and Transparency",
    "image": "../images/sdg16_i16.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City — The Urdaneta City University (UCU) successfully conducted its 2023 Student Council Elections, reflecting a strong culture of democratic engagement and student empowerment. With a remarkable 74.49% voter turnout, the elections showcased the active participation of the student body in shaping the leadership that represents their collective voice.",
      "The electoral process was marked by fairness, transparency, and inclusivity, ensuring that every student had the opportunity to exercise their right to vote. John Carlo D. Pulido emerged as the elected president, gaining the trust of the student community through a credible and peaceful election supervised by the UCU Commission on Elections."
    ],
    "documentUrl": "../pdf/sdg16_p6.pdf"
  },
  {
    "title": "Strengthening Student Voice: Urdaneta City University’s Support for Independent and Participatory Governance",
    "image": "../images/sdg16_i16.6.png",
    "layout": "left-img",
    "content": [
      "In line with Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) strongly recognizes and supports the existence of an independent University Student Council (USC), which serves as the highest governing student body on campus. This recognition reflects UCU’s steadfast commitment to participatory leadership, transparency, and accountability in university governance.",
      "The University Student Council represents the unified voice of the entire student body. It leads the Council of Leaders, an alliance of accredited student organizations, program-based councils, and special-interest groups within the university. This structure ensures that every student sector is represented, promoting collaboration and shared responsibility in advancing student welfare and institutional goals."
    ],
    "documentUrl": "../pdf/sdg16_p7.pdf"
  },
  {
    "title": "UCU Upholds Democratic Integrity Through Annual Student Council Elections",
    "image": "../images/sdg16_i16.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City — The Urdaneta City University (UCU) successfully conducted its 2024 University Student Council Elections, continuing its long-standing tradition of promoting fairness, transparency, and active student participation. With a 73.82% voter turnout as of November 18, 2024, the election once again demonstrated the strong civic engagement of the UCU student body.",
      "Held every academic year, the university-wide elections ensure that leadership transitions within the Student Council remain democratic and representative. The process—from the filing of candidacies to the final canvassing of votes—is supervised by the UCU Commission on Elections to safeguard impartiality and accountability."
    ],
    "documentUrl": "../pdf/sdg16_p8.pdf"
  },
  {
    "title": "UCU Proclaims Newly Elected Student Council Officers for AY 2024–2025",
    "image": "../images/sdg16_i16.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City — The Urdaneta City University (UCU) officially proclaimed its newly elected University Student Council officers for Academic Year 2024–2025, marking the culmination of a fair and transparent electoral process. The proclamation followed the successful conduct of the university-wide elections supervised by the UCU Commission on Elections.",
      "The annual election of new student leaders ensures continuity in governance while allowing fresh perspectives and innovative ideas to emerge. This democratic process empowers students to take part in leadership transitions that strengthen accountability, inclusivity, and collective growth within the UCU community."
    ],
    "documentUrl": "../pdf/sdg16_p9.pdf"
  },
  {
    "title": "UCU Student Council Leads “First Day High Under the Sky” to Welcome New and Returning Students",
    "image": "../images/sdg16_i16.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City — The Urdaneta City University (UCU) Student Council led the “First Day High Under the Sky” program, a vibrant university tradition that warmly welcomes freshmen, returnees, and transferees at the start of every academic year. The event featured a series of engaging and inclusive activities designed to help students adapt, connect, and embrace the UCU community spirit.",
      "Through the initiative, the Student Council fostered a sense of belonging and unity among students, creating a positive atmosphere for the beginning of the school year. Faculty members and student organizations also joined the celebration, emphasizing collaboration and shared responsibility in promoting student welfare and institutional harmony."
    ],
    "documentUrl": "../pdf/sdg16_p10.pdf"
  },
  {
    "title": "The University Scribe Upholds Independent Student Journalism",
    "image": "../images/sdg16_i16.10.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City — The University Scribe (TUS), the independent student publication of Urdaneta City University (UCU), continues to champion press freedom and student empowerment through its active reporting and publication initiatives. It consistently features campus events, student achievements, and university activities across its digital platforms and printed issues.",
      "As an autonomous publication managed by students, TUS exemplifies integrity and accountability in campus journalism. It serves as a platform for students to express their views, promote transparency, and strengthen the flow of truthful and responsible information within the university community."
    ],
    "documentUrl": "../pdf/sdg16_p11.pdf"
  },
  {
    "title": "Council of Leaders Promotes Student Engagement and Community Service",
    "image": "../images/sdg16_i16.11.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City — The Council of Leaders (COL) of Urdaneta City University (UCU) continues to strengthen student involvement through a variety of activities that enhance learning beyond the classroom. These programs aim to develop leadership, collaboration, and civic responsibility among students while enriching their university experience.",
      "Beyond campus, the Council of Leaders also extends its service through community outreach programs that engage children and youth in educational and developmental activities. These initiatives reflect the council’s commitment to applying student leadership in ways that make a meaningful impact on the broader community."
    ],
    "documentUrl": "../pdf/sdg16_p12.pdf"
  },
  {
    "title": "Fostering Collaboration: Urdaneta City University’s Engagement with Local Stakeholders for Transparent Governance",
    "image": "../images/sdg16_i16.12.png",
    "layout": "left-img",
    "content": [
      "In pursuit of Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) continues to strengthen its commitment to transparent and inclusive governance by maintaining written policies and procedures for identifying and engaging with local stakeholders. These policies ensure that the university’s programs and initiatives are aligned with community needs and national development goals.",
      "UCU’s governance framework highlights the importance of collaboration between the university and its external partners. Through well-defined guidelines, the institution identifies local stakeholders such as government agencies, industries, schools, civic organizations, and community groups, ensuring meaningful participation in decision-making and program implementation. This structured engagement promotes trust, accountability, and mutual growth between the university and its partners."
    ],
    "documentUrl": "../pdf/sdg16_p13.pdf"
  },
  {
    "title": "Policy and Procedures on Identifying Local Stakeholders for External Affairs",
    "subtitle": "Urdaneta City University",
    "image": "../images/sdg16_i16.13.png",
    "layout": "right-img",
    "content": [
      "This policy establishes a systematic process for identifying, assessing, and engaging local stakeholders who are vital to the initiatives of Urdaneta City University (UCU), particularly under the External Affairs function. Local stakeholders include businesses, government offices, educational institutions, organizations, community groups, and individuals who contribute to or support the University’s mission, values, and strategic plans.",
      "This policy applies to the External Affairs Office and all departments or units that initiate or participate in stakeholder engagement. It serves as a guide in planning, identifying, establishing, and managing collaborations and community outreach activities."
    ],
    "documentUrl": "../pdf/sdg16_p14-15.pdf"
  },
  {
    "title": "Building Partnerships: Urdaneta City University’s Inclusive Mechanisms for Community Participation in Governance",
    "subtitle": "",
    "image": "../images/sdg16_i16.14.png",
    "layout": "left-img",
    "content": [
      "In strong alignment with Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) ensures that local stakeholders, including community residents, local government units, and civil society representatives, are given meaningful avenues to participate in university decision-making. This inclusive governance framework reinforces the university’s dedication to transparency, accountability, and participatory leadership.",
      "UCU recognizes that effective governance extends beyond the campus. Through consultative meetings, public forums, and partnership councils, the university engages local stakeholders in planning, implementing, and evaluating institutional programs and projects. These collaborative mechanisms ensure that community perspectives and societal needs are reflected in the university’s policies, extension services, and development initiatives."
    ],
    "documentUrl": "../pdf/sdg16_p16.pdf"
  },
  {
    "title": "Procedure and Guidelines for Stakeholder Participation in Partnership Decision-Making",
    "subtitle": "",
    "image": "../images/sdg16_i16.15.png",
    "layout": "right-img",
    "content": [
      "This procedure provides a structured mechanism that allows stakeholders to meaningfully participate in Urdaneta City University’s (UCU) partnership decision-making process. It ensures that stakeholder insights, needs, and expertise are considered and that partnership decisions support UCU’s mission, strategic goals, and community values.",
      "These guidelines apply to UCU administrators, academic units, and external stakeholders such as local government agencies, private and industry partners, non-government organizations, community groups, residents, and other individuals or entities involved in or affected by proposed partnerships."
    ],
    "documentUrl": "../pdf/sdg16_p17-18.pdf"
  },
  {
    "title": "UCU Champions Good Governance through Accountability and Integrity Policies",
    "subtitle": "",
    "image": "../images/sdg16_i16.16.png",
    "layout": "left-img",
    "content": [
      "In full support of Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) upholds its commitment to transparency, accountability, and ethical governance through the publication of its principles and policies against organized crime, corruption, and bribery. These principles reflect the university’s stand for integrity and justice as essential foundations of institutional leadership.",
      "UCU has clearly outlined its anti-corruption measures in official policy documents, manuals, and administrative issuances. These include strict guidelines on ethical conduct, financial accountability, and disciplinary procedures for both employees and students. The university also implements monitoring systems to ensure that all transactions and operations adhere to public service ethics and anti-bribery standards."
    ],
    "documentUrl": "../pdf/sdg16_p19.pdf"
  },
  {
    "title": "Urdaneta City University’s Principles and Commitments on Organized Crime, Corruption, and Bribery",
    "subtitle": "",
    "image": "../images/sdg16_i16.17.png",
    "layout": "right-img",
    "content": [
      "This memorandum reaffirms Urdaneta City University's commitment to promoting transparency, ethical conduct, and accountability. The university strictly opposes organized crime, corruption, and bribery in any form.",
      "The university upholds honesty and accountability in academic, administrative, and financial dealings. All stakeholders must avoid conflicts of interest that may affect their duties or the university’s reputation."
    ],
    "documentUrl": "../pdf/sdg16_p20.pdf"
  },
  {
    "title": "Championing Academic Freedom: Urdaneta City University’s Commitment to Ethical and Transparent Scholarship",
    "image": "../images/sdg16_i16.18.png",
    "layout": "left-img",
    "content": [
      "In alignment with Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) firmly upholds academic freedom as a cornerstone of its educational philosophy. The university has established policies that protect the freedom of faculty and researchers to pursue scholarly inquiries, select research areas, and share their findings publicly, ensuring an environment where knowledge and truth can flourish without fear or bias.",
      "UCU’s governance framework recognizes that innovation and progress stem from unrestricted intellectual exploration. Through its institutional research guidelines and ethical standards, the university empowers faculty members and students to engage in research that addresses pressing societal, technological, and cultural issues while maintaining responsibility, integrity, and respect for academic ethics."
    ],
    "documentUrl": "../pdf/sdg16_p21-23.pdf"
  },
  {
    "title": "Research Primer 2024: Connecting Research to Policy and Sustainable Development",
    "image": "../images/sdg16_i16.19.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU), through its Office of the Center for Research and Development (OCRD), continues to strengthen its commitment to academic freedom by empowering students and faculty to explore research topics that advance policy development and contribute to sustainable community impact. In a recent gathering of students and research coordinators, OCRD highlighted that academic freedom is essential to innovation and meaningful knowledge creation. The activity emphasized that researchers at UCU are free to choose their research focus, encourage diverse perspectives, and share their findings publicly.",
      "Guided by the theme “Connecting the Dots: Research, Policy, and Sustainable Development,” this year’s Research Primer showcases how academic freedom enables researchers to identify relevant issues, connect research outcomes to policy, and propose solutions that support sustainable development goals. By giving researchers the autonomy to pursue their areas of interest without unnecessary restrictions, UCU ensures that research outputs are grounded in genuine curiosity and aligned with both societal needs and emerging global challenges."
    ],
    "documentUrl": "../pdf/sdg16_p24.pdf"
  },
  {
    "title": "Ensuring Transparency: Urdaneta City University’s Commitment to Public Access and Financial Accountability",
    "image": "../images/sdg16_i16.20.png",
    "layout": "left-img",
    "content": [
      "In alignment with Sustainable Development Goal 16 (SDG 16)—Peace, Justice, and Strong Institutions—Urdaneta City University (UCU) demonstrates its commitment to transparency and accountability through the regular publication of its financial data. This initiative ensures that all financial transactions, resource allocations, and budgetary priorities are made accessible to the public, fostering trust and confidence among stakeholders.",
      "The university upholds clear policies and procedures that mandate the disclosure of audited financial statements and budget reports. These documents are published through official university channels and are made available to concerned offices, partner institutions, and governing bodies. Such openness reflects UCU’s dedication to ethical governance and financial integrity in managing public funds and educational resources."
    ],
    "documentUrl": "../pdf/sdg16_p25.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Governance through Research and Policy Collaboration",
    "image": "../images/sdg16_i16.21.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) supports the promotion of peace, justice, and strong institutions in alignment with the United Nations Sustainable Development Goal (SDG) 16. The University provides expert advice and research-based inputs to local and regional governments to guide policy formulation, community planning, and institutional improvement.",
      "Through its Center for Research and Development and the Center for Community Development and Extension Services (CCDES), UCU conducts studies that help identify community issues and recommend policy solutions. One of its projects, “Analyzing Community Needs in the City of Urdaneta,” provided the City Government with data and recommendations on urban development, public health, waste management, and stray animal control. The results of this study were used as reference in local decision-making and planning."
    ],
    "documentUrl": "../pdf/sdg16_p26.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Governance through Capacity Building and Legal Education",
    "image": "../images/sdg16_i16.22.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to take an active role in advancing effective governance and justice through education, outreach, and community engagement—aligning with the United Nations Sustainable Development Goal (SDG) 16: Peace, Justice, and Strong Institutions. Specifically addressing SDG 16.3.2, which focuses on capacity-building and upskilling for policy- and law-makers, the University demonstrates its commitment to strengthening institutional knowledge and promoting responsible leadership across communities.",
      "Through its Center for Community Development and Extension Services (CCDES), UCU has implemented several capacity-building initiatives aimed at empowering local officials and community leaders. One notable program was the Leadership Capability Training for barangay officials and public servants of Barangay Sugcong, Urdaneta City."
    ],
    "documentUrl": "../pdf/sdg16_p27.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Policy Research Collaboration with Government for Sustainable Development",
    "image": "../images/sdg16_i16.23.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to advance its commitment to evidence-based policymaking and sustainable governance through its active collaboration with the City Government of Urdaneta and other public institutions. Guided by the principles of Sustainable Development Goal (SDG) 16: Peace, Justice, and Strong Institutions, the University conducts policy-focused research and provides technical assistance to support transparent, effective, and accountable governance.",
      "Through its Center for Research and Development (CRD), UCU serves as the official research arm of the City Government of Urdaneta. The CRD’s Research Manual outlines the University’s role in developing and conducting studies that promote the sustainable development of the city through the efficient use of government resources, improved operations, and enhanced public service delivery."
    ],
    "documentUrl": "../pdf/sdg16_p28.pdf"
  },
  {
    "title": "Urdaneta City University Fosters Open Dialogue and Ethical Leadership Through Neutral Platforms",
    "image": "../images/sdg16_i16.24.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its commitment to peace, justice, and strong institutions under the United Nations Sustainable Development Goal (SDG) 16 by providing safe and inclusive spaces for dialogue and civic engagement. Through academic forums, leadership symposia, and partnership initiatives, the University promotes transparency, ethical leadership, and mutual understanding among diverse stakeholders in governance, education, and community development.",
      "One of UCU’s major initiatives was the Leadership Symposium titled “Leading the Public Good: Strategies for Ethical and Equal Governance” held on June 13, 2024. The event gathered student leaders, faculty members, and public servants, including former Vice President Maria Leonor “Leni” Robredo, to discuss key issues in public service, leadership, and governance."
    ],
    "documentUrl": "../pdf/sdg16_p29.pdf"
  }
]
