[
  {
    "title": "Urdaneta City University Intervenes to Support Student Food Security",
    "image": "../images/sdg2_i2.3.1.png",
    "layout": "right-img",
    "content": [
      "Recognizing that hunger and malnutrition can directly hinder academic success, Urdaneta City University (UCU) has strengthened its efforts to ensure that no student goes hungry while pursuing their education. Through a combination of financial aid, welfare services, community partnerships, and nutrition advocacy, UCU demonstrates its strong commitment to the United Nations Sustainable Development Goal 2 (Zero Hunger)—aiming to end hunger, achieve food security, and promote sustainable agriculture.",
      "UCU upholds its student-centered mission by providing broad welfare services through its Student Services portal, which emphasizes the university’s readiness to support students with “whatever it is that you need.” This open-access approach helps address food insecurity among learners who may struggle to meet their daily needs."
    ],
    "documentUrl": "../pdf/sdg2_p2-10.pdf"
  },
  {
    "title": "Urdaneta City University (UCU): Championing Sustainable and Inclusive Food Choices on Campus",
    "image": "../images/sdg2_i2.3.3.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) upholds its commitment to sustainability, inclusivity, and student well-being by promoting healthy and affordable food choices across the campus. Aligned with the United Nations Sustainable Development Goal 2 (Zero Hunger), which aims to end hunger and ensure access to safe, nutritious, and sufficient food for all, UCU strives to create an environment where every student can make mindful and health-conscious food decisions.",
      "UCU recognizes the importance of catering to diverse dietary preferences and cultural backgrounds. The university aims to provide accessible and varied meal options that support both the nutritional needs and ethical choices of its students and staff.",
      "Although specific details of campus food offerings are not widely publicized, UCU’s institutional focus on student welfare and holistic health reflects its dedication to ensuring that everyone has access to affordable and nutritious food."
    ],
    "documentUrl": "../pdf/sdg2_p11-13.pdf"
  },
  {
    "title": "Nourishing Minds & Bodies: UCU’s Commitment to Healthy & Affordable Campus Food Aligned with SDG 2",
    "image": "../images/sdg2_i2.3.4.png",
    "layout": "right-img",
    "content": [
      "In the spirit of the United Nations Sustainable Development Goal 2 (Zero Hunger), which calls for ending hunger, achieving food security, improving nutrition, and promoting sustainable agriculture, Urdaneta City University (UCU) reaffirms its commitment to providing healthy, affordable, and accessible food choices for all its students, faculty, and staff.",
      "Good nutrition is foundational. When students and university personnel have reliable access to wholesome meals, they are better able to learn, teach, innovate, and serve. UCU, as a publicly operated local university in Urdaneta City, Pangasinan, Philippines, is uniquely positioned to integrate this commitment into its mission of inclusive education and community service."
    ],
    "documentUrl": "../pdf/sdg2_p14-17.pdf"
  },
  {
    "title": "Urdaneta City University: Advancing SDG 2 Through Interventions to Prevent and Alleviate Hunger Among Staff",
    "image": "../images/sdg2_i2.3.5.png",
    "layout": "left-img",
    "content": [
      "In line with the United Nations’ Sustainable Development Goal 2 (Zero Hunger), which seeks to end hunger, achieve food security, improve nutrition, and promote sustainable agriculture, Urdaneta City University (UCU) continues to strengthen its initiatives to support the health and well-being of its personnel. The university recognizes that a healthy and nourished workforce is essential to sustaining academic excellence and effective public service.",
      "UCU has taken proactive steps to provide interventions that prevent and alleviate hunger among staff. Affordable and nutritious meals are made readily available within campus food facilities to ensure that employees have access to balanced and reasonably priced food options. Menus are carefully curated to include healthy meal combinations that promote both physical and mental wellness."
    ],
    "documentUrl": "../pdf/sdg2_p18-20.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Food Security Through Sustainable Agriculture and Aquaculture Education",
    "image": "../images/sdg2_i2.5.1.png",
    "layout": "right-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goal 2 (Zero Hunger), Urdaneta City University (UCU) continues to uphold its commitment to promoting food security and sustainable livelihoods by extending agricultural and aquaculture knowledge, skills, and technologies to local farmers and food producers.",
      "As an institution devoted to research, innovation, and community development, UCU actively engages in programs that empower local communities to adopt sustainable and science-based farming and aquaculture practices. Through its College of Agriculture, College of Fisheries, and Extension Services, the university provides training sessions, workshops, and hands-on demonstrations that aim to enhance productivity, resource efficiency, and environmental stewardship."
    ],
    "documentUrl": "../pdf/sdg2_p21-22.pdf"
  },
  {
    "title": "Urdaneta City University: Fostering Knowledge Exchange for Local Farmers and Food Producers",
    "image": "../images/sdg2_i2.5.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its commitment to community empowerment and sustainable development through its initiatives that bring together local farmers and food producers in meaningful events designed for knowledge sharing, collaboration, and innovation. These activities align with the United Nations Sustainable Development Goal 2 (Zero Hunger), which promotes food security, improved nutrition, and sustainable agriculture.",
      "As part of its community extension and outreach programs, UCU regularly organizes training sessions, seminars, and agricultural fairs that serve as platforms for local farmers to engage with researchers, faculty experts, and student innovators. These events provide opportunities to learn about modern and sustainable farming methods, organic production, pest management, aquaculture practices, and climate-resilient technologies."
    ],
    "documentUrl": "../pdf/sdg2_p23-24.pdf"
  },
  {
    "title": "Urdaneta City University: Supporting Local Sustainability Through Responsible Procurement Practices",
    "image": "../images/sdg2_i2.5.4.png",
    "layout": "right-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goal 2 (Zero Hunger) and its emphasis on promoting sustainable agriculture and resilient food systems, Urdaneta City University (UCU) continues to strengthen its commitment to sustainability by prioritizing the purchase of products from local and sustainable sources. This initiative reflects the university’s dedication to supporting local economies, reducing environmental impact, and promoting ethical consumption across campus operations.",
      "UCU recognizes that sustainable development begins with responsible choices. By sourcing goods and food supplies from local farmers, small-scale producers, and eco-friendly suppliers, the university not only contributes to local livelihood growth but also ensures that its procurement practices help minimize carbon emissions associated with long-distance transport. This approach supports both economic and environmental sustainability within Urdaneta City and nearby communities."
    ],
    "documentUrl": "../pdf/sdg2_p25-26.pdf"
  }
]
