[
  {
    "year": "2024",
    "title": "Kalinga Grand Medical Mission Kalinga sa UCU Grand Medical Mission",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The External Affairs and Linkages Department of Urdaneta City University proudly participated in the \"Kalinga sa UCU Grand Medical Mission\" a large-scale healthcare initiative organized by the Kalinga Partylist. This event was conceived as a response to the persistent need for accessible healthcare services among underserved communities in and around Urdaneta City. The medical mission reflects a shared commitment between the university, government agencies, and civic organizations to uphold public welfare through responsive and inclusive service delivery. Recognizing the university’s integral role in community development, the department saw this initiative as an opportunity to extend its impact beyond academic boundaries and contribute meaningfully to addressing pressing societal issues. The activity formed part of the university’s broader agenda to promote social responsibility, foster institutional partnerships, and reinforce its role as a key stakeholder in public service."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Provide immediate relief to beneficiaries in need of medical attention",
          "Support the successful execution of a community-centered health mission",
          "Demonstrate the practical relevance of the university’s mission to serve the public good",
          "Raise awareness on the importance of preventive healthcare"
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The medical mission contributed significantly to several United Nations Sustainable Development Goals (SDGs). Foremost among these is SDG 3 (Good Health and Well-being), which advocates for ensuring healthy lives and promoting well-being for all at all ages. By offering free consultations, medications, and other essential health services, the mission addressed health inequalities and reduced barriers to medical access for vulnerable sectors. Additionally, the initiative supported SDG 10 (Reduced Inequalities) by reaching out to marginalized populations, thereby promoting inclusivity in healthcare provision. SDG 17 (Partnerships for the Goals) was also central to the event, as the mission was a product of collaboration among government bodies, the academic sector, and civil society—demonstrating how collective action can lead to meaningful and measurable social impact. The event also resonated with the university’s commitment to civic engagement, sustainability, and cross-sector collaboration."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The participation of the External Affairs and Linkages Department in the grand medical mission was highly impactful and widely appreciated. The event was well-organized, drew a significant number of beneficiaries, and successfully provided essential healthcare to those who needed it most. Feedback from both the public and participating partners was overwhelmingly positive, with many commending the professionalism, compassion, and efficiency demonstrated throughout the event. The department’s role was recognized as a vital component in the event’s success, especially in facilitating coordination among multiple entities. Moreover, the activity served as a concrete demonstration of the university’s capacity to lead in community-based initiatives and contribute meaningfully to social development. The department not only fulfilled its logistical duties but also exemplified leadership in community relations, showcasing the value of academic institutions as partners in national and local development efforts."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To build on the momentum of this successful initiative, it is recommended that the External Affairs and Linkages Department institutionalize its involvement in similar outreach missions as part of its regular program of activities. Future events could benefit from the inclusion of more comprehensive services such as dental check-ups, mental health consultations, and health education sessions focused on nutrition, hygiene, and disease prevention. Expanding the scope and reach of these programs to nearby rural areas can help broaden the impact of the university’s outreach efforts. The department should also consider forming a standing committee on community health initiatives, composed of representatives from various university departments and partner organizations, to ensure continuous planning and program development. Furthermore, increasing the involvement of students—particularly those in health sciences, social work, and public administration—can provide valuable experiential learning while reinforcing the university’s role in developing civic-minded graduates. Finally, improved data collection and post-event evaluation mechanisms should be implemented to better measure outcomes, gather community feedback, and guide improvements for future outreach initiatives."
            ]
          }
        ]
      }
    ]
  },
  {
    "year": "2024",
    "title": "MOA Signing of UCU and Pangasinan 2nd Provincial Mobile Force Company",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "Urdaneta City University (UCU) and the Pangasinan 2nd Provincial Mobile Force Company (PMFC) formalized their collaboration through a Memorandum of Agreement (MOA) signing, facilitated by the Office of External Affairs and Linkages. The partnership emerged from ongoing dialogues on enhancing campus safety, community engagement, and proactive peace-building efforts in Urdaneta City and neighboring areas. By institutionalizing shared responsibilities, both parties aim to leverage their respective strengths—UCU’s educational resources and PMFC’s security expertise—to cultivate a safer, more resilient community."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Strengthen institutional cooperation between UCU and the PMFC to support peace, order, and public safety on and off campus.",
          "Establish clear protocols for joint community-oriented programs such as safety awareness seminars, emergency preparedness drills, and youth outreach initiatives.",
          "Provide learning opportunities for students—especially those in criminology and social sciences—through internships, lectures, and field activities with PMFC personnel.",
          "Foster mutual trust and open communication channels between the university community and law-enforcement officers."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The MOA directly advances SDG 4 (Quality Education) by integrating practical, community-based security learning into the curriculum; SDG 16 (Peace, Justice, and Strong Institutions) by promoting peaceful, inclusive environments and strengthening local institutions through collaboration; and SDG 17 (Partnerships for the Goals) by formalizing a multi-stakeholder partnership that aligns educational and security objectives for community benefit."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The event was executed smoothly and achieved its primary aim of formalizing the partnership. Stakeholders expressed strong commitment, and immediate next steps—such as forming a joint working committee and scheduling initial safety seminars—were agreed upon. The presence of students and local officials underscored community buy-in, while the clear delineation of roles in the MOA sets a solid foundation for sustained collaboration."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To ensure the success and sustainability of the partnership between Urdaneta City University and the Pangasinan 2nd Provincial Mobile Force Company, it is recommended to convene the joint working committee within one month to finalize activity timelines and define specific roles and responsibilities. Monitoring the impact of the collaboration is also essential; this can be achieved by developing simple metrics such as incident reports, seminar attendance, and student feedback to evaluate effectiveness and inform continuous improvement. Broadening participation across the university is encouraged by involving student organizations and various academic departments to integrate safety and peace-building themes into both curricular and co-curricular programs. Communicating the success of joint initiatives through campus media and local press will help build public trust, promote transparency, and inspire broader community support. Lastly, seeking complementary partners—such as local NGOs or health agencies—can expand the scope of the collaboration to include mental health support, disaster preparedness, and other community resilience efforts, thereby amplifying the overall impact of the MOA."
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Healing Beyond Classrooms",
    "image": "../images/sdg3_i3.3.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to live by its mission of serving not only through education, but also through compassion and community care. Beyond the lecture halls and laboratories, the university reaches out to the people it serves, turning knowledge into action through its partnerships with local and national health institutions.",
      "In October 2024, UCU, in collaboration with the KALINGA Partylist, organized a Grand Medical Mission that brought free healthcare services to its campus. Students, faculty, and staff, along with their families, received medical consultations, dental and optical check-ups, laboratory diagnostics, and wellness services. For a day, the university became a haven of healing—proof that learning and service can thrive side by side."
    ],
    "documentUrl": "../pdf/sdg3_p2.pdf"
  },
  {
    "title": "Nurturing Wellness, Building Communities",
    "image": "../images/sdg3_i3.3.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) stands firm in its commitment to public service, extending its mission of education beyond classroom walls through various outreach and community development programs. With the guidance of the Center for Community Development and Extension Services (CCDES), the university ensures that its values of compassion and service reach the grassroots level—where real change begins.",
      "Over the years, UCU has organized numerous initiatives centered on health, hygiene, nutrition, and overall well-being. Through medical and dental missions, feeding programs, blood donation drives, and community-based health education campaigns, the university actively contributes to improving the quality of life in nearby communities. Students from the College of Health Sciences, College of Education, and other departments also participate in volunteering programs that encourage leadership, empathy, and a sense of social responsibility."
    ],
    "documentUrl": "../pdf/sdg3_p3.pdf"
  },
  {
    "title": "Urdaneta City University Promotes Health and Well-Being Through “Panagtaripatto Kadagiti Agtutubo” Project",
    "image": "../images/sdg3_i3.3.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU), through the College of Health Sciences (CHS), continues to demonstrate its unwavering commitment to promoting health and well-being in support of the United Nations Sustainable Development Goal (SDG) 3: Good Health and Well-Being.",
      "As part of its ongoing extension initiatives, the college conducted the “Panagtaripatto Kadagiti Agtutubo” Project (PTO) — a meaningful learning activity designed to educate and empower young people on the vital aspects of physical, mental, and social wellness. The activity was led by Mdm. Alyssa Ashley Diego, Acting Dean of the College of Health Sciences, together with Mr. Roniel Aquino, Extension Coordinator, and other dedicated faculty members and nursing students."
    ],
    "documentUrl": "../pdf/sdg3_p4.pdf"
  },
  {
    "title": "Playing Together: UCU’s Role in Community Sport and Wellness",
    "image": "../images/sdg3_i3.3.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) believes that education and wellness go hand in hand. Beyond classrooms and lectures, the university promotes a culture of fitness and teamwork through its sports programs and well-maintained athletic facilities.",
      "Inside the UCU Gymnasium, students gather for annual sports festivals and friendly competitions that build camaraderie and school spirit. Events such as Sports Fest 2023 showcased games in basketball, volleyball, track, badminton, and taekwondo—turning the campus into a lively space that celebrates health, discipline, and unity."
    ],
    "documentUrl": "../pdf/sdg3_p5.pdf"
  },
  {
    "title": "Nurturing Wellness, Building Communities",
    "image": "../images/sdg3_i3.3.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) stands firm in its commitment to public service, extending its mission of education beyond classroom walls through various outreach and community development programs. Guided by the Center for Community Development and Extension Services (CCDES), the university ensures that its values of compassion and service reach the grassroots level—where real change begins.",
      "Over the years, UCU has organized numerous initiatives centered on health, hygiene, nutrition, and overall well-being. Through medical and dental missions, feeding programs, blood donation drives, and community-based health education campaigns, the university actively contributes to improving the quality of life in nearby communities. Students from the College of Health Sciences, College of Education, and other departments also participate in volunteering programs that encourage leadership, empathy, and a sense of social responsibility."
    ],
    "documentUrl": "../pdf/sdg3_p6.pdf"
  },
  {
    "title": "Minds in Focus, Hearts in Care",
    "image": "../images/sdg3_i3.3.6.png",
    "layout": "left-img",
    "content": [
      "At Urdaneta City University (UCU), education extends beyond academics—it also embraces the emotional and psychological well-being of its students. Through its Psychological Assessment and Counseling Center under the Office of Student Affairs, the university ensures that every student has access to professional mental health support and guidance.",
      "The center provides confidential counseling services, psychological assessments, and wellness programs designed to help students manage stress, anxiety, and other challenges that affect their personal and academic lives. Licensed counselors and trained faculty members are always ready to listen, offering a safe and supportive space where students can express themselves freely."
    ],
    "documentUrl": "../pdf/sdg3_p7.pdf"
  },
  {
    "title": "A Breath of Change: UCU Upholds a Smoke-Free Campus",
    "image": "../images/sdg3_i3.3.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to set an example of responsible and healthy living through the strict implementation of its smoke-free policy. In line with its mission to foster a safe and health-conscious academic environment, the university prohibits smoking in all its premises, ensuring that students, faculty, and visitors enjoy a clean and breathable atmosphere conducive to learning.",
      "The policy, clearly stated in the UCU Student Handbook, reflects the institution’s strong commitment to promoting good health and discipline among its community members. By banning smoking within campus grounds, UCU not only protects non-smokers from the harmful effects of secondhand smoke but also encourages smokers to adopt healthier lifestyles."
    ],
    "documentUrl": "../pdf/sdg3_p8.pdf"
  },
  {
    "title": "No Smoking Policy for Urdaneta City University (UCU)",
    "image": "../images/sdg3_i3.3.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) is committed to fostering a healthy, safe, and sustainable learning environment for all students, faculty, staff, and visitors. To protect the well-being of the university community and promote a cleaner, smoke-free campus, UCU strictly enforces its No Smoking Policy across all university premises. This includes all indoor and outdoor areas such as classrooms, laboratories, cafeterias, walkways, parking lots, and university-owned vehicles. Smoking of any kind—including cigarettes, cigars, pipes, e-cigarettes, and vaping devices—is prohibited in all of these spaces. The university will ensure the visibility of 'No Smoking' signage throughout the campus as a reminder of its collective commitment to health and safety.",
      "Campus Security and authorized personnel are responsible for enforcing this policy, with violations subject to progressive disciplinary measures. Offenders will first receive a verbal warning, followed by a written notice and required participation in smoking cessation programs for subsequent infractions. Repeated violations may lead to more serious actions, including fines or suspension. To support individuals who wish to quit smoking, UCU provides access to cessation resources, counseling, and referral services through its Health Services. This policy, effective July 1, 2024, reflects UCU’s dedication to ensuring a safe, clean, and inclusive campus—encouraging all members of the community to work together toward a healthier, smoke-free environment."
    ],
    "documentUrl": "../pdf/sdg3_p9.pdf"
  },
  {
    "title": "Strength in Mind: UCU Champions Mental Wellness for Its Workforce",
    "image": "../images/sdg3_i3.3.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to prove that caring for people goes beyond the classroom. Through its mental health support initiatives, the university ensures that both teaching and non-teaching personnel receive the emotional and psychological care they deserve.",
      "Recognizing the growing need for workplace wellness, UCU has organized several programs dedicated to strengthening mental resilience among its staff. Seminars such as “Activating the Infinite Potentials in Mental Health towards Ethical Leadership” and “Coping Mechanisms for Well-Being” were conducted to provide employees with practical tools for managing stress, maintaining balance, and nurturing a positive mindset."
    ],
    "documentUrl": "../pdf/sdg3_p10.pdf"
  }
]
