[
  {
    "title": "Healing Beyond Classrooms",
    "image": "../images/sdg3_i3.3.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to live by its mission of serving not only through education, but also through compassion and community care. Beyond the lecture halls and laboratories, the university reaches out to the people it serves, turning knowledge into action through its partnerships with local and national health institutions.",
      "In October 2024, UCU, in collaboration with the KALINGA Partylist, organized a Grand Medical Mission that brought free healthcare services to its campus. Students, faculty, and staff, along with their families, received medical consultations, dental and optical check-ups, laboratory diagnostics, and wellness services. For a day, the university became a haven of healing—proof that learning and service can thrive side by side."
    ],
    "documentUrl": "../pdf/sdg3_p2.pdf"
  },
  {
    "title": "Nurturing Wellness, Building Communities",
    "image": "../images/sdg3_i3.3.2.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) stands firm in its commitment to public service, extending its mission of education beyond classroom walls through various outreach and community development programs. With the guidance of the Center for Community Development and Extension Services (CCDES), the university ensures that its values of compassion and service reach the grassroots level—where real change begins.",
      "Over the years, UCU has organized numerous initiatives centered on health, hygiene, nutrition, and overall well-being. Through medical and dental missions, feeding programs, blood donation drives, and community-based health education campaigns, the university actively contributes to improving the quality of life in nearby communities. Students from the College of Health Sciences, College of Education, and other departments also participate in volunteering programs that encourage leadership, empathy, and a sense of social responsibility."
    ],
    "documentUrl": "../pdf/sdg3_p3.pdf"
  },
  {
    "title": "Urdaneta City University Promotes Health and Well-Being Through “Panagtaripatto Kadagiti Agtutubo” Project",
    "image": "../images/sdg3_i3.3.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU), through the College of Health Sciences (CHS), continues to demonstrate its unwavering commitment to promoting health and well-being in support of the United Nations Sustainable Development Goal (SDG) 3: Good Health and Well-Being.",
      "As part of its ongoing extension initiatives, the college conducted the “Panagtaripatto Kadagiti Agtutubo” Project (PTO) — a meaningful learning activity designed to educate and empower young people on the vital aspects of physical, mental, and social wellness. The activity was led by Mdm. Alyssa Ashley Diego, Acting Dean of the College of Health Sciences, together with Mr. Roniel Aquino, Extension Coordinator, and other dedicated faculty members and nursing students."
    ],
    "documentUrl": "../pdf/sdg3_p4.pdf"
  },
  {
    "title": "Playing Together: UCU’s Role in Community Sport and Wellness",
    "image": "../images/sdg3_i3.3.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) believes that education and wellness go hand in hand. Beyond classrooms and lectures, the university promotes a culture of fitness and teamwork through its sports programs and well-maintained athletic facilities.",
      "Inside the UCU Gymnasium, students gather for annual sports festivals and friendly competitions that build camaraderie and school spirit. Events such as Sports Fest 2023 showcased games in basketball, volleyball, track, badminton, and taekwondo—turning the campus into a lively space that celebrates health, discipline, and unity."
    ],
    "documentUrl": "../pdf/sdg3_p5.pdf"
  },
  {
    "title": "Nurturing Wellness, Building Communities",
    "image": "../images/sdg3_i3.3.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) stands firm in its commitment to public service, extending its mission of education beyond classroom walls through various outreach and community development programs. Guided by the Center for Community Development and Extension Services (CCDES), the university ensures that its values of compassion and service reach the grassroots level—where real change begins.",
      "Over the years, UCU has organized numerous initiatives centered on health, hygiene, nutrition, and overall well-being. Through medical and dental missions, feeding programs, blood donation drives, and community-based health education campaigns, the university actively contributes to improving the quality of life in nearby communities. Students from the College of Health Sciences, College of Education, and other departments also participate in volunteering programs that encourage leadership, empathy, and a sense of social responsibility."
    ],
    "documentUrl": "../pdf/sdg3_p6.pdf"
  },
  {
    "title": "Minds in Focus, Hearts in Care",
    "image": "../images/sdg3_i3.3.6.png",
    "layout": "left-img",
    "content": [
      "At Urdaneta City University (UCU), education extends beyond academics—it also embraces the emotional and psychological well-being of its students. Through its Psychological Assessment and Counseling Center under the Office of Student Affairs, the university ensures that every student has access to professional mental health support and guidance.",
      "The center provides confidential counseling services, psychological assessments, and wellness programs designed to help students manage stress, anxiety, and other challenges that affect their personal and academic lives. Licensed counselors and trained faculty members are always ready to listen, offering a safe and supportive space where students can express themselves freely."
    ],
    "documentUrl": "../pdf/sdg3_p7.pdf"
  },
  {
    "title": "A Breath of Change: UCU Upholds a Smoke-Free Campus",
    "image": "../images/sdg3_i3.3.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to set an example of responsible and healthy living through the strict implementation of its smoke-free policy. In line with its mission to foster a safe and health-conscious academic environment, the university prohibits smoking in all its premises, ensuring that students, faculty, and visitors enjoy a clean and breathable atmosphere conducive to learning.",
      "The policy, clearly stated in the UCU Student Handbook, reflects the institution’s strong commitment to promoting good health and discipline among its community members. By banning smoking within campus grounds, UCU not only protects non-smokers from the harmful effects of secondhand smoke but also encourages smokers to adopt healthier lifestyles."
    ],
    "documentUrl": "../pdf/sdg3_p8.pdf"
  },
  {
    "title": "No Smoking Policy for Urdaneta City University (UCU)",
    "image": "../images/sdg3_i3.3.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) is committed to fostering a healthy, safe, and sustainable learning environment for all students, faculty, staff, and visitors. To protect the well-being of the university community and promote a cleaner, smoke-free campus, UCU strictly enforces its No Smoking Policy across all university premises. This includes all indoor and outdoor areas such as classrooms, laboratories, cafeterias, walkways, parking lots, and university-owned vehicles. Smoking of any kind—including cigarettes, cigars, pipes, e-cigarettes, and vaping devices—is prohibited in all of these spaces. The university will ensure the visibility of 'No Smoking' signage throughout the campus as a reminder of its collective commitment to health and safety.",
      "Campus Security and authorized personnel are responsible for enforcing this policy, with violations subject to progressive disciplinary measures. Offenders will first receive a verbal warning, followed by a written notice and required participation in smoking cessation programs for subsequent infractions. Repeated violations may lead to more serious actions, including fines or suspension. To support individuals who wish to quit smoking, UCU provides access to cessation resources, counseling, and referral services through its Health Services. This policy, effective July 1, 2024, reflects UCU’s dedication to ensuring a safe, clean, and inclusive campus—encouraging all members of the community to work together toward a healthier, smoke-free environment."
    ],
    "documentUrl": "../pdf/sdg3_p9.pdf"
  },
  {
    "title": "Strength in Mind: UCU Champions Mental Wellness for Its Workforce",
    "image": "../images/sdg3_i3.3.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to prove that caring for people goes beyond the classroom. Through its mental health support initiatives, the university ensures that both teaching and non-teaching personnel receive the emotional and psychological care they deserve.",
      "Recognizing the growing need for workplace wellness, UCU has organized several programs dedicated to strengthening mental resilience among its staff. Seminars such as “Activating the Infinite Potentials in Mental Health towards Ethical Leadership” and “Coping Mechanisms for Well-Being” were conducted to provide employees with practical tools for managing stress, maintaining balance, and nurturing a positive mindset."
    ],
    "documentUrl": "../pdf/sdg3_p10.pdf"
  }
]
