[
  {
    "year": "2023",
    "title": "UCU-COP Hosts Red Cross, Apothec students participates in bloodletting",
    "image": "../images/sdg3p1.png",
    "layout": "right-img",
    "content": [
      "In observance of Blood Disease Month, the Apothecary Society of the UCU-College of Pharmacy participated in a bloodletting activity in collaboration with the Philippine Red Cross on September 14, 2023 held at the UCU Mock Hospital. Exemplifying the Apothecary Society's dedication to the community's well-being, the principles of 5 A's: Ask, Assist, Assess, Acquire and Achieve were instilled to the participants while in action, as a guiding measure for the endeavor's impact and success.",
      "The bloodletting activity not only celebrated the spirit of giving but also highlighted Pharmacy students’ commitment to healthcare and betterment of the community. As future Pharmacists, their initiatives echoed the Apothecary Society’s pledge to continue making a difference in the lives of their countrymen."
    ],
    "documentUrl": "../pdf/ucu-cop-hosts-red-cross.pdf"
  },
  {
    "year": "2023",
    "title": "UCU College of Teacher Education Donates Research-Based Sports Equipment to Public Schools in Pangasinan",
    "image": "../images/sdg3p2.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Philippines — In a meaningful initiative aimed at enhancing physical education in local schools, the College of Teacher Education at Urdaneta City University (UCU) has donated researchbased sports equipment to various public schools across Pangasinan. Developed by UCU students as part of their research projects, the equipment aims to support sports programs in underserved communities, promoting fitness, teamwork, and skill development among students.",
      "The donation is part of UCU’s broader commitment to applying research for community development, showcasing how student-led projects can directly benefit society. The College of Teacher Education collaborated with its students to design and create sports equipment tailored to the needs of local schools, aligning with their research findings on accessible, practical, and safe sports gear for young athletes."
    ],
    "documentUrl": "../pdf/ucu-cte-donates-sports-equipment.pdf"
  },
  {
    "year": "2023",
    "title": "UCU Midwifery Program Champions Gender and Society Class on Sexual and Reproductive Health-Care Services",
    "image": "../images/sdg3p3.png",
    "layout": "right-img",
    "content": [
      "In a progressive step towards inclusive and comprehensive education on sexual and reproductive health, the Midwifery Program of Urdaneta City University (UCU) has introduced a dynamic course on Gender and Society that equips students with essential knowledge on gender equality, sexual health, and reproductive rights. This initiative, a first of its kind in the region, seeks to empower future midwives with skills and insights to provide more empathetic and informed health care to diverse communities.",
      "The course covers a wide array of critical topics, including family planning, maternal health, sexually transmitted infections (STIs), and the importance of accessible reproductive health services. The UCU Midwifery Program recognizes that midwives often serve as the primary touchpoint for reproductive health in many communities, making it essential for students to have a nuanced understanding of gender sensitivities and patient-centered care."
    ],
    "documentUrl": "../pdf/ucu-midwifery-program.pdf"
  },
  {
    "year": "2023",
    "title": "DO YOU NEED SOMEONE TO TALK TO? WE ARE HERE TO LISTEN",
    "image": "../images/sdg3p4.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) launched a comprehensive mental health support program aimed at providing essential resources and assistance to both students and staff members. The initiative comes as part of the university’s ongoing efforts to address the growing importance of mental well-being within academic environments. UCU’s administration highlighted the significance of supporting mental health amidst the pressures of academic life, work-related stress, and societal challenges. As part of the initiative, the university have licensed counselors and mental health professionals to ensure that students and employees receive the care and attention they need.",
      "The program emphasizes confidentiality and accessibility. Students and staff can schedule private sessions with professional counselors through an easyto-use online platform. UCU has also committed to providing mental health services at no additional cost to students and employees, ensuring that financial barriers do not prevent anyone from seeking help."
    ],
    "documentUrl": "../pdf/ucu-mental-health-support-program.pdf"
  },
  {
    "year": "2023",
    "title": "No Smoking Policy for Urdaneta City University (UCU)",
    "image": "../images/sdg3p5.png",
    "layout": "right-img",
    "content": [
      "The Urdaneta City University (UCU) is committed to promoting a healthy and safe environment for students, faculty, staff, and visitors. This policy establishes a smoke-free environment across all university premises to enhance the quality of campus life and support the health and well-being of the entire UCU community.",
      "Urdaneta City University is dedicated to creating a smoke-free campus to protect the health and safety of all members of its community. We encourage everyone to respect and adhere to this policy and to work together toward a cleaner, healthier, and safer environment for all."
    ],
    "documentUrl": "../pdf/ucu-no-smoking-policy.pdf"
  },
  {
    "year": "2023",
    "title": "UCU OUTREACHED AND EXTENSION PROGRAMS AND PROJECTS THAT PROMOTES HEALTH AND WELL BEING OF THE COMMUNITY",
    "image": "../images/sdg3p5.png",
    "layout": "right-img",
    "content": [
      "The Urdaneta City University (UCU) is committed to promoting a healthy and safe environment for students, faculty, staff, and visitors. This policy establishes a smoke-free environment across all university premises to enhance the quality of campus life and support the health and well-being of the entire UCU community.",
      "Urdaneta City University is dedicated to creating a smoke-free campus to protect the health and safety of all members of its community. We encourage everyone to respect and adhere to this policy and to work together toward a cleaner, healthier, and safer environment for all."
    ],
    "documentUrl": "../pdf/accomplishment-report-2020.pdf"
  }
]
