[
  {
    "title": "Urdaneta City University Strengthens Commitment to SDG 4 Through Free Access to Learning Resources",
    "image": "../images/sdg4_i4.3.0.png",
    "layout": "right-img",
    "content": [
      "In steadfast pursuit of the United Nations Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) continues to uphold its mission of providing inclusive and equitable access to quality education by offering free and open learning resources to its students. Through initiatives that ensure access to both physical and digital educational materials, UCU empowers learners to reach their fullest potential and promotes a culture of lifelong learning.",
      "At the heart of this commitment is the Orata Library, named in honor of Dr. Pedro T. Orata, a pioneer in Philippine education. The library serves as a cornerstone of academic excellence, providing students, faculty, and researchers with free access to an extensive collection of resources. With over 32,000 volumes of books and more than 2,000 multimedia and e-resources, the library supports diverse disciplines and fosters independent study, critical thinking, and research innovation."
    ],
    "documentUrl": "../pdf/sdg4_p2.pdf"
  },
  {
    "title": "Your Research Hub: Discover Thousands of Books & Multimedia at UCU Orata Library",
    "image": "../images/sdg4_i4.3.1.png",
    "layout": "left-img",
    "content": [
      "Named in honor of Dr. Pedro T. Orata, a visionary in education and an advocate of accessible learning, the Urdaneta City University (UCU) Orata Library stands as a beacon of knowledge and inclusion—serving students, faculty, and members of the wider community alike. With a collection of over 32,000 volumes of books and more than 2,000 multimedia and electronic resources, the Orata Library supports UCU’s unwavering commitment to academic excellence, lifelong learning, and educational inclusivity. It is more than just a repository of books; it is a living center of learning that bridges traditional scholarship and digital innovation.",
      "In alignment with the United Nations Sustainable Development Goal 4 (Quality Education), this initiative extends learning opportunities beyond campus walls, making the library’s vast resources accessible to all students—even those outside the university. Through this open-access approach, UCU strengthens its role as a hub for community engagement, ensuring equal access to quality educational materials for every learner."
    ],
    "documentUrl": "../pdf/sdg4_p3-4.pdf"
  },
  {
    "title": "UCU College of Teacher Education Advances SDG 4 Through Seminar on Empowering the Teaching Profession 4.0",
    "image": "../images/sdg4_i4.3.2.png",
    "layout": "right-img",
    "content": [
      "In support of the United Nations Sustainable Development Goal 4 (Quality Education) and Urdaneta City University’s mission to uphold academic excellence, the College of Teacher Education (CTE) successfully conducted a seminar themed “Empowering Education Through the Teaching Profession 4.0: Elevating Excellence in a Gender-Responsive Environment.”. The program, open to all interested faculty members and students, aimed to strengthen the University’s pursuit of high-quality, inclusive, and equitable education by equipping current and future educators with the skills and insights needed in the rapidly evolving educational landscape.",
      "Renowned educator Dr. Brenda B. Corpuz, President of the Philippine Association for Teachers and Educators (PAFTE), served as the keynote speaker. Her inspiring address shed light on the transformative power of technology, gender responsiveness, and innovative teaching strategies in shaping 21st-century learning. This collaborative effort, led by CTE Dean Dr. Ryan Jayson Delos Reyes and the dedicated faculty members, exemplified UCU’s commitment to providing continuous professional development opportunities that align with both institutional and global education goals."
    ],
    "documentUrl": "../pdf/sdg4_p5.pdf"
  },
  {
    "title": "Prevent Teenage Pregnancy: Empowering Youth for Tomorrow",
    "image": "../images/sdg4_i4.3.3.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines – Urdaneta City University (UCU) recently hosted a successful webinar titled \"PREVENT TEEN PREGNANCY: Empowering Youth for Tomorrow.\" The event, which took place on October 3, 2024, aimed to raise awareness about the challenges and consequences of teen pregnancy and to empower young people to make informed choices. The webinar featured insightful talks and interactive discussions led by Dr. Niño Edem Listones, the esteemed Founding President of the NLRC Review Center and a seasoned Professional Lecturer from Far Eastern University.",
      "Dr. Listones provided valuable information on the physical, emotional, and social impacts of teen pregnancy, emphasizing the importance of responsible decision-making. By engaging with the youth through this virtual platform, UCU sought to create a safe and supportive space for open dialogue and knowledge-sharing. The webinar encouraged participants to prioritize their education, career goals, and overall well-being. Through initiatives like this, UCU continues to play a vital role in the holistic development of its students and the broader community, empowering young people to build a brighter future."
    ],
    "documentUrl": "../pdf/sdg4_p6.pdf"
  },
  {
    "title": "Urdaneta City University Extends Learning Beyond Campus in Support of UN SDG 4",
    "image": "../images/sdg4_i4.4.4.png",
    "layout": "right-img",
    "content": [
      "True to its mission of promoting inclusive and equitable quality education, Urdaneta City University (UCU) continues to advance the United Nations Sustainable Development Goal 4 (SDG 4) through its community outreach initiatives and lecture programs conducted beyond campus walls.",
      "Recognizing that education should not be confined within the university setting, UCU actively reaches out to local schools and communities, bringing valuable lectures, seminars, and training sessions directly to learners where they are. These initiatives aim to foster lifelong learning opportunities, strengthen community engagement, and ensure that quality education remains accessible to all—especially those with limited access to formal learning institutions."
    ],
    "documentUrl": "../pdf/sdg4_p7-8.pdf"
  },

  {
    "title": "“Panagtaripatto Kadagiti Agtutubo” PTO Program: UCU’s Commitment to SDG 4 Through Service Learning and Community Education",
    "image": "../images/sdg4_i4.4.5.png",
    "layout": "left-img",
    "content": [
      "The “Panagtaripatto Kadagiti Agtutubo” PTO Program is a transformative service-learning initiative of Urdaneta City University (UCU) that connects the youth with meaningful community engagement while fostering their personal growth, character development, and career readiness.",
      "Derived from the Ilocano words “Panagtaripatto” meaning “to take care or value” and “Agtutubo” meaning “the youth,” the program reflects UCU’s mission to nurture and value young individuals by enhancing their skills, potential, and sense of civic purpose.",
      "Through this initiative, students from various UCU colleges extend their learning beyond the classroom by sharing their knowledge, talents, and expertise with PTO beneficiaries and community members. In return, they gain hands-on experience that strengthens their leadership, empathy, and professional competencies—traits essential for lifelong learning and success in their future careers."
    ],
    "documentUrl": "../pdf/sdg4_p9-10.pdf"
  },
  {
    "title": "Panagtaripatto Kadagiti Agtutubo Project (PTO) Year 2 Second Session of the Learning Activity Provided by College of Hospitality and Tourism Management",
    "image": "../images/sdg4_i4.4.6.png",
    "layout": "right-img",
    "content": [
      "As part of Urdaneta City University’s (UCU) continuing commitment to support the United Nations Sustainable Development Goal (SDG) 4: Quality Education, the Panagtaripatto Kadagiti Agtutubo (PTO) Project successfully conducted a community-based learning activity at Cabaruan National High School, Urdaneta City, in collaboration with the College of Hospitality and Tourism Management (CHTM).",
      "The event featured a series of public demonstrations and educational sessions designed to enhance the students’ knowledge of the hospitality and tourism industry while inspiring them to explore future career opportunities in these dynamic fields. Junior and Senior High School students actively participated in live demonstrations on Flambé Making, Mocktail Preparation, and Tour Guiding, led by CHTM students who shared both technical skills and industry insights."
    ],
    "documentUrl": "../pdf/sdg4_p11-12.pdf"
  },
  {
    "title": "PTO 2: CITE Leads Technological Empowerment for Youth Through Community Learning",
    "image": "../images/sdg4_i4.4.7.png",
    "layout": "left-img",
    "content": [
      "The Panagtaripatto Kadagiti Agtutubo (PTO) 2 learning activity, administered by the College of Information Technology Education (CITE) of Urdaneta City University (UCU), was held at Cabaruan National High School under the theme “Leadership TechQuest: Journey of Technological Empowerment for Youth.” This two-day community learning event culminated on Friday, April 26, 2024, and aimed to promote digital literacy, innovation, and leadership among junior and senior high school students.",
      "The first session featured a lecture on the History of Information Technology delivered by Mr. Elmer Carreon, CITE faculty member, which explored the evolution and growing influence of technology in education and society. This was followed by a presentation on Multimedia Technology by Ms. Shiela Marie Gonzaga, who showcased creative demo outputs from UCU Information Technology students to demonstrate the power of digital tools in communication and design."
    ],
    "documentUrl": "../pdf/sdg4_p13.pdf"
  },

  {
    "title": "PTO 2: College of Health Sciences Champions Youth Wellness Through Community Education",
    "image": "../images/sdg4_i4.4.8.png",
    "layout": "right-img",
    "content": [
      "The Panagtaripatto Kadagiti Agtutubo (PTO) 2 learning activity was conducted by the College of Health Sciences (CHS) of Urdaneta City University (UCU), led by Ms. Alyssa Ashley Diego, Acting Dean, and Mr. Roniel Aquino, Extension Coordinator, together with CHS faculty and Nursing students. With the theme “Physical Changes: A Pubertal Tour Towards Mental and Social Wellness,” the session was designed to equip Grade 11 and 12 students with essential knowledge about the physical, emotional, and social transitions of adolescence.",
      "Through interactive lectures and open discussions, Nursing student speakers, under the supervision of CHS faculty, tackled important topics such as self-awareness, mental health, and positive social interactions. The activity not only guided the youth in understanding and managing the challenges of puberty but also promoted holistic wellness—encouraging confidence, empathy, and resilience."
    ],
    "documentUrl": "../pdf/sdg4_p14.pdf"
  },
  {
    "title": "CITE Empowers Youth Through Technology Education and Community Learning",
    "image": "../images/sdg4_i4.4.9.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Pangasinan — October 10, 2024. The College of Information Technology Education (CITE) of Urdaneta City University (UCU) conducted a public lecture and skills demonstration at Don Alipio Fernandez Sr. Integrated School, showcasing technological creativity and innovation as part of the university’s continuing effort to extend quality education beyond the campus. This community learning activity supports the United Nations Sustainable Development Goal (SDG) 4: Quality Education, which promotes inclusive and equitable learning opportunities for all.",
      "During the session, CITE faculty and students presented demonstrations on various computer applications and introduced participants to basic hologram creation using mobile devices. The event encouraged students to explore the creative and practical use of technology even with limited resources, highlighting that innovation thrives where curiosity and determination meet."
    ],
    "documentUrl": "../pdf/sdg4_p15-16.pdf"
  },
  {
    "title": "BLISE Promotes Library Science Awareness Through Community Education",
    "image": "../images/sdg4_i5.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Pangasinan — October 17, 2024. The College of Information Technology Education – Bachelor of Library and Information Science Education (BLISE) program of Urdaneta City University (UCU), in partnership with the Dr. Pedro T. Orata Library, conducted an orientation and public lecture at Don Alipio Fernandez Sr. Integrated School as part of the university’s continuing effort to deliver community educational events in support of the United Nations Sustainable Development Goal (SDG) 4: Quality Education.",
      "The activity aimed to introduce the Library and Information Science Education (LIS) program to senior high school students, many of whom were unfamiliar with the vital role of librarians in education and information management. The session sought to raise awareness about the importance of the librarian profession in today’s knowledge-driven world—highlighting how librarians serve as information specialists who guide learners in accessing, evaluating, and utilizing information effectively."
    ],
    "documentUrl": "../pdf/sdg4_p17-18.pdf"
  },
  {
    "title": "CHTM Promotes Quality Education Through Skills Demonstration at Don Alipio Fernandez Sr. Integrated School",
    "image": "../images/sdg4_i5.2.png",
    "layout": "left-img",
    "content": [
      "November 29, 2024 — In support of Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU), through its College of Hospitality and Tourism Management (CHTM), conducted a Skills Demonstration Program at Don Alipio Fernandez Sr. Integrated School. This initiative reflects the university’s commitment to providing inclusive and equitable quality education through public lectures and community educational events.",
      "The activity featured live demonstrations in flower arrangement, table setting, bartending, pasta making, table skirting, and table napkin folding, allowing CHTM students to showcase their knowledge, creativity, and technical expertise. These hands-on presentations aimed to engage and inspire high school students by introducing them to the diverse opportunities within the hospitality and tourism industry."
    ],
    "documentUrl": "../pdf/sdg4_p19.pdf"
  },
  {
    "title": "College of Engineering and Architecture Advances SDG 4 Through Community Educational Showcase",
    "image": "../images/sdg4_i5.3.png",
    "layout": "right-img",
    "content": [
      "January 23, 2025 — In line with Urdaneta City University’s (UCU) commitment to support Sustainable Development Goal 4 (Quality Education), the College of Engineering and Architecture (CEA) conducted an engaging community educational presentation that highlighted the college’s dedication to promoting inclusive and quality learning through public lectures and interactive demonstrations.",
      "The event was led by Arch. Albert Pascua, the college’s Extension Coordinator, together with faculty members and officers of the student organization. During the session, Arch. Pascua shared valuable insights about the academic programs offered by the college and the promising career opportunities available to its graduates in the fields of engineering and architecture."
    ],
    "documentUrl": "../pdf/sdg4_p20.pdf"
  },
  {
    "title": "NSTP Promotes Values Education and Lifelong Learning at P.T. Orata National High School",
    "image": "../images/sdg4_i5.4.png",
    "layout": "left-img",
    "content": [
      "In support of Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) continues to bring learning beyond the classroom through community-based educational activities. On this occasion, Pastor Christopher Ian O. Bulac, NSTP Faculty, together with two student organization officers, served as resource speakers during the learning activity sessions for Grades 11 and 12 beneficiaries of P.T. Orata National High School.",
      "Guided by Pastor Bulac, the NSTP students shared meaningful reflections on valuing the precious life that God has given, emphasizing the importance of nurturing life, showing compassion, and expressing love toward others. The discussion encouraged participants to develop emotional intelligence and moral sensitivity—key aspects of holistic education that go beyond academics."
    ],
    "documentUrl": "../pdf/sdg4_p21.pdf"
  },
  {
    "title": "Urdaneta City University Advances UN Sustainable Development Goal 4 Through Inclusive Educational and Community Programs",
    "image": "../images/sdg4_i5.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to champion the principles of United Nations Sustainable Development Goal 4 (Quality Education) by ensuring that learning opportunities are accessible to all. Through a wide range of public lectures, community-based learning initiatives, and extension programs, UCU reinforces its commitment to providing inclusive, equitable, and quality education beyond the walls of the classroom.",
      "These initiatives, led by the University’s dedicated extension and outreach programs, reflect UCU’s mission to make knowledge a shared public resource. By hosting educational and community events that are open to the public, the University invites learners, professionals, and local residents to engage in meaningful discussions on pressing issues such as sustainable development, health education, local governance, and cultural awareness."
    ],
    "documentUrl": "../pdf/sdg4_p22.pdf"
  },
  {
    "title": "Urdaneta City University Promotes Quality Education Through School-Based Seminar on Drug Abuse Prevention",
    "image": "../images/sdg4_i5.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Pangasinan — Demonstrating its strong commitment to Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) successfully conducted a School-Based Seminar on Drug Abuse Prevention on February 16, 2024, at the UCU Gymnasium. The activity was organized by the Center for Training and Professional Development (CTPD) and supported by the university administration under the leadership of Dr. Amihan April Mella-Alcazar, Acting University President.",
      "The seminar was specifically designed for students from the College of Criminal Justice Education (CCJE) and the College of Teacher Education (CTE) to raise awareness about the dangers of drug use and to promote informed, responsible decision-making. It aimed to help students develop positive values and attitudes that contribute to their overall well-being and success in their chosen fields. Recognizing that education goes beyond academics, UCU made the seminar interactive and student-centered, encouraging open communication and active participation. By integrating drug prevention education within the university’s learning environment, UCU continues to foster holistic student development—empowering learners to make sound choices, uphold healthy lifestyles, and become advocates of a drug-free community."
    ],
    "documentUrl": "../pdf/sdg4_p23-24.pdf"
  },
  {
    "title": "Urdaneta City University Champions Quality Education Through “Empowering Excellence: A Personnel Development Journey”",
    "image": "../images/sdg4_i5.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) once again reaffirms its strong commitment to Sustainable Development Goal 4 (Quality Education) through the launch of its seminar-workshop titled “Empowering Excellence: A Personnel Development Journey.” This initiative underscores UCU’s dedication to fostering continuous learning, professional growth, and institutional excellence among its workforce. The training seminar is designed to cultivate a culture of lifelong learning and innovation within the university community. It aims to equip employees with the necessary skills and knowledge to adapt to evolving educational and professional challenges.",
      "By investing in personnel development, UCU not only strengthens its human resource capabilities but also enhances employee engagement, satisfaction, and retention—key drivers of organizational success and sustainability. Through this activity, participants are expected to enhance their abilities, demonstrate leadership, and apply new knowledge in their respective roles. The program encourages mentoring, career path navigation, and active participation in professional growth initiatives. It also emphasizes personal effectiveness and motivation, enabling participants to harness professional networks, adapt to changes in education, and contribute meaningfully to institutional excellence."
    ],
    "documentUrl": "../pdf/sdg4_p25.pdf"
  },
  {
    "title": "Urdaneta City University Fosters Quality Education Through Communication Seminar for Security and Office Staff",
    "image": "../images/sdg4_i5.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its commitment to Sustainable Development Goal 4 (Quality Education) by launching the seminar titled “Building a Culture of Effective and Responsive Communication for Security and Office Staff.” This initiative highlights UCU’s dedication to providing continuous learning opportunities that empower all members of its workforce—ensuring that education and professional development extend beyond the classroom and into every department of the institution.",
      "The seminar focuses on enhancing the communication skills of security and office personnel, recognizing their crucial role in maintaining the university’s daily operations and safety. By developing competencies such as active listening, conflict resolution, and clear messaging, the program aims to improve coordination, reduce misunderstandings, and strengthen teamwork, especially in high-pressure or crisis situations. This proactive approach not only enhances efficiency but also promotes a culture of openness, trust, and collaboration within the university community."
    ],
    "documentUrl": "../pdf/sdg4_p26.pdf"
  },
  {
    "title": "Urdaneta City University Promotes Quality Education and Good Governance Through “Leading the Public Good” Symposium",
    "image": "../images/sdg4_i5.9.png",
    "layout": "right-img",
    "content": [
      "In line with its commitment to the United Nations Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) launched the symposium “Leading the Public Good: Strategies for Ethical and Equal Governance.” This initiative reflects the university’s mission to cultivate not only academic excellence but also moral integrity, civic responsibility, and social awareness among its students and employees.",
      "The symposium is designed to equip graduating students and university personnel with essential knowledge and values for ethical and inclusive leadership. It underscores the significance of integrity, transparency, and accountability—principles that are vital in fostering good governance and equitable social structures. By engaging participants in discussions about ethical decision-making and fair governance practices, the event prepares future leaders to navigate complex societal and institutional challenges with wisdom and moral strength."
    ],
    "documentUrl": "../pdf/sdg4_p27.pdf"
  },
  {
    "title": "Urdaneta City University Advances Quality Education Through “Nurturing Excellence and Sustaining Transformation” Seminar",
    "image": "../images/sdg4_i5.10.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to uphold its strong commitment to the United Nations Sustainable Development Goal 4 (Quality Education) through the launch of its seminar entitled “Nurturing Excellence and Sustaining Transformation.” This initiative reflects UCU’s dedication to fostering continuous professional growth, leadership development, and organizational transformation—key components in achieving inclusive and lifelong learning for all.",
      "The seminar underscores the university’s belief that employee development is central to institutional excellence. By investing in the growth and well-being of its workforce, UCU promotes a culture of engagement, innovation, and adaptability that strengthens both individual and organizational success. The program emphasizes the importance of cultivating leadership qualities, encouraging creativity, and nurturing resilience among participants to help them thrive in a fast-changing academic and professional landscape."
    ],
    "documentUrl": "../pdf/sdg4_p28.pdf"
  },
  {
    "title": "Urdaneta City University Elevates Quality Education Through “Teaching Excellence and Professionalism for Effective Learning Facilitation” Seminar-Workshop",
    "image": "../images/sdg4_i5.11.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its unwavering commitment to Sustainable Development Goal 4 (Quality Education) through the launch of the seminar-workshop “Teaching Excellence and Professionalism for Effective Learning Facilitation.” This initiative reflects the university’s dedication to ensuring that its educators remain at the forefront of pedagogical innovation, professional ethics, and inclusive teaching practices that enhance the overall quality of learning.",
      "The seminar-workshop is designed to equip UCU instructors with advanced teaching methods and tools to meet the evolving demands of modern education. Recognizing that teachers play a vital role in shaping the future, the program focuses on fostering professional growth, integrity, and adaptability. It encourages educators to continually refine their instructional strategies, integrate technology effectively into their teaching, and uphold the highest standards of ethical and professional conduct."
    ],
    "documentUrl": "../pdf/sdg4_p29.pdf"
  },

  {
    "title": "Urdaneta City University Strengthens Its Commitment to Quality Education Through the 2026–2030 Institutional Development Plan Seminar-Workshop",
    "image": "../images/sdg4_i5.12.png",
    "layout": "left-img",
    "content": [
      "In line with its continuous pursuit of academic excellence and sustainable growth, Urdaneta City University (UCU) has launched the Institutional Development Plan (IDP) Seminar-Workshop for 2026–2030, reaffirming its strong commitment to the United Nations Sustainable Development Goal 4 (Quality Education). This initiative serves as a vital step in shaping the university’s strategic direction as it moves toward realizing its Vision 2030, ensuring that UCU remains a leading institution for inclusive, innovative, and globally competitive education.",
      "The seminar-workshop engaged Deans, Directors, Heads, and Chairs in a collaborative and evidence-based planning process aimed at formulating institutional goals and measurable objectives aligned with UCU’s long-term strategic vision. Through active participation, the university’s academic and administrative leaders worked together to establish a clear, unified roadmap that promotes coherence, accountability, and sustainability in institutional development."
    ],
    "documentUrl": "../pdf/sdg4_p30.pdf"
  },

  {
    "title": "Urdaneta City University Strengthens Leadership and Lifelong Learning Through “Mastering Leadership Dynamics: Strategies for Holistic Management”",
    "image": "../images/sdg4_i5.13.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its steadfast commitment to Sustainable Development Goal 4 (Quality Education) by launching the seminar-workshop titled “Mastering Leadership Dynamics: Strategies for Holistic Management.” This initiative highlights UCU’s dedication to cultivating effective, ethical, and adaptive leadership among its administrators, deans, and office heads—ensuring that the university’s management remains responsive to the evolving demands of higher education.",
      "The seminar underscores that leadership is a dynamic and evolving process, requiring continuous learning, reflection, and adaptation. It focuses on strengthening the leadership capacities of UCU’s key officials by helping them refine their strategic thinking, decision-making, and problem-solving skills. By embracing a holistic approach to management, the activity aims to empower leaders to motivate their teams, boost morale, enhance productivity, and foster collaboration across departments—all in alignment with the university’s Vision, Mission, Goals, and Objectives (VMGO)."
    ],
    "documentUrl": "../pdf/sdg4_p31.pdf"
  },
  {
    "title": "Urdaneta City University Advances Inclusive and Technology-Driven Learning Through Faculty Orientation on Gender Mainstreaming and Education Technology",
    "image": "../images/sdg4_i5.14.png",
    "layout": "left-img",
    "content": [
      "In its continued commitment to Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) launched the “Enhancing Academic Outcomes in Gender Mainstreaming and Education Technology: A Faculty Orientation.” This initiative underscores UCU’s dedication to fostering inclusive, equitable, and technologically empowered education—ensuring that teaching and learning practices evolve alongside the needs of a diverse academic community.",
      "The orientation recognizes that gender mainstreaming and education technology are essential pillars of modern education. By integrating gender-sensitive approaches into pedagogy, curriculum design, and institutional policies, UCU empowers its educators to create learning environments that promote fairness, inclusivity, and equal opportunities for all students. Complementing this is the use of educational technology as a transformative tool—enabling faculty to personalize learning, enhance engagement, and bridge gaps in access to information."
    ],
    "documentUrl": "../pdf/sdg4_p32.pdf"
  },

  {
    "title": "Urdaneta City University Champions Holistic Growth Through Seminar on Stress Management and Gender Equity",
    "image": "../images/sdg4_i5.15.png",
    "layout": "right-img",
    "content": [
      "In a progressive step toward advancing Sustainable Development Goal 4 (Quality Education) and fostering an inclusive academic culture, Urdaneta City University (UCU) launched the seminar “Navigating Stress and Promoting Gender Equity for Holistic Development.” This initiative reflects the university’s steadfast commitment to developing well-rounded leaders and educators who value both personal well-being and institutional inclusivity as key drivers of academic and organizational success.",
      "The seminar emphasized two crucial dimensions of professional and educational development—stress management and gender equity. In an era marked by rapid change and increasing demands, the ability to effectively manage stress is essential not only for maintaining productivity but also for safeguarding the health, morale, and motivation of the university’s workforce. At the same time, promoting gender equity ensures that all members of the institution—regardless of gender—are given equal opportunities to grow, contribute, and lead."
    ],
    "documentUrl": "../pdf/sdg4_p33.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to SDG 4 Through Seminar on Innovative Practices for Gender Equality and Sustainable Development",
    "image": "../images/sdg4_i5.16.png",
    "layout": "left-img",
    "content": [
      "Demonstrating its unwavering dedication to advancing Sustainable Development Goal 4 (Quality Education) and promoting inclusivity in higher education, Urdaneta City University (UCU) launched the seminar titled “Innovative Practices in Higher Education to Promote Gender Equality and Sustainable Development Goals.” This activity brought together College Deans, Program Heads, and Research Coordinators to explore transformative strategies that empower academic leaders to shape a more equitable and sustainable educational landscape.",
      "The seminar underscored the pivotal role of higher education institutions in addressing gender disparities that continue to influence access to education, employment, and leadership opportunities. By equipping participants with evidence-based approaches and practical frameworks, UCU reaffirms its mission to cultivate an academic environment where all individuals—regardless of gender—can thrive and contribute meaningfully to society."
    ],
    "documentUrl": "../pdf/sdg4_p34.pdf"
  },
  {
    "title": "Urdaneta City University Advances SDG 4 Through Seminar on Gender, Communication, and Media Literacy to Prevent Hate Speech",
    "image": "../images/sdg4_i5.17.png",
    "layout": "right-img",
    "content": [
      "In line with its steadfast commitment to Sustainable Development Goal 4 (Quality Education) and its advocacy for an inclusive and equitable learning environment, Urdaneta City University (UCU) launched the seminar titled “Intersection of Gender and Communication: The Role of Media Literacy in Preventing Hate Speech.” The initiative was designed specifically for the university’s administrative staff, empowering them with the knowledge and competencies to recognize, address, and prevent hate speech across digital and traditional media platforms.",
      "This activity underscores the university’s proactive stance in integrating gender sensitivity, ethical communication, and digital literacy into professional development. By examining how gender and communication intersect, the seminar emphasized the importance of fostering respect, equality, and empathy in all forms of discourse within the institution. Participants were guided in identifying subtle forms of gender bias, stereotyping, and discriminatory language, allowing them to develop a more critical and informed perspective when engaging in both personal and institutional communication."
    ],
    "documentUrl": "../pdf/sdg4_p35.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Research Competence Through Advanced Statistical Analysis Seminar-Workshop Series in Support of SDG 4",
    "image": "../images/sdg4_i5.18.png",
    "layout": "left-img",
    "content": [
      "In its continuous pursuit of academic excellence and evidence-based learning, Urdaneta City University (UCU) launched the Advanced Statistical Analysis Seminar-Workshop Series, reaffirming its commitment to Sustainable Development Goal 4 (Quality Education). This initiative aims to enhance the research capacity of College Deans, Program Heads, and Research Coordinators, empowering them with advanced statistical knowledge essential for academic and institutional development.",
      "Recognizing the vital role of data-driven decision-making in higher education, the seminar provided participants with the tools and techniques needed to analyze complex datasets, interpret findings accurately, and apply statistical evidence to support academic and administrative decisions. The workshop emphasized critical thinking and analytical precision, guiding participants in selecting appropriate statistical methods suited to specific research questions and data types."
    ],
    "documentUrl": "../pdf/sdg4_p36.pdf"
  },
  {
    "title": "Urdaneta City University Fosters Teamwork and Collaboration Through “The Power of Unity: Enhancing Team Cohesion” in Support of SDG 4",
    "image": "../images/sdg4_i5.19.png",
    "layout": "left-img",
    "content": [
      "Demonstrating its commitment to Sustainable Development Goal 4 (Quality Education), Urdaneta City University (UCU) launched “The Power of Unity: Enhancing Team Cohesion”, a team-building initiative designed to strengthen collaboration, trust, and communication among its administrative staff. The activity reflects UCU’s belief that a united and motivated workforce serves as the backbone of an effective and learner-centered institution.",
      "The program emphasized the importance of team synergy, open communication, and collective problem-solving in achieving the university’s mission and vision. Through interactive activities and reflective sessions, participants learned how to foster mutual respect, strengthen interpersonal relationships, and embrace a shared sense of purpose. The initiative also aimed to develop a supportive workplace culture where every member feels valued, understood, and empowered to contribute meaningfully to institutional success."
    ],
    "documentUrl": "../pdf/sdg4_p37.pdf"
  },
  {
    "title": "Urdaneta City University Champions SDG 4 Through Inclusive Learning Opportunities",
    "image": "../images/sdg4_i5.20.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to affirm its strong commitment to Sustainable Development Goal (SDG) 4 – Quality Education by providing inclusive, accessible, and lifelong learning opportunities for all. In line with this mission, the university consistently opens its doors to the public through Executive Education Programs and Vocational Training Courses designed to empower individuals with relevant knowledge and practical skills.",
      "Guided by its vision of transforming lives through education, UCU ensures that learning extends beyond the traditional classroom setting. Its executive education programs are tailored to meet the evolving needs of professionals, community leaders, and aspiring entrepreneurs who seek to enhance their competencies and leadership capabilities in their respective fields. These programs integrate global perspectives and local relevance, fostering both professional growth and community development."
    ],
    "documentUrl": "../pdf/sdg4_p38.pdf"
  },
  {
    "title": "Four-day Seminar-Workshop on Research Proposal Writing",
    "image": "../images/sdg4_i5.21.png",
    "layout": "left-img",
    "content": [
      "From November 15 to 18, 2021, Urdaneta City University (UCU) successfully hosted a four-day Proposal Writing Webinar-Workshop, offering teachers an intensive learning experience complete with Continuing Professional Development (CPD) units. The online event, conducted via Zoom, marked the beginning of an organized research journey for educators eager to delve into paper writing and presentation.",
      "Participants were encouraged to register in advance, and the high interest underscored the commitment among educators to enhance their research skills. This workshop aimed to guide participants through the fundamentals of research proposal development and was the first phase in a structured series designed to take teachers from proposal writing to final paper presentation."
    ],
    "documentUrl": "../pdf/sdg4_p39.pdf"
  },

  {
    "title": "Three-day Research Writing Webinar Workshop – Output Based 2022",
    "image": "../images/sdg4_i5.22.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University recently concluded its highly anticipated PRC-accredited training program, “Research Writing Webinar Workshop – Output Based 2022,” held from December 12 to 14, 2022. The three-day online event attracted numerous Professional Licensed Teachers and other interested individuals, eager to enhance their research writing skills. The workshop provided an excellent opportunity for participants to earn 10 Continuing Professional Development (CPD) points while gaining practical insights into the research process.",
      "Throughout the workshop, participants were guided step-by-step in the creation of research outputs, with a focus on output-based learning. This approach aimed to equip attendees with the knowledge and skills to develop research papers that meet academic standards and are ready for publication. The training covered key aspects of research writing, from formulating clear hypotheses to organizing and presenting research findings effectively."
    ],
    "documentUrl": "../pdf/sdg4_p40.pdf"
  },
  {
    "title": "Three-day onsite workshop on “Research Writing: Statistical Data Analysis, Results and Discussion, Conclusion, and Recommendation”",
    "image": "../images/sdg4_i5.23.png",
    "layout": "left-img",
    "content": [
      "From February 8 to 10, 2023, Urdaneta City University’s Center of Training and Professional Development held the second phase of its Professional Regulation Commission (PRC) accredited CPD program on advanced research writing. The three-day onsite workshop, “Research Writing: Statistical Data Analysis, Results and Discussion, Conclusion, and Recommendation,” provided teachers with an opportunity to earn eight Continuing Professional Development (CPD) units while enhancing their research skills.",
      "Held at the University Cafeteria, the event attracted numerous educators eager to deepen their understanding of data analysis and refine their research presentation techniques. The program featured a carefully curated lineup of topics, beginning with statistical data analysis and moving through the critical stages of results and discussion, concluding with sections on crafting effective conclusions and recommendations."
    ],
    "documentUrl": "../pdf/sdg4_p41.pdf"
  },
  {
    "title": "Three-day Seminar Workshop on Research Writing: Statistical Data Analysis, Results, and Discussion, Conclusion, and Recommendation",
    "image": "../images/sdg4_i5.24.png",
    "layout": "right-img",
    "content": [
      "The Urdaneta City University - Center of Training and Professional Development (UCU CTPD) successfully concluded the second phase of its on-site training program,  \"Research Writing: Statistical Data Analysis, Results, and Discussion, Conclusion, and Recommendation.\" Held on February 8-10, 2023, at the UCU Cafeteria, the program aimed to equip professional teachers with the skills needed to excel in research writing.",
      "The intensive three-day workshop provided participants with in-depth knowledge of various aspects of research writing, including statistical data analysis, results and discussion sections, conclusion formulation, and recommendation development. Participants who qualified as CPD earners received a total of 8 CPD points upon completion of the program."
    ],
    "documentUrl": "../pdf/sdg4_p42.pdf"
  },
  {
    "title": "Webinar for Registered Pharmacists on Antimicrobial Stewardship in Hospital Setting",
    "image": "../images/sdg4_i5.25.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines – The Urdaneta City University-Center for Training and Professional Development (UCU-CTPD) recently concluded a successful webinar titled “Antimicrobial Stewardship in Hospital Setting.” The event, held on April 23, 2023, via Zoom, attracted a significant number of registered pharmacists.",
      "The webinar featured an insightful presentation by Mr. Mark Clyde D. Daoana, PharmD, RPh, who shared his expertise on best practices in antimicrobial stewardship. The session delved into the critical role of pharmacists in promoting the appropriate use of antibiotics, thereby mitigating the growing threat of antimicrobial resistance."
    ],
    "documentUrl": "../pdf/sdg4_p43.pdf"
  },
  {
    "title": "Three-day Seminar Workshop on Teaching Excellence and Professionalism for Effective Learning Facilitation",
    "image": "../images/sdg4_i5.26.png",
    "layout": "right-img",
    "content": [
      "The Urdaneta City University - Center for Training and Professional Development (UCU CTPD) successfully conducted a three-day on-site seminar-workshop titled \"Teaching Excellence and Professionalism for Effective Learning Facilitation.\" Held on June 5-7, 2024, at the UCU Cafeteria, the program aimed to equip educators with the necessary skills and knowledge to enhance their teaching practices.",
      "The intensive workshop provided participants with a comprehensive understanding of effective learning facilitation methods. It focused on fostering professional development and promoting teaching excellence in the classroom. Participants who qualified as CPD earners were awarded a total of 10 CPD units for their participation."
    ],
    "documentUrl": "../pdf/sdg4_p44.pdf"
  },
  {
    "title": "Urdaneta City University Upholds Inclusivity in Education in Support of UN SDG 4",
    "image": "../images/sdg4_i5.27.png",
    "layout": "left-img",
    "content": [
      "Demonstrating its enduring commitment to inclusive and equitable quality education, Urdaneta City University (UCU) continues to embody the principles of the United Nations Sustainable Development Goal 4 (SDG 4)—ensuring that everyone has access to lifelong learning opportunities, regardless of background or circumstance.",
      "UCU’s inclusivity is reflected in the way it conducts its educational activities both on campus and beyond. Whether through classroom instruction, public lectures, or outreach initiatives in local schools and communities, the University ensures that education remains a right accessible to all—regardless of ethnicity, religion, disability, immigration status, or gender."
    ],
    "documentUrl": "../pdf/sdg4_p45.pdf"
  },
  {
    "title": "Urdaneta City University Policy for Equitable Access to Outreach Programs and Extension Activities",
    "image": "../images/sdg4_i5.28.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) is deeply committed to fostering an inclusive, equitable, and diverse academic environment across all of its outreach programs and extension activities. Consistent with its core values and aligned with the United Nations Sustainable Development Goal 4 (Quality Education), the University recognizes that quality learning must be accessible to everyone, regardless of ethnicity, religion, disability, immigration status, gender, or any other social characteristic.",
      "This policy seeks to guarantee that all outreach and extension programs are inclusive and accessible, identify and eliminate barriers for marginalized groups, foster cultural awareness and respect, and ensure equity and accessibility in program design, implementation, and evaluation."
    ],
    "documentUrl": "../pdf/sdg4_p46-50.pdf"
  }
]
