[
  {
    "title": "UCU Champions Women’s Participation in Underrepresented Fields",
    "image": "../images/sdg5_5.3.4.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to advance gender equality and inclusive education through initiatives that actively empower women to pursue academic programs where they have been historically underrepresented. This effort highlights the University's strong commitment to creating learning environments where women are encouraged to explore diverse academic and professional pathways.",
      "In alignment with Sustainable Development Goal 5 – Achieve Gender Equality and Empower All Women and Girls, UCU has launched a university-wide campaign to support female students in entering disciplines such as criminology, engineering, information technology, and the sciences. These fields have traditionally seen lower female participation, and UCU’s initiative aims to break these barriers by promoting equal opportunity, fostering innovation, and strengthening diversity across all programs."
    ],
    "documentUrl": "../pdf/sdg5_5.3.4.pdf"
  },
  {
    "title": "Urdaneta City University Reinforces Commitment to SDG 5 Through Strict Implementation of Anti-Retaliation Policy",
    "image": "../images/sdg5_5.6.8.png",
    "layout": "left-img",
    "content": [
      "In strong support of Sustainable Development Goal 5: Gender Equality, Urdaneta City University (UCU) has reaffirmed its dedication to building an inclusive and equitable academic environment through the strict implementation of its Policy on Protection Against Retaliation for Reporting Discrimination. This policy demonstrates the university’s firm stance against all forms of discrimination and retaliation, ensuring that every student, faculty member, and staff member enjoys equal rights and opportunities within the institution.",
      "UCU emphasizes that a truly inclusive community is one where individuals can report discriminatory behavior without fear of retribution. Aligned with SDG 5—which advocates for the elimination of discrimination and violence against women and other vulnerable groups—the university provides strong protective measures for anyone who reports gender-based or other discriminatory acts. By fostering a safe and supportive environment, UCU strengthens its ongoing commitment to equality, empowerment, and the protection of all members of its community."
    ],
    "documentUrl": "../pdf/sdg5_5.6.8.pdf"
  },
  {
    "title": "Urdaneta City University Champions Gender Equality Through Data-Driven Inclusivity",
    "image": "../images/sdg5_i5.1.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Philippines — Demonstrating its firm commitment to promoting gender equality and inclusivity in higher education, Urdaneta City University (UCU) has adopted a systematic approach to measure and track women’s application and acceptance rates across its academic programs.",
      "Led by the UCU Admissions Department, this initiative gathers and analyzes demographic data to assess gender representation and ensure equitable access to educational opportunities. Through this data-driven approach, the University can monitor the percentage of female applicants and their corresponding acceptance rates in real time—providing a clear picture of women’s participation in the admissions process."
    ],
    "documentUrl": "../pdf/sdg5_p2.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Support for Gender Equality Through Women’s Access and Empowerment Initiatives",
    "image": "../images/sdg5_i5.2.png",
    "layout": "left-img",
    "content": [
      "In Support of the United Nations Sustainable Development Goal 5 (Gender Equality)",
      "Urdaneta City, Philippines — In a continued effort to advance gender equality and empower women in education, Urdaneta City University (UCU) has launched a comprehensive memorandum outlining initiatives to promote women’s access, acceptance, and participation across academic and professional pathways.",
      "Through Memorandum No. 3, s. 2022, issued by the Office of the Director for External Affairs and Linkages, UCU reinforces its commitment to the United Nations Sustainable Development Goal 5 (SDG 5): Achieve gender equality and empower all women and girls. The memorandum introduces several key access schemes designed to enhance women’s educational experiences and career prospects, particularly in fields where they have been historically underrepresented."
    ],
    "documentUrl": "../pdf/sdg5_p3-4.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to SDG 5: Empowering Women Through Access, Mentoring, and Opportunities",
    "image": "../images/sdg5_i5.4.png",
    "layout": "right-img",
    "content": [
      "In its continuing pursuit of inclusive and equitable education, Urdaneta City University (UCU) reaffirms its strong commitment to Sustainable Development Goal (SDG) 5 – Achieve Gender Equality and Empower All Women and Girls. The University recognizes that true progress is achieved when women are given equal access to education, mentorship, and leadership opportunities that allow them to reach their full potential.",
      "As part of this commitment, UCU has developed strategic initiatives designed to support and empower women across all academic disciplines. One of its flagship programs, the Women’s Mentoring Scheme, provides structured mentorship opportunities to at least 10% of the University’s female student population each year. Through this program, students are paired with mentors from among UCU faculty, alumni, and professional partners who help guide them in developing confidence, leadership, and career-readiness."
    ],
    "documentUrl": "../pdf/sdg5_p5-8.pdf"
  },
  {
    "title": "Breaking Barriers: UCU’s Non-Discrimination Policy Upholds Equality for All",
    "image": "../images/sdg5_i5.5.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — Urdaneta City University (UCU) continues to strengthen its reputation as a leader in inclusive education with the official implementation of its Non-Discrimination Policy, a landmark initiative promoting equality, respect, and fairness for every member of the university community.",
      "Aligned with the principles of the Gender and Development (GAD) Program and the United Nations Sustainable Development Goals (SDGs)—particularly SDG 5: Gender Equality and SDG 10: Reduced Inequalities—this policy reinforces UCU’s unwavering commitment to providing a learning and working environment free from bias, prejudice, and discrimination of any kind."
    ],
    "documentUrl": "../pdf/sdg5_p9-11.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Commitment to SDG 5 with Policy on Non-Discrimination Against Transgender Individuals",
    "image": "../images/sdg5_i5.6.png",
    "layout": "right-img",
    "content": [
      "In its continued pursuit of inclusivity and equality, Urdaneta City University (UCU) reinforces its support for the United Nations Sustainable Development Goal 5 (SDG 5): Achieve Gender Equality and Empower All Women and Girls through the implementation of its Policy on Non-Discrimination Against Transgender Individuals. This initiative affirms UCU’s dedication to creating a safe, respectful, and discrimination-free campus where every individual—regardless of gender identity or expression—is valued and given equal opportunity to thrive.",
      "The newly established policy underscores UCU’s proactive stance in promoting gender inclusivity and equality within its academic and professional environment. It ensures that all students, faculty, staff, and visitors experience fair treatment, respect, and dignity, consistent with the university’s core values and its mission to uphold human rights and diversity."
    ],
    "documentUrl": "../pdf/sdg5_p12-16.pdf"
  },
  {
    "title": "Urdaneta City University Upholds Gender Equality Through Maternity and Paternity Leave Policy",
    "image": "../images/sdg5_i5.7.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — Demonstrating its steadfast commitment to Sustainable Development Goal 5 (SDG 5): Achieve Gender Equality and Empower All Women and Girls, Urdaneta City University (UCU) continues to strengthen its policies that promote inclusivity, equality, and family welfare. Through the full implementation of its Maternity and Paternity Leave Policy, UCU ensures that all faculty and staff—both women and men—enjoy equal opportunities to care for their families without fear of discrimination or professional disadvantage.",
      "Anchored on the provisions of Republic Act No. 11210, also known as the 105-Day Expanded Maternity Leave Law, and Republic Act No. 8187, the Paternity Leave Act of 1996, UCU guarantees that its employees receive the benefits and protection they are entitled to under the law. The university, through its Human Capital Management Office (HCMO), actively guides employees in availing of these benefits and ensures that every member of the UCU community is well-informed about their rights as working parents."
    ],
    "documentUrl": "../pdf/sdg5_p17-21.pdf"
  },
  {
    "title": "UCU Strengthens Gender Equality with Accessible Childcare Facilities for Students and Faculty",
    "image": "../images/sdg5_i5.8.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Philippines — In a significant step toward achieving Sustainable Development Goal 5 (SDG 5): Gender Equality, Urdaneta City University (UCU) proudly announces the opening of its accessible childcare facilities located within the University Clinic. This initiative reflects UCU’s strong commitment to empowering women—particularly recent mothers—and ensuring that no student or faculty member is left behind due to family responsibilities.",
      "By providing safe and affordable on-campus childcare, UCU reinforces its dedication to creating a family-friendly, inclusive, and discrimination-free environment where both students and employees can thrive. This initiative allows student-mothers to continue their education without compromising their childcare duties, aligning with UCU’s broader mission to promote equal opportunities and support the academic and professional growth of all members of the university community."
    ],
    "documentUrl": "../pdf/sdg5_p22-24.pdf"
  },
  {
    "title": "UCU Advances Gender Equality with Accessible Childcare Facilities for Faculty and Staff",
    "image": "../images/sdg5_i5.13.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — In a move that reinforces its dedication to Sustainable Development Goal 5 (SDG 5): Achieve Gender Equality and Empower All Women and Girls, Urdaneta City University (UCU) proudly announces the opening of its accessible childcare facilities located within the University Clinic. This initiative highlights UCU’s steadfast commitment to building a family-friendly, inclusive, and equitable campus where faculty and staff with young children can thrive both personally and professionally.",
      "The establishment of the childcare facility reflects UCU’s understanding of the challenges faced by working parents—especially women—who balance professional responsibilities with family care. By providing a safe and accessible childcare space, the university ensures that no faculty or staff member is hindered from pursuing their career or professional growth due to parental duties."
    ],
    "documentUrl": "../pdf/sdg5_p25-26.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to SDG 5: Empowering Women Through Access, Mentoring, and Opportunities",
    "image": "../images/sdg5_i5.10.png",
    "layout": "right-img",
    "content": [
      "In its continuing pursuit of inclusive and equitable education, Urdaneta City University (UCU) reaffirms its strong commitment to Sustainable Development Goal (SDG 5) – Achieve Gender Equality and Empower All Women and Girls. The University recognizes that true progress is achieved when women are given equal access to education, mentorship, and leadership opportunities that allow them to reach their full potential.",
      "As part of this commitment, UCU has developed strategic initiatives designed to support and empower women across all academic disciplines. One of its flagship programs, the Women’s Mentoring Scheme, provides structured mentorship opportunities to at least 10% of the University’s female student population each year. Through this program, students are paired with mentors from among UCU faculty, alumni, and professional partners who help guide them in developing confidence, leadership, and career-readiness."
    ],
    "documentUrl": "../pdf/sdg5_p28-31.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Gender Equality Efforts by Tracking Women’s Academic Success",
    "image": "../images/sdg5_i5.11.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City, Philippines — In line with its strong advocacy for gender equality and empowerment, Urdaneta City University (UCU) continues to reinforce its commitment to Sustainable Development Goal 5 (SDG 5): Achieve Gender Equality and Empower All Women and Girls by implementing proactive measures to track and promote women’s academic success across all programs.",
      "Through its data-driven approach, UCU monitors the graduation likelihood of women compared to men, identifying trends and potential barriers that may affect female students’ academic completion rates. This initiative aims to ensure that every student—regardless of gender—has equal access to education, opportunities, and support needed to reach graduation and beyond."
    ],
    "documentUrl": "../pdf/sdg5_p33-35.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Parental Leave Policy to Promote Gender Equality and Shared Caregiving Roles",
    "image": "../images/sdg5_i5.12.png",
    "layout": "right-img",
    "content": [
      "In its continuous effort to uphold Sustainable Development Goal 5: Achieve Gender Equality and Empower All Women and Girls, Urdaneta City University (UCU) has strengthened its Policy on Maternity and Paternity Leave to Support Women’s and Men’s Participation. The revised policy reinforces the university’s commitment to creating a family-friendly, inclusive, and gender-responsive workplace that values both women’s and men’s roles in caregiving and family life.",
      "The updated policy reflects UCU’s dedication to supporting faculty and administrative staff in balancing work and family responsibilities. It recognizes that both mothers and fathers play vital roles in nurturing families, and that a supportive institutional framework is essential to achieving true gender equality."
    ],
    "documentUrl": "../pdf/sdg5_p38-45.pdf"
  }
]
