[
  {
    "title": "Urdaneta City University Strengthens Water Management Through Comprehensive Usage Monitoring",
    "image": "../images/sdg6_i6.2.1.png",
    "layout": "right-img",
    "content": [
      "In its continuous commitment to sustainability and environmental responsibility, Urdaneta City University (UCU) has implemented a systematic approach to measure and monitor the total volume of water used across campus. This practice ensures efficient resource management, promotes conservation, and aligns with the principles of Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, particularly the target of improving water-use efficiency and ensuring sustainable water availability.",
      "Recognizing the growing importance of water conservation, UCU has taken proactive steps to assess how much water the university consumes from different sources — including the mains supply, rainwater catchments, and locally extracted water. By keeping accurate records, the university aims to identify patterns of consumption, detect potential wastage, and plan targeted interventions that reduce its environmental footprint."
    ],
    "documentUrl": "../pdf/sdg6_p2-4.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Environmental Stewardship Through Wastewater Treatment Practices",
    "image": "../images/sdg6_i6.2.2.png",
    "layout": "left-img",
    "content": [
      "Demonstrating its continued commitment to sustainability and environmental protection, Urdaneta City University (UCU) has implemented a comprehensive wastewater treatment process to ensure that all wastewater generated within the campus is properly managed before being released into the environment. This initiative supports the principles of Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, particularly in improving water quality and promoting responsible waste management.",
      "Recognizing the importance of maintaining clean and safe water systems, UCU established a structured process for collecting, treating, and monitoring wastewater generated from campus facilities such as laboratories, restrooms, canteens, and maintenance areas. The treatment system ensures that contaminants are removed, allowing the university to minimize environmental pollution and comply with local environmental regulations."
    ],
    "documentUrl": "../pdf/sdg6_p5-7.pdf"
  },
  {
    "title": "Urdaneta City University: Strengthening Water Pollution Prevention Systems on Campus",
    "image": "../images/sdg6_i6.2.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) upholds its commitment to environmental stewardship and campus sustainability through systematic measures that prevent polluted water from entering the municipal and natural water systems. Recognizing that even small-scale pollution from educational facilities can have cumulative environmental impacts, UCU ensures that its campus operations adhere to practices that protect local waterways and promote clean, safe, and sustainable water management.",
      "UCU maintains a comprehensive water management process designed to minimize the risk of pollution caused by daily campus activities and unexpected incidents. This includes ensuring that wastewater, chemical residues, and stormwater runoff are properly managed before being discharged into drainage systems."
    ],
    "documentUrl": "../pdf/sdg6_p8-10.pdf"
  },
  {
    "title": "Urdaneta City University: Promoting Access to Safe and Free Drinking Water on Campus",
    "image": "../images/sdg6_i6.2.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) is deeply committed to promoting health, well-being, and sustainability within its campus community. As part of its ongoing efforts to support the welfare of students, faculty, and visitors, the university ensures free access to clean and safe drinking water across various locations on campus.",
      "UCU has installed free drinking water stations and fountains strategically placed in high-traffic areas such as academic buildings, student lounges, administrative offices, and outdoor spaces. These facilities provide students, staff, and visitors with an easily accessible source of potable water throughout the day."
    ],
    "documentUrl": "../pdf/sdg6_p11-13.pdf"
  },
  {
    "title": "Urdaneta City University: Applying Building Standards to Minimize Water Use",
    "image": "../images/sdg6_i6.2.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its strong commitment to environmental sustainability and responsible resource management by integrating water-efficient building standards in its campus infrastructure. Recognizing that sustainable development begins within the physical spaces where learning takes place, UCU ensures that its facilities are designed and maintained to minimize water consumption, reduce waste, and protect natural resources.",
      "UCU adopts water-saving principles in the construction, maintenance, and operation of its buildings. The university’s Facilities and Environmental Management Office (FEMO) ensures that all new buildings and renovations follow practices aligned with the Philippine Green Building Code (NBCDO PD 1096 Referral Code, 2015), which promotes environmental efficiency and sustainability in building design and operation."
    ],
    "documentUrl": "../pdf/sdg6_p14-17.pdf"
  },
  {
    "title": "Urdaneta City University Promotes Water-Efficient Landscaping through Sustainable Plant Design",
    "image": "../images/sdg6_i6.2.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its commitment to environmental sustainability and water conservation by integrating eco-friendly landscaping practices across its campus. Recognizing the importance of responsible water management, UCU has adopted landscaping strategies that minimize water consumption while maintaining a green and aesthetically pleasing environment.",
      "Sustainable Landscaping Practices: The university’s landscape design emphasizes the use of drought-tolerant and native plant species, which require minimal watering once established. These plants are naturally adapted to local climate conditions, reducing the need for frequent irrigation and ensuring that the campus remains vibrant even during dry seasons. By prioritizing hardy, low-maintenance vegetation, UCU not only preserves water resources but also lowers maintenance costs."
    ],
    "documentUrl": "../pdf/sdg6_p18-19.pdf"
  },
  {
    "title": "Urdaneta City University: Implementing a Policy to Maximize Water Reuse Across Campus",
    "image": "../images/sdg6_i6.2.7.png",
    "layout": "right-img",
    "content": [
      "In support of the United Nations Sustainable Development Goal 6 (Clean Water and Sanitation), Urdaneta City University (UCU) has demonstrated its strong commitment to responsible water management through the creation and implementation of a Water Reuse and Conservation Policy. This policy was formally established in 2023 and underwent its first review in 2024, reflecting the university’s continuous effort to ensure sustainable water practices within its facilities.",
      "The UCU Water Reuse and Conservation Policy (2023) aims to minimize the university’s overall water footprint by maximizing the reuse of treated and harvested water across its academic, administrative, and recreational facilities. The policy establishes clear operational guidelines for the collection, treatment, storage, and redistribution of water, particularly from greywater and rainwater systems."
    ],
    "documentUrl": "../pdf/sdg6_p20-21.pdf"
  },
  {
    "title": "Advancing SDG 6: Clean Water and Sanitation through Water Reuse at Urdaneta City University",
    "image": "../images/sdg6_i6.2.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) takes a proactive stance in addressing one of the world’s most pressing environmental challenges: water scarcity. Guided by the United Nations’ Sustainable Development Goal (SDG) 6: Clean Water and Sanitation, the university implements innovative measures to promote water conservation and responsible management. One of its key sustainability efforts focuses on measuring and enhancing water reuse across the campus, a strategy that strengthens both operational efficiency and environmental stewardship.",
      "SDG 6 aims to “ensure availability and sustainable management of water and sanitation for all.” UCU’s initiative aligns directly with Targets 6.3 and 6.4: Target 6.3: Improve water quality by reducing pollution, eliminating dumping, and minimizing release of hazardous chemicals, and increasing water recycling and safe reuse. Target 6.4: Increase water-use efficiency across all sectors and ensure sustainable withdrawals to address water scarcity. Through systematic measurement and reuse of water resources, UCU contributes meaningfully to these global goals while embedding sustainability into the daily operations and academic culture of the university."
    ],
    "documentUrl": "../pdf/sdg6_p22-25.pdf"
  },
  {
    "title": "Urdaneta City University Promotes SDG 6: Clean Water and Sanitation through Community Education on Water Management",
    "image": "../images/sdg6_i6.2.9.png",
    "layout": "right-img",
    "content": [
      "In support of the United Nations’ Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, Urdaneta City University (UCU) has strengthened its commitment to community engagement by providing education and training opportunities on good water management practices. Recognizing that access to clean water and proper sanitation are vital to human health and environmental sustainability, the university extends its academic mission beyond campus boundaries to empower local communities with the knowledge and tools needed to protect and conserve water resources.",
      "UCU believes that education is one of the most powerful drivers of sustainable development. Through its community extension programs, environmental seminars, and student-led outreach initiatives, the university provides residents, youth, and local leaders with practical lessons on water conservation, sanitation practices, wastewater management, and pollution prevention."
    ],
    "documentUrl": "../pdf/sdg6_p26-28.pdf"
  },
  {
    "title": "Urdaneta City University Extends Support for Water Conservation Beyond Campus",
    "image": "../images/sdg6_i6.3.0.png",
    "layout": "left-img",
    "content": [
      "In its steadfast commitment to the United Nations’ Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, Urdaneta City University (UCU) continues to expand its environmental advocacy beyond the confines of the campus. Recognizing that sustainable water management is a shared responsibility, UCU actively supports off-campus water conservation initiatives that engage communities, schools, and local government units in building a more water-secure and environmentally conscious society.",
      "UCU believes that education and sustainability must reach beyond classrooms and university gates. Through its community extension programs, environmental education drives, and partnership projects, the university helps local communities understand the importance of protecting and conserving water resources."
    ],
    "documentUrl": "../pdf/sdg6_p29-32.pdf"
  },
  {
    "title": "Urdaneta City University Practices Sustainable Water Extraction to Support SDG 6: Clean Water and Sanitation",
    "image": "../images/sdg6_i6.3.1.png",
    "layout": "right-img",
    "content": [
      "Committed to the principles of environmental stewardship and aligned with the United Nations Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, Urdaneta City University (UCU) continues to demonstrate leadership in responsible water sourcing and management. Recognizing that water is a finite and vital resource, the university ensures that all extraction and use of water—whether from groundwater aquifers, surface sources, or rainwater systems—is conducted through sustainable and science-based methods on its main and extension campuses.",
      "Through innovation, monitoring, and community collaboration, UCU strengthens its role as a model institution for sustainable water extraction and conservation in higher education.",
      "Responsible Water Sourcing: UCU’s primary water sources include deep-well aquifers within the university grounds, rainwater collection systems, and treated surface water from local supply networks. These sources are managed through a system that prioritizes controlled extraction volumes based on hydrogeological assessments, regular monitoring of groundwater levels to prevent over-pumping or depletion, and water quality testing to ensure safety and compliance with environmental standards. By adhering to these practices, UCU minimizes its ecological footprint and safeguards water availability for both present and future users."
    ],
    "documentUrl": "../pdf/sdg6_p33-36.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Partnerships with Government Agencies to Advance Water Security and SDG 6",
    "image": "../images/sdg6_i6.3.2.png",
    "layout": "left-img",
    "content": [
      "In pursuit of the United Nations’ Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, Urdaneta City University (UCU) continues to take proactive steps to promote water security through strong collaborations with local, regional, national, and international government agencies. Recognizing that access to clean and safe water is a shared responsibility, UCU integrates education, research, and community service with policy and governance efforts to ensure the sustainable management of water resources for present and future generations.",
      "Collaborating for Local and Regional Water Security: At the local and regional levels, UCU works closely with Urdaneta City’s Environment and Natural Resources Office (CENRO), the City Agriculture Office, and surrounding barangay councils to monitor water usage and improve community awareness on conservation practices."
    ],
    "documentUrl": "../pdf/sdg6_p37-39.pdf"
  },
  {
    "title": "Urdaneta City University Actively Promotes Conscious Water Usage on Campus",
    "image": "../images/sdg6_i6.3.3.png",
    "layout": "right-img",
    "content": [
      "In line with the United Nations’ Sustainable Development Goal 6 (SDG 6): Clean Water and Sanitation, Urdaneta City University (UCU) continues to strengthen its commitment to sustainable water management by promoting conscious water usage across the campus. Understanding that water is a vital yet limited resource, the university strives to cultivate a culture of responsibility among students, faculty, and staff to ensure that every drop of water is used wisely and sustainably.",
      "Fostering a Culture of Water Awareness: At the heart of UCU’s efforts is a mission to educate and inspire the campus community to adopt mindful water-use practices. Through environmental education campaigns, signage reminders, and integration of sustainability principles in classroom discussions, UCU encourages everyone to view water conservation as a shared duty."
    ],
    "documentUrl": "../pdf/sdg6_p40-42.pdf"
  }
]
