[
  {
    "year": "2024",
    "title": "Presentation UI GreenMetrics",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The UI GreenMetric World University Rankings evaluate universities worldwide based on their environmental sustainability efforts and green campus initiatives. This ranking system emphasizes critical indicators such as setting and infrastructure, energy and climate change, waste management, water conservation, transportation, and education and research.",
          "In light of the university’s ongoing efforts to improve its performance in the UI GreenMetric ranking, a presentation session was held with Atty. Diga, who provided expert insights and critical feedback. His recommendations helped identify actionable areas for improvement and reinforced the university’s commitment to sustainable campus development."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Solicit expert feedback and recommendations from Atty. Diga to strengthen the university’s green practices and improve reporting mechanisms.",
          "Identify gaps and opportunities for enhancing performance across the six UI GreenMetric categories to enable targeted improvements.",
          "Foster institutional dialogue and collaboration among various stakeholders involved in sustainability and campus operations."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The presentation and the ensuing discussion significantly contributed to the advancement of several United Nations Sustainable Development Goals (SDGs). It supported SDG 11: Sustainable Cities and Communities by promoting sustainable infrastructure development and thoughtful campus planning. The activity encouraged responsible resource use aligned with SDG 12: Responsible Consumption and Production, fostering more sustainable management practices. Efforts to reduce carbon emissions and improve energy efficiency directly supported SDG 13: Climate Action. Additionally, the focus on water conservation helped advance SDG 6: Clean Water and Sanitation. By integrating environmental education and research, the activity also contributed to SDG 4: Quality Education. Finally, the engagement fostered greater collaboration and partnership-building, reinforcing SDG 17: Partnerships for the Goals through inter-agency cooperation and expert involvement."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The session with Atty. Diga proved to be highly constructive and impactful, offering invaluable insights that enriched the university’s approach to sustainability. His expertise provided a valuable external perspective that helped illuminate both the strategic vision and the practical, operational aspects of the university’s ongoing sustainability efforts. Through the open exchange of ideas, the session fostered a collaborative atmosphere that encouraged various departments and units to take a more proactive and coordinated role in advancing green practices across the campus. This collaborative environment not only inspired renewed enthusiasm but also helped build a shared sense of responsibility toward achieving the university’s sustainability goals. Additionally, the engagement significantly strengthened internal awareness regarding the importance and relevance of the UI GreenMetric framework as a benchmark for environmental performance. By highlighting key areas for improvement and best practices, the session set the stage for more targeted, measurable, and effective sustainability initiatives moving forward, ultimately positioning the university to enhance its green credentials and contribute more meaningfully to global environmental objectives."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To further strengthen the university’s performance in global impact rankings and advance its commitment to the Sustainable Development Goals (SDGs), it is essential to establish an SDG Monitoring Committee responsible for collecting, validating, and reporting relevant data. This committee will ensure accuracy and consistency in data management while serving as a central hub for SDG-related information. Additionally, conducting internal workshops for both academic and administrative units will be crucial to disseminate the knowledge gained from training sessions and to align efforts across the entire university. Developing a comprehensive SDG-aligned strategic plan that incorporates measurable indicators will provide a clear roadmap for impact ranking participation and institutional sustainability goals. Enhancing inter-departmental coordination is also necessary to facilitate comprehensive and accurate data submission, fostering collaboration and shared responsibility. Finally, investing in digital tools tailored to support data management and reporting will enable the university to efficiently track progress and meet international ranking standards, ensuring a more effective and transparent approach to sustainability performance."
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Urdaneta City University’s Energy Efficiency Policy for Sustainable Infrastructure (2023–2024)",
    "image": "../images/sdg7_i7.1.png",
    "layout": "right-img",
    "content": [
      "In alignment with the United Nations Sustainable Development Goals (SDG 7: Affordable and Clean Energy and SDG 11: Sustainable Cities and Communities), Urdaneta City University (UCU) adopted and implemented its Energy Efficiency in Infrastructure Policy in 2023, which was thoroughly reviewed and enhanced in 2024.",
      "This policy serves as a guiding framework ensuring that all new construction and renovation projects on campus comply with recognized energy efficiency and sustainability standards, particularly the Philippine Green Building Code (2015), the Energy Efficiency and Conservation Act (Republic Act No. 11285), and the Department of Energy (DOE) Guidelines for Energy Efficiency in Buildings."
    ],
    "documentUrl": "../pdf/sdg7_p2.pdf"
  },
  {
    "title": "Urdaneta City University Policy on Energy Efficiency in Renovation and New Building Construction",
    "image": "../images/sdg7_i7.2.png",
    "layout": "left-img",
    "content": [
      "Policy Statement: Urdaneta City University is committed to energy-efficient and sustainable infrastructure development. All renovations and new constructions shall adhere to the Philippine Green Building Code (2015), Republic Act 11285 – Energy Efficiency and Conservation Act (2019), DOE Energy Efficiency Guidelines for Buildings, and relevant local ordinances.",
      "Policy Guidelines: Design and Planning include incorporating passive cooling and natural lighting, prioritizing energy-efficient lighting, HVAC systems, and appliances, and evaluating renewable energy integration (e.g., solar panels, hybrid systems). Construction and Renovation require contractors to comply with DOE standards, submit Energy Efficiency Compliance Reports, utilize eco-friendly materials, and retrofit existing structures where feasible."
    ],
    "documentUrl": "../pdf/sdg7_p3-4.pdf"
  },
  {
    "title": "Urdaneta City University Plans to Upgrade Campus Buildings for Higher Energy Efficiency",
    "image": "../images/sdg7_i7.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to take progressive steps toward sustainability and environmental responsibility through its plans to upgrade existing campus buildings to achieve higher energy efficiency. This initiative reflects the University’s strong alignment with Sustainable Development Goal (SDG) 7: Affordable and Clean Energy and SDG 11: Sustainable Cities and Communities.",
      "Recognizing the growing importance of energy conservation and climate action, UCU aims to integrate modern energy-saving systems into its facilities. These include the installation of LED lighting, solar panels, energy-efficient air conditioning units, and smart electrical systems designed to reduce energy consumption and operational costs."
    ],
    "documentUrl": "../pdf/sdg7_p5.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Its Commitment to Carbon Management and Emission Reduction",
    "image": "../images/sdg7_i7.4.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its strong commitment to environmental sustainability through the implementation of a carbon management process aimed at reducing carbon dioxide (CO₂) emissions across the campus. This initiative supports Sustainable Development Goal (SDG) 13: Climate Action and reflects the University’s dedication to promoting climate resilience and sustainable practices within its community.",
      "UCU actively monitors and manages its carbon footprint by adopting energy-efficient technologies, waste reduction systems, and sustainable transportation policies. The University promotes the use of renewable energy sources, such as solar power, and encourages paperless operations, digital transactions, and green procurement to minimize unnecessary resource consumption."
    ],
    "documentUrl": "../pdf/sdg7_p6.pdf"
  },
  {
    "title": "Urdaneta City University Implements Energy Efficiency Plan to Reduce Energy Consumption",
    "image": "../images/sdg7_i7.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its commitment to sustainability and environmental stewardship through the implementation of an Energy Efficiency Plan designed to reduce overall energy consumption across the campus. This initiative supports both Sustainable Development Goal (SDG) 7: Affordable and Clean Energy and SDG 13: Climate Action, underscoring the University’s dedication to promoting responsible energy use and climate-conscious operations.",
      "Under this plan, UCU prioritizes the adoption of energy-saving technologies and sustainable operational practices. These include the use of LED lighting systems, solar-powered facilities, energy-efficient appliances, and the enforcement of energy conservation policies within all university buildings. Regular energy audits are also conducted to identify areas for improvement and ensure that the campus remains efficient and eco-friendly."
    ],
    "documentUrl": "../pdf/sdg7_p7.pdf"
  },
  {
    "title": "Urdaneta City University Conducts Regular Energy Reviews to Reduce Wastage and Promote Efficiency",
    "image": "../images/sdg7_i7.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) remains steadfast in its commitment to sustainability and environmental responsibility by conducting regular energy reviews aimed at identifying areas where energy wastage is highest. This initiative directly supports Sustainable Development Goal (SDG) 7: Affordable and Clean Energy and SDG 13: Climate Action, as the University strives to promote efficient energy use and reduce its environmental footprint.",
      "Through systematic energy assessments, UCU evaluates the performance of its facilities, equipment, and daily operations to determine opportunities for improvement. These reviews help the University identify inefficient systems, recommend upgrades, and develop strategies to optimize energy use across all departments and buildings."
    ],
    "documentUrl": "../pdf/sdg7_p8.pdf"
  },
  {
    "title": "Urdaneta City University Advocates a Public Pledge Toward 100% Renewable Energy",
    "image": "../images/sdg7_i7.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) remains a strong advocate for sustainability and climate responsibility through its active promotion of a public pledge toward 100% renewable energy. Extending its efforts beyond the campus, UCU encourages the broader community to join its vision of a clean, sustainable, and energy-secure future, in alignment with Sustainable Development Goal (SDG) 7: Affordable and Clean Energy, SDG 11: Sustainable Cities and Communities, and SDG 13: Climate Action.",
      "To strengthen this advocacy, the University organizes public petitions, awareness meetings, community discussions, and environmental events that highlight the urgent need to transition from fossil fuels to renewable energy sources such as solar, wind, and hydro power. These activities empower individuals and organizations to take part in shaping a greener and more sustainable society."
    ],
    "documentUrl": "../pdf/sdg7_p10.pdf"
  },
  {
    "title": "Urdaneta City University Supports Local Industries in Advancing Energy Efficiency and Clean Energy Solutions",
    "image": "../images/sdg7_i7.8.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) demonstrates its strong commitment to sustainability and innovation by providing direct services to local industries that aim to enhance energy efficiency and promote the adoption of clean and renewable energy technologies. This initiative is in line with Sustainable Development Goal (SDG) 7: Affordable and Clean Energy, SDG 9: Industry, Innovation, and Infrastructure, and SDG 13: Climate Action.",
      "Through collaborative efforts, UCU assists local businesses and organizations in conducting energy efficiency assessments, workshops, and research on renewable energy options. These services are designed to help industries optimize energy use, reduce operational costs, and minimize their environmental impact."
    ],
    "documentUrl": "../pdf/sdg7_p11.pdf"
  },
  {
    "title": "Urdaneta City University Partners with Government in Advancing Clean Energy and Energy Efficiency Policies",
    "image": "../images/sdg7_i7.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to demonstrate its leadership in sustainability, research, and community engagement by informing and supporting government efforts in the development of clean energy and energy-efficient technology policies. This initiative aligns with Sustainable Development Goal (SDG) 7: Affordable and Clean Energy, SDG 11: Sustainable Cities and Communities, and SDG 13: Climate Action, reinforcing the University’s commitment to advancing climate action and sustainable innovation.",
      "Through academic research, technical studies, and expert consultations, UCU provides valuable insights that help local and regional government units create effective and evidence-based energy policies. The University collaborates with government agencies by offering research data, policy recommendations, and technical assistance related to renewable energy, efficient resource management, and sustainable infrastructure planning."
    ],
    "documentUrl": "../pdf/sdg7_p12.pdf"
  },
  {
    "title": "Urdaneta City University Empowers Start-Ups Toward Building a Low-Carbon and Sustainable Future",
    "image": "../images/sdg7_i7.10.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) continues to strengthen its role as a center for innovation and sustainability by providing assistance to start-up enterprises that foster and support low-carbon economy and technology. This initiative aligns with Sustainable Development Goal (SDG) 7: Affordable and Clean Energy, SDG 9: Industry, Innovation, and Infrastructure, and SDG 13: Climate Action, reflecting the University’s commitment to promoting green innovation and environmental responsibility.",
      "Through its innovation and research programs, UCU assists start-ups and student entrepreneurs in developing eco-friendly technologies, energy-efficient systems, and sustainable business models that contribute to reducing carbon emissions. The University provides access to technical mentoring, research support, incubation facilities, and capacity-building workshops to help these emerging enterprises grow and succeed."
    ],
    "documentUrl": "../pdf/sdg7_p13.pdf"
  }
]
