[
  {
    "year": "2024",
    "title": "CDA REGION 1 - MOA SIGNING",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "Urdaneta City University (UCU) has a long-standing mandate to produce graduates who are not only employable but also capable of catalyzing local economic growth. Cooperatives, with their community-owned business model, offer a natural platform for inclusive development, yet the Region 1 cooperative sector still grapples with limited technical expertise and innovation. The Cooperative Development Authority (CDA) is the national body tasked with regulating and nurturing cooperatives. By formalizing a Memorandum of Agreement, UCU gains direct access to CDA’s policy guidance, training resources, and field networks, while CDA secures an academic partner to embed cooperative education in teacher preparation, business programs, and community-extension work."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Develop a certificate program in Cooperative Management embedded in UCU’s business curriculum.",
          "Conduct joint faculty-student research on cooperative best practices and sector challenges in Region 1.",
          "Deliver community-based training workshops on financial literacy, governance, and digital tools for local cooperatives.",
          "Establish an annual Cooperative Fair to connect students, cooperatives, and potential investors.",
          "Create a monitoring dashboard that tracks cooperative performance indicators and community impact."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The partnership advances SDG 4 (Quality Education) by integrating cooperative studies into formal curricula, SDG 8 (Decent Work & Economic Growth) through entrepreneurship and job creation in member-owned enterprises, and SDG 17 (Partnerships for the Goals) by linking academe, government, and grassroots organizations. Strengthened cooperatives also support SDG 11 (Sustainable Cities & Communities) by anchoring local economies in inclusive, democratic business structures."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "Initial stakeholder meetings reveal strong enthusiasm: 14 regional cooperatives have signaled intent to participate in training, and two local government units have pledged venue and logistics support. Baseline data collected by UCU’s Research Office show that only 38 % of surveyed cooperatives keep audited financial statements and 22 % use any form of digital bookkeeping. These gaps underscore the relevance of the planned workshops and certificate program. Key risks include securing sustained funding for outreach activities and managing faculty workload. However, the creation of a joint steering committee and an earmarked seed budget from both institutions mitigates these concerns and positions the MoA for early wins."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "Institutionalize a revolving fund—sourced from fair proceeds and modest cooperative membership fees—to underwrite annual training and research grants. This will reduce dependence on one-off project funds and ensure continuity. Pair quantitative metrics (e.g., cooperative survival rates, job creation) with qualitative feedback from members to evaluate impact each year. A balanced scorecard will guide iterative improvements, prevent mission drift, and keep the partnership aligned with the Sustainable Development Goals."
            ]
          }
        ]
      }
    ]
  },
  {
    "year": "2024",
    "title": "DOLE-RO 1 & UCU for Educational-Based Job Placement Office",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The establishment of the Educational-Based Job Placement Office at Urdaneta City University (UCU), in partnership with the Department of Labor and Employment - Regional Office 1 (DOLE-RO 1), marks a significant step toward enhancing the employability of graduating students. This initiative is rooted in the shared goal of bridging the gap between education and employment, ensuring that students are not only academically prepared but also professionally supported in finding relevant job opportunities.",
          "The activity represents a formal collaboration between the university and the labor sector to provide structured support for students through job placements, internships, and career development programs. By aligning academic training with labor market demands, the office aims to produce graduates who are more responsive and competitive in their respective industries. It serves as a centralized platform where students can access resources, guidance, and employment services tailored to their educational background and career goals.",
          "This milestone reinforces UCU's ongoing commitment to holistic student development and DOLE’s mission to promote inclusive employment opportunities. The creation of this office is a proactive response to the evolving needs of the workforce and a testament to the university’s dedication to supporting students beyond the classroom, ultimately preparing them for meaningful and sustainable careers."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims:",
        "items": [
          "To bridge the gap between education and employment by providing structured job placement services and career support to students and graduates.",
          "To facilitate internships, employment opportunities, and career development programs that align with current industry needs and demands.",
          "To support the professional growth of students by equipping them with the necessary skills, guidance, and resources for successful entry into the workforce.",
          "To strengthen collaboration between the university and labor sector partners in promoting inclusive and accessible employment pathways for future graduates."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The establishment of the Educational-Based Job Placement Office at Urdaneta City University, in partnership with DOLE-RO 1, significantly contributes to SDG 4: Quality Education by ensuring that students receive not only academic instruction but also practical guidance on employment and career readiness. By offering job placement services, internship opportunities, and career counseling, the initiative makes education more relevant to real-world demands. It bridges the gap between learning and livelihood, enabling students to apply their knowledge and skills in professional environments after graduation.",
          "This initiative also directly supports SDG 8: Decent Work and Economic Growth by promoting access to productive employment for youth. By aligning educational outputs with labor market needs, the placement office helps graduates secure meaningful jobs that offer fair income and professional development. It aims to reduce youth unemployment and underemployment, which are common issues faced by fresh graduates, by providing direct pathways to employment through partnerships with industries and employers.",
          "Lastly, the program contributes to SDG 17: Partnerships for the Goals by strengthening collaboration between the university and government, particularly the Department of Labor and Employment. This partnership reflects a shared commitment to national development goals and highlights the power of joint efforts in solving unemployment and education-to-employment gaps. Through continuous coordination and resource-sharing, the initiative creates a sustainable support system that benefits students, employers, and the broader economy."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The establishment of the Educational-Based Job Placement Office at Urdaneta City University is a highly commendable initiative that addresses a critical need among graduating students — the transition from education to employment. The activity was well-organized and aligned with the university’s mission of producing career-ready graduates. It demonstrated strong institutional commitment to supporting students beyond academic instruction, by offering them access to job placement services and practical career development resources.",
              "One of the strengths of the activity was its strategic partnership with the Department of Labor and Employment (DOLE-RO 1). This collaboration brought credibility, resources, and expertise to the university’s employment facilitation efforts. The presence of labor officials during the launch emphasized the importance of cross-sectoral cooperation in addressing youth unemployment. Additionally, the creation of a dedicated office ensures sustainability and continuity in delivering employment support services to students and alumni.",
              "Overall, the activity met its intended objectives and was received positively by stakeholders. It laid the groundwork for a more structured and institutionalized approach to career development within the university. With continued support, proper staffing, and active engagement with industry partners, the Job Placement Office has the potential to become a key pillar in ensuring that UCU graduates are competitive, confident, and prepared to contribute to national and global development."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To maximize the impact of the Job Placement Office, it is recommended that the university regularly conduct labor market needs assessments and align its academic offerings and career services accordingly. This would help ensure that graduates possess the skills and competencies currently in demand across industries. Additionally, the office should implement digital platforms for job postings, virtual career counseling, and online application systems to make services more accessible to students and alumni.",
              "Another key recommendation is to strengthen engagement with external partners, including local businesses, government agencies, and alumni networks. Building strong relationships with employers can open doors for internships, on-the-job training, and employment opportunities. The office should also consider organizing career development seminars and workshops throughout the academic year, not only for graduating students but also for undergraduates, to build early awareness and preparation for future employment. Regular monitoring and feedback mechanisms should be established to evaluate the effectiveness of services and make continuous improvements."
            ]
          }
        ]
      }
    ]
  },
  {
    "year": "2024",
    "title": "PESO AND DOLE",
    "sections": [
      {
        "type": "intro_paragraph",
        "content": [
          "The visit by representatives from the Public Employment Service Office (PESO) and the Department of Labor and Employment (DOLE) was organized to strengthen collaborative partnerships aimed at enhancing employment opportunities and career development programs for students. This initiative reflects a strategic effort to bridge the gap between education and the labor market by fostering closer ties between government labor agencies and academic institutions. During the visit, key activities included productive discussions with university officials, interactive sessions with students, and informative presentations on current labor market trends and available employment services. The activity emphasized a shared commitment to equipping students with relevant skills and knowledge, thereby improving their readiness to succeed in the workforce and contributing to sustainable employment outcomes."
        ]
      },
      {
        "type": "aims_list",
        "title": "This projects aims to:",
        "items": [
          "Strengthen partnerships between the university and key government labor agencies, namely PESO and DOLE.",
          "Enhance employment opportunities for students through collaborative programs and initiatives.",
          "Provide students with updated information on labor market trends and available employment services.",
          "Facilitate interactive sessions to engage students in career development discussions and improve their workforce readiness."
        ]
      },
      {
        "type": "standard_section",
        "title": "Contributions to the Sustainable Development Goals",
        "content": [
          "The collaborative visit by PESO and DOLE contributes significantly to several Sustainable Development Goals. By enhancing employment opportunities and career development programs for students, the activity directly supports SDG 4 (Quality Education) by ensuring students receive relevant knowledge and skills aligned with labor market demands. It also advances SDG 8 (Decent Work and Economic Growth) by facilitating access to quality employment and promoting productive employment opportunities. The initiative promotes SDG 17 (Partnerships for the Goals) through strengthened collaboration between educational institutions and government agencies, fostering multi-stakeholder partnerships essential for sustainable development. Together, these efforts contribute to building a skilled, employable workforce, reducing unemployment, and supporting inclusive economic growth."
        ]
      },
      {
        "type": "two_column",
        "columns": [
          {
            "title": "General Assessment",
            "content": [
              "The visit from representatives of the Public Employment Service Office (PESO) and the Department of Labor and Employment (DOLE) was highly successful in strengthening the partnership between these agencies and the university. The collaborative discussions and interactive sessions effectively highlighted the shared commitment to enhancing employment opportunities and career development for students. The engagement provided valuable insights into current labor market trends and available employment services, which are crucial for aligning academic programs with workforce demands. Overall, the visit reinforced the connection between education and employment, equipping students with essential skills and knowledge to thrive in their future careers. This collaboration sets a strong foundation for ongoing initiatives that support student employability and community development."
            ]
          },
          {
            "title": "Recommendations",
            "content": [
              "To maximize the benefits of the PESO and DOLE visit, it is recommended to establish ongoing communication channels and formalize partnerships between the university and these government agencies to ensure sustained collaboration. Expanding interactive career workshops and job readiness training for students will further enhance their skills and employability. Regular updates on labor market trends and employment opportunities should be integrated into the university’s career services. Additionally, creating internship and job placement programs in partnership with PESO and DOLE can provide practical work experiences that bridge the gap between education and employment. Finally, involving students in feedback sessions will help tailor programs to better meet their career development needs and ensure continuous improvement."
            ]
          }
        ]
      }
    ]
  },
  {
    "title": "Urdaneta City University Strengthens Commitment to SDG 8 Through Living Wage Policy",
    "image": "../images/sdg8_i8.1.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reaffirmed its dedication to social responsibility and ethical governance with the release of its 2023 memorandum on Fair Compensation and Living Wage Standards, issued on April 3, 2023, by University President Atty. Amihan April C. Mella-Alcazar, PhD. The policy underscores the university’s pledge to ensure that all faculty and staff receive compensation that meets or exceeds the local living wage, in accordance with government standards and the poverty threshold for a family of four.",
      "This initiative highlights UCU’s adherence to the United Nations Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth, which promotes inclusive and sustainable economic progress through fair labor practices and just employment conditions. By guaranteeing that employees are paid fairly, UCU aims to foster a work environment that values human dignity, equality, and social justice."
    ],
    "documentUrl": "../pdf/sdg8_p2-4.pdf"
  },
  {
    "title": "Urdaneta City University Upholds SDG 8 Through Recognition of Unions for All Employees",
    "image": "../images/sdg8_i8.2.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to champion fair labor practices and inclusive governance through its 2023 memorandum on the Recognition of Unions and the Protection of Workers’ Rights, issued on April 3, 2023, by University President Atty. Amihan April C. Mella-Alcazar, PhD. The policy reinforces UCU’s recognition of all employees’ rights to organize and participate in labor unions, including women and international staff, in alignment with the United Nations Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth.",
      "The memorandum affirms UCU’s full compliance with national labor laws and its dedication to upholding the principles of fairness, inclusivity, and transparency in employment relations. By guaranteeing the freedom of association and protection of union rights, the university demonstrates its ongoing effort to promote decent work conditions and equitable treatment for all members of its workforce."
    ],
    "documentUrl": "../pdf/sdg8_p5-7.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Workplace Equality Through Anti-Discrimination Policy",
    "image": "../images/sdg8_i8.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Pangasinan — Upholding its commitment to the United Nations’ Sustainable Development Goal 8: Decent Work and Economic Growth, Urdaneta City University (UCU) has reinforced its stance on workplace fairness and inclusivity through a comprehensive policy aimed at ending all forms of discrimination within the institution.",
      "Signed by University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy ensures that all university employees—regardless of gender, sexuality, age, religion, ethnicity, or region—are provided with equal opportunities in employment, promotion, and professional development. The measure emphasizes the University’s dedication to maintaining a safe, respectful, and empowering work environment for all."
    ],
    "documentUrl": "../pdf/sdg8_p8-10.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Policy Against Forced Labour and Human Trafficking in Support of SDG 8",
    "image": "../images/sdg8_i8.4.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reaffirmed its strong stance against forced labour, modern slavery, human trafficking, and child labour through the release of a new institutional policy in January 2023. This initiative underscores the University’s commitment to the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, ensuring that all members of the academic community—faculty, staff, and students—are protected under fair and ethical standards.",
      "The policy, issued by University President Atty. Amihan April C. Mella-Alcazar, PhD, emphasizes the University’s zero tolerance for exploitative labour practices, whether within its operations or among its partners and contractors. It explicitly prohibits the employment of minors below the legal working age and mandates compliance with both national and international labour regulations. UCU further ensures that all employment relationships are grounded in free will, fair compensation, and respect for human dignity."
    ],
    "documentUrl": "../pdf/sdg8_p11-13.pdf"
  },
  {
    "title": "Urdaneta City University Upholds Equal Rights for Outsourced Workers in Support of SDG 8",
    "image": "../images/sdg8_i8.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reinforced its commitment to fair and ethical labor practices through a newly issued policy ensuring that outsourced and third-party workers receive the same rights and protections as directly employed university personnel. Released in January 2023 under the leadership of University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy aligns with the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, emphasizing the University’s dedication to equality, dignity, and justice in the workplace.",
      "The policy guarantees that all outsourced workers—such as janitorial, security, and maintenance staff—are entitled to fair wages, safe working environments, and protection from discrimination, in accordance with the Labor Code of the Philippines. It further requires all contractors and service providers engaged by the University to adhere to ethical employment standards and sign formal agreements ensuring compliance with national and international labor regulations."
    ],
    "documentUrl": "../pdf/sdg8_p14-16.pdf"
  },
  {
    "title": "Urdaneta City University Champions Pay Equity to Uphold SDG 8",
    "image": "../images/sdg8_i8.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) has strengthened its commitment to fair and inclusive employment by implementing a policy on pay scale equity and the elimination of gender pay gaps. Issued in January 2023 under the leadership of University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy reflects UCU’s adherence to the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, and reinforces its advocacy for gender equality and social justice in the workplace.",
      "The policy ensures that all faculty and staff are compensated fairly and equally, regardless of gender, position, or employment status. It emphasizes the University’s guiding principle of “equal pay for equal work,” guaranteeing that compensation is determined solely based on qualifications, performance, and responsibilities. In addition, the University has committed to conducting periodic pay equity assessments to identify and address any existing gender-based disparities in its compensation system."
    ],
    "documentUrl": "../pdf/sdg8_p17-19.pdf"
  },
  {
    "title": "UCU Upholds Pay Scale Gender Equity in Support of SDG 8",
    "image": "../images/sdg8_i8.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) reinforces its dedication to Sustainable Development Goal (SDG) 8—Decent Work and Economic Growth—by implementing a comprehensive policy that ensures pay scale gender equity across all levels of employment. The university emphasizes transparency, fairness, and inclusivity in compensation practices, aligning with its mission to foster an equitable academic and professional environment.",
      "The newly established policy mandates the consistent monitoring and evaluation of salary structures to identify and address any gender-based discrepancies in compensation. Through this initiative, UCU aims to guarantee that male and female employees performing comparable roles receive equal pay, reflecting the institution’s firm commitment to gender equality and workplace justice."
    ],
    "documentUrl": "../pdf/sdg8_p20-22.pdf"
  },
  {
    "title": "UCU Strengthens Employee Rights with Fair Appeals Policy in Line with SDG 8",
    "image": "../images/sdg8_i8.8.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to champion fairness and decent work practices through its newly implemented Policy on Employee Rights and Pay Appeals, reinforcing its alignment with the United Nations’ Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth. The policy guarantees that all employees—academic and non-academic—have the right to a transparent and fair process to appeal matters concerning their employment rights or compensation.",
      "The initiative underscores UCU’s commitment to ethical governance, equitable treatment, and accountability in the workplace. Under the policy, employees can formally file appeals regarding their pay or other employment-related concerns through the Human Resource Management Office (HRMO). The process ensures impartial evaluation, confidentiality, and protection from retaliation, with final decisions overseen by the Office of the University President."
    ],
    "documentUrl": "../pdf/sdg8_p23.pdf"
  },
  {
    "title": "UCU Upholds Labor Rights and Freedom of Association in Support of SDG 8",
    "image": "../images/sdg8_i8.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reaffirmed its dedication to promoting fair labor practices and inclusive employment by implementing its Policy on the Recognition of Labor Rights, Freedom of Association, and Collective Bargaining, a significant step that aligns with the principles of Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth. The policy guarantees that all employees—regardless of gender, employment status, or nationality—are granted the right to organize, associate, and participate in collective bargaining.",
      "This initiative highlights UCU’s commitment to ensuring an equitable, transparent, and respectful workplace. By recognizing the rights of all employees, including women and international staff, the university promotes open communication and fair negotiation between the administration and the workforce. The policy also protects employees from retaliation or discrimination for participating in union activities or exercising their right to representation."
    ],
    "documentUrl": "../pdf/sdg8_p24-25.pdf"
  }
]
