[
  {
    "title": "Urdaneta City University Strengthens Commitment to SDG 8 Through Living Wage Policy",
    "image": "../images/sdg8_i8.1.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) reaffirmed its dedication to social responsibility and ethical governance with the release of its 2023 memorandum on Fair Compensation and Living Wage Standards, issued on April 3, 2023, by University President Atty. Amihan April C. Mella-Alcazar, PhD. The policy underscores the university’s pledge to ensure that all faculty and staff receive compensation that meets or exceeds the local living wage, in accordance with government standards and the poverty threshold for a family of four.",
      "This initiative highlights UCU’s adherence to the United Nations Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth, which promotes inclusive and sustainable economic progress through fair labor practices and just employment conditions. By guaranteeing that employees are paid fairly, UCU aims to foster a work environment that values human dignity, equality, and social justice."
    ],
    "documentUrl": "../pdf/sdg8_p2-4.pdf"
  },
  {
    "title": "Urdaneta City University Upholds SDG 8 Through Recognition of Unions for All Employees",
    "image": "../images/sdg8_i8.2.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to champion fair labor practices and inclusive governance through its 2023 memorandum on the Recognition of Unions and the Protection of Workers’ Rights, issued on April 3, 2023, by University President Atty. Amihan April C. Mella-Alcazar, PhD. The policy reinforces UCU’s recognition of all employees’ rights to organize and participate in labor unions, including women and international staff, in alignment with the United Nations Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth.",
      "The memorandum affirms UCU’s full compliance with national labor laws and its dedication to upholding the principles of fairness, inclusivity, and transparency in employment relations. By guaranteeing the freedom of association and protection of union rights, the university demonstrates its ongoing effort to promote decent work conditions and equitable treatment for all members of its workforce."
    ],
    "documentUrl": "../pdf/sdg8_p5-7.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Workplace Equality Through Anti-Discrimination Policy",
    "image": "../images/sdg8_i8.3.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City, Pangasinan — Upholding its commitment to the United Nations’ Sustainable Development Goal 8: Decent Work and Economic Growth, Urdaneta City University (UCU) has reinforced its stance on workplace fairness and inclusivity through a comprehensive policy aimed at ending all forms of discrimination within the institution.",
      "Signed by University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy ensures that all university employees—regardless of gender, sexuality, age, religion, ethnicity, or region—are provided with equal opportunities in employment, promotion, and professional development. The measure emphasizes the University’s dedication to maintaining a safe, respectful, and empowering work environment for all."
    ],
    "documentUrl": "../pdf/sdg8_p8-10.pdf"
  },
  {
    "title": "Urdaneta City University Strengthens Policy Against Forced Labour and Human Trafficking in Support of SDG 8",
    "image": "../images/sdg8_i8.4.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reaffirmed its strong stance against forced labour, modern slavery, human trafficking, and child labour through the release of a new institutional policy in January 2023. This initiative underscores the University’s commitment to the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, ensuring that all members of the academic community—faculty, staff, and students—are protected under fair and ethical standards.",
      "The policy, issued by University President Atty. Amihan April C. Mella-Alcazar, PhD, emphasizes the University’s zero tolerance for exploitative labour practices, whether within its operations or among its partners and contractors. It explicitly prohibits the employment of minors below the legal working age and mandates compliance with both national and international labour regulations. UCU further ensures that all employment relationships are grounded in free will, fair compensation, and respect for human dignity."
    ],
    "documentUrl": "../pdf/sdg8_p11-13.pdf"
  },
  {
    "title": "Urdaneta City University Upholds Equal Rights for Outsourced Workers in Support of SDG 8",
    "image": "../images/sdg8_i8.5.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reinforced its commitment to fair and ethical labor practices through a newly issued policy ensuring that outsourced and third-party workers receive the same rights and protections as directly employed university personnel. Released in January 2023 under the leadership of University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy aligns with the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, emphasizing the University’s dedication to equality, dignity, and justice in the workplace.",
      "The policy guarantees that all outsourced workers—such as janitorial, security, and maintenance staff—are entitled to fair wages, safe working environments, and protection from discrimination, in accordance with the Labor Code of the Philippines. It further requires all contractors and service providers engaged by the University to adhere to ethical employment standards and sign formal agreements ensuring compliance with national and international labor regulations."
    ],
    "documentUrl": "../pdf/sdg8_p14-16.pdf"
  },
  {
    "title": "Urdaneta City University Champions Pay Equity to Uphold SDG 8",
    "image": "../images/sdg8_i8.6.png",
    "layout": "left-img",
    "content": [
      "Urdaneta City University (UCU) has strengthened its commitment to fair and inclusive employment by implementing a policy on pay scale equity and the elimination of gender pay gaps. Issued in January 2023 under the leadership of University President Atty. Amihan April C. Mella-Alcazar, PhD, the policy reflects UCU’s adherence to the United Nations Sustainable Development Goal 8: Decent Work and Economic Growth, and reinforces its advocacy for gender equality and social justice in the workplace.",
      "The policy ensures that all faculty and staff are compensated fairly and equally, regardless of gender, position, or employment status. It emphasizes the University’s guiding principle of “equal pay for equal work,” guaranteeing that compensation is determined solely based on qualifications, performance, and responsibilities. In addition, the University has committed to conducting periodic pay equity assessments to identify and address any existing gender-based disparities in its compensation system."
    ],
    "documentUrl": "../pdf/sdg8_p17-19.pdf"
  },
  {
    "title": "UCU Upholds Pay Scale Gender Equity in Support of SDG 8",
    "image": "../images/sdg8_i8.7.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) reinforces its dedication to Sustainable Development Goal (SDG) 8—Decent Work and Economic Growth—by implementing a comprehensive policy that ensures pay scale gender equity across all levels of employment. The university emphasizes transparency, fairness, and inclusivity in compensation practices, aligning with its mission to foster an equitable academic and professional environment.",
      "The newly established policy mandates the consistent monitoring and evaluation of salary structures to identify and address any gender-based discrepancies in compensation. Through this initiative, UCU aims to guarantee that male and female employees performing comparable roles receive equal pay, reflecting the institution’s firm commitment to gender equality and workplace justice."
    ],
    "documentUrl": "../pdf/sdg8_p20-22.pdf"
  },
  {
    "title": "UCU Strengthens Employee Rights with Fair Appeals Policy in Line with SDG 8",
    "image": "../images/sdg8_i8.8.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) continues to champion fairness and decent work practices through its newly implemented Policy on Employee Rights and Pay Appeals, reinforcing its alignment with the United Nations’ Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth. The policy guarantees that all employees—academic and non-academic—have the right to a transparent and fair process to appeal matters concerning their employment rights or compensation.",
      "The initiative underscores UCU’s commitment to ethical governance, equitable treatment, and accountability in the workplace. Under the policy, employees can formally file appeals regarding their pay or other employment-related concerns through the Human Resource Management Office (HRMO). The process ensures impartial evaluation, confidentiality, and protection from retaliation, with final decisions overseen by the Office of the University President."
    ],
    "documentUrl": "../pdf/sdg8_p23.pdf"
  },
  {
    "title": "UCU Upholds Labor Rights and Freedom of Association in Support of SDG 8",
    "image": "../images/sdg8_i8.9.png",
    "layout": "right-img",
    "content": [
      "Urdaneta City University (UCU) has reaffirmed its dedication to promoting fair labor practices and inclusive employment by implementing its Policy on the Recognition of Labor Rights, Freedom of Association, and Collective Bargaining, a significant step that aligns with the principles of Sustainable Development Goal (SDG) 8: Decent Work and Economic Growth. The policy guarantees that all employees—regardless of gender, employment status, or nationality—are granted the right to organize, associate, and participate in collective bargaining.",
      "This initiative highlights UCU’s commitment to ensuring an equitable, transparent, and respectful workplace. By recognizing the rights of all employees, including women and international staff, the university promotes open communication and fair negotiation between the administration and the workforce. The policy also protects employees from retaliation or discrimination for participating in union activities or exercising their right to representation."
    ],
    "documentUrl": "../pdf/sdg8_p24-25.pdf"
  }
]
